const n="빅데이터",e=[{index:2,topic:"Big Data",define:`- 수십 테라바이트(TB) 이상의 
정형/반정형/비정형 데이터
- 대량의 정형 또는 비정형 데이터 집합 및 
이러한 데이터로부터 가치를 추출하고 결과를 분석하는 기술`,head:`3V/4V 
: Volume, Variety, Velocity + Value 

활용 3요소 
: 자원(데이터),기술,인력

* DIKW 피라미드
Data-Information-Knowledge-Wisdom`,remark:null,image:["static/images/cellImage_1538922270_0.jpg"]},{index:3,topic:"지식창조모델 SECI",define:`- 노나카이쿠지로의 지식창조모델 SECI 
- 인간의 지적 창조 활동을 '암묵지'와 '형식지'로 구분하고 이 둘의 상호작용을 통하여 지적 창조활동이 이루워진다는 이론적 모델`,head:`공표내연
공동화(S)-표출화(E)-연결화(C)-내면화(I) 

- 암묵지: 언어로는 설명할 수 없이 전적으로 개인의 경험이나 능력에서 비롯되는 지식 
- 형식지: 언어로 명료화되어 전달될 수 있는 지식`,remark:null,image:["static/images/cellImage_1538922270_1.jpg"]},{index:4,topic:"빅데이터분석",define:`- 분석에 필요한 모든 변수를 활용하고 분석모델 개발 전 분석에 필요한 데이터들을 선정하는 다양한 기법으로 데이터 간의 인과관계를 먼저 분석한 후, 비즈니스적 의미를 추후 발견

* 전통적 DataWareHouse 아키텍처(정형) 그림`,head:"",remark:null,image:["static/images/cellImage_1538922270_2.jpg"]},{index:5,topic:"빅데이터분석 거버넌스 체계",define:`- 기업의 현재 분석 수준을 정확히 진단하고 분석 조직, 분석 전문인력 배치, 
    분석 관련 프로세스 성숙도 평가, 분석 교육 등의 관점에서 분석 환경을 
    지속적으로 개선하고 개발 및 확산하기 위한 과정(통제)`,head:"",remark:null,image:["static/images/cellImage_1538922270_3.jpg"]},{index:6,topic:"분석 수준 결과 진단",define:"- 각 기업이 수행하는 현재의 데이터 분석 수준을 명확히 이해하여 결과를 토대로 미래의 목표수준을 정의하기 위한 체계",head:`* 분석준비도 + 분석성숙도
 => 분석수준진단`,remark:`* 분석 수준 진단 4분면: 정확준도 
- 데이터 분석수준 목표 방향 정의, 개선방안 수립`,image:[]},{index:7,topic:"데이터 거버넌스",define:"데이터 분석을 기업의 문화로 정착하고 데이터 분석 업무를 지속적으로 고도화하기 위한 조직 내 분석 관리 체계",head:`중요관리대상 : 마스터/메타 데이터, 데이터사전, 빅브라더(정보 독점 문제점) 
구성요소 : 원칙/조직/절차 
데이터거버넌스체계 : 표준화, 관리체계, 저장소관리, 표준화 활동`,remark:null,image:[]},{index:8,topic:"조직 구조 유형",define:`집기분
- 집중구조: 전사분석 업무를 별도의 전담 조직에서 담당 
- 기능구조: 해당 업무 부서에서 분석수행 
- 분산구조: 분산 조직 인력을 현업부서로 직접 배치, 전사적 차원 지원, 업무과다 이원화 가능성`,head:"",remark:null,image:["static/images/cellImage_1538922270_4.jpg"]},{index:9,topic:"데이터 라벨러",define:"- 데이터 구축을 기획하고 데이터의 획득/저장/라벨링/품질검증 등을 수행하는 직무",head:"",remark:null,image:[]},{index:10,topic:"데이터 과학",define:"- 데이터로부터 의미있는 정보를 추출해 내는 학문",head:"",remark:null,image:[]},{index:11,topic:"데이터 과학자",define:`- 데이터를 이해/처리하는 능력, 데이터에서 가치를 뽑아내는 능력, 데이터를 시각화하는 능력, 데이터를 잘 전달하는 역할을 하는 직무

하드 스킬: 빅데이터에 대한 이론적 지식, 분석기술에 대한 숙련 
소프트 스킬: 통찰력, 설득력, 커뮤니케이션`,head:"",remark:null,image:["static/images/cellImage_1538922270_5.jpg"]},{index:12,topic:"데이터 과학자",define:"- 조직 내/외부 데이터의 관리/활용/분석 체계를 만들고 분석을 통해 기업의 의사결정을 이끌어 내는 직무",head:"",remark:null,image:[]},{index:13,topic:"알고리즈 미스트 (Algorithmist)",define:`- 데이터 과학자가 정의한 분석 및 인사이트로 인해 부당하게 폐해가
발생하는 것을 예방하는 전문가`,head:"",remark:null,image:[]},{index:14,topic:"빅데이터 라이프 사이클",define:"- 원천 데이터 > 데이터 수집 > 데이터 저장 > 데이터 처리/관리 > 데이터 분석 > 데이터 시각화",head:"수저처분시",remark:null,image:[]},{index:15,topic:"빅데이터 플랫폼",define:`- 빅데이터로부터 의미 있는 가치를 
도출하기 위해 
데이터 수집, 처리, 연계, 활용이 가능한 
표준 참조 모델`,head:`수저분시(수집, 저장, 분석, 시각화)
Scale Out: 수평확장, 저사양 여러대 
Scale Up: 수직확장, 고가의 장비로 대체 

3계층 : 소프트웨어/플랫폼/인프라`,remark:`- 빅데이터 라이프사이클 기반 아키텍처 
- 정형,비정형,반정형 수집 구조 
- Scale out 구조 
- 활용/시각화, 융합분석 구조`,image:[]},{index:16,topic:"하둡 에코시스템",define:`- 대용량 데이터 처리 분석을 위한 대규모 분산 컴퓨팅 지원 프레임워크 
- 파일을 분산저장하는 HDFS와 분산처리를 수행하는 MapReduce로 구현한 프레임워크
[두음]
원수저처분시
원천데이터-수집-저장-처리-분석-시각화`,head:"",remark:null,image:["static/images/cellImage_1538922270_6.jpg"]},{index:17,topic:"ㄴ맵리듀스(MapReduce)",define:`- 데이터를 Map(분할)하고,
결과를 Reduce(집계)하는 방식으로 
분산 처리의 복잡성을 단순화한 프로그래밍 모델
- HDFS(분산 파일 시스템)과 연동하여 동작`,head:`* 구성요소
작업 관리:JobTracker, TaskTracker
입력 처리:InputFormat
연산 처리:Mapper,Shuffle&Sort,Reducer
출력 처리:OutputFormat`,remark:null,image:[]},{index:18,topic:"ㄴ HDFS(Hadoop DistributedFile System)",define:"- 저비용의 수백~수천 노드 클러스터에서 기가~테라바이트급 대용량 데이터를 저장·관리하기 위해 설계된 파일 시스템",head:`* 구성요소
NameNode:메타데이터 관리
Secondary Name Node
DataNode:데이터 저장
Checkpoint:메타데이터 정합성 유지
Replication: 정보 복제 
Job Tracker, Task Tracker
: 맵리듀스와 매핑`,remark:null,image:["static/images/cellImage_1538922270_7.jpg"]},{index:19,topic:"하둡 3.0",define:"- 기존 YARN의 기능 강화, 확장성과 성능을 개선한 하둡 아키텍처",head:`* 주요 개선사항
- Java버전 업그레이드(8.0)
- Replication 방식 변화 > 오버헤드 감소 
- 맵리듀스 성능개선`,remark:`- 이레이저 코딩 지원
- 2개이상 Namenode 지원
- YARN Timeline Service v2`,image:[]},{index:20,topic:"HaaS(Hadoop as a Service, HDaaS)",define:"- 클라우드 인프라와 하둡과 하둡 에코시스템을 제공하고 사용자는 분석 플랫폼에 접속하여 이용하는 서비스",head:"",remark:null,image:[]},{index:21,topic:"빅데이터 수집기술",define:`- DB to DB, EAI, FTP, ETL, 
- 웹기반 수집기술: 크롤링, OpenAPI, 스트리밍
- 센싱
- RDB Aggregator: 스쿱, 히호
- 로그 수집기: 척와, 플럼, 스크라이브
- 카프카`,head:"",remark:null,image:[]},{index:22,topic:"ㄴ플럼(Flume)",define:"- 수많은 서버에 분산되어 있는 많은 양의 로그데이터를 한곳으로 모을 수 있도록 해주는 로그 수집기",head:`- Agent-tier->Collect-tier->Storage-tier
* 구성요소 
- Source: 외부 이벤트가 생성되어 수집되는 영역(1개 구성, 복수 Channel 지정)
- Channel: Source와 Sink 간의 버퍼 구간(채널 별로 1개 Sink 지정)
- Sink: 수집된 로그/이벤트를 목적지에 전달
- Interceptor: 수집된 로그/이벤트 가공`,remark:null,image:["static/images/cellImage_1538922270_8.jpg"]},{index:23,topic:"ㄴ척와(chukwa)",define:"- 대규모 분산 시스템의 로그수집 및 모니터링을 위한 데이터 수집 및 분석 프레임워크",head:`* 구성요소
- 데이터 소스: App Log, Metrics 등
- 수집 계층: Agent
- 집계 계층: Collector
- 저장 계층: Data Sink, Archiving, 
Demux, Structured Storage
- 분석 계층: MapReduce Jobs`,remark:null,image:["static/images/cellImage_1538922270_9.jpg"]},{index:24,topic:"ㄴ스쿱(Sqoop)",define:"- RDBMS와 하둡(HDFS)�간에 데이터를 효율적으로 전송할 수 있게 해주는 오픈소스 데이터 이동 도구",head:`* 구성요소
Sqoop Client
Connector
Import/Export Tool
Codegen Tool
MapReduce Job`,remark:null,image:["static/images/cellImage_1538922270_10.jpg"]},{index:25,topic:"ㄴ카프카(Kafka)",define:`- 분산 스트리밍 플랫폼
실시간 데이터 처리, 비동기 메시징, 데이터 파이프라인 구축을 위해 사용되는 고
성능 메시지 브로커`,head:`* 구성요소
데이터 생성 및 전송 : Producer
메시지 저장 및 전달 
: Broker, Topic, Partition
데이터 소비 : Consumer
메타데이터 및 상태 관리 : Zookeeper`,remark:null,image:["static/images/cellImage_1538922270_11.jpg"]},{index:26,topic:"빅데이터 저장기술",define:`- RDBMS: Oracle, MS-SQL, MySQL
- NoSQL: Redis, Cassandra, Hbase, MongoDB
- 분산파일시스템: HDFS
- Cloud 시스템: AWS W3, 구글 Cloud`,head:`* 몽고DB(mongoDB): 저장되어지는 형식이 정해져 있으나 구조에 대한 유연성을 보장하는 NoSQL (Replication, sharding)
* 구성요소  
- 샤드키
- mongos: 라우터 서버 
- mongod: 샤드서버(데이터), config 서버(환경설정)

- 마스터 슬레이브 방식 
- 쓰기연산은 master에서만 이루어지고 data store와 oplog 두군데 저장 
- oplog: 연산수행과 관련된 명령 자체를 타임스탬프와 같이 저장`,remark:null,image:["static/images/cellImage_1538922270_12.jpg"]},{index:27,topic:"빅데이터 처리/관리 기술",define:`* 아키텍처
람다(Lambda) Architecture
카파(Kappa) Architecture
델타(Delta) Architecture
* 플랫폼
하둡(Hadoop)
HDFS:분산저장, 블록, 복제, 내결함성
맵리듀스(MapReduce):병렬처리, 자동분산`,head:`-얀(YARN) 자원 관리
-스파크(Spark):디스크 I/O비용 효율화
-주키퍼(Zookeper) : 서비스 분산 처리
-암바리(Ambari):운영 편의성 제공
-피그(Pig):데이터 집합을 분석
-에어플로우(Airflow):워크플로우 오케스트레이션`,remark:null,image:[]},{index:28,topic:"빅데이터 분석/시각화 기술",define:`* 분석
텍스트 마이닝, 기계학습, SPSS, SAS
Excel, 타조(Tajo), 머하웃(Mahout)
* 분석/시각화
R, Python(판다스(Pandas))`,head:"",remark:null,image:[]},{index:29,topic:"람다(Lambda) 아키텍처",define:`- 대량의 데이터를 실시간으로 분석하기 위해, 배치로 미리 만든 데이터와 실시간 데이터를 혼합해서 사용가능한 실시간 분석 지원 빅데이터 아키텍처 

- 전송지연 최소화, 분석결과 일관성, 성능과 확장 균형 통한 정확성

스바서 
- 스피드레이어: 배치레이어 수행중 데이터 처리, 지연시간 최소화 지원
- 배치레이어: 유입되는 모든 데이터를 마스터 데이터셋에 저장, 계산후 뷰생성, 서빙레이어로 전달
- 서빙레이어: 사용자 요청시 배치뷰, 실시간 뷰를 병합하여 결과 제공`,head:"",remark:"위치 이동",image:["static/images/cellImage_1538922270_13.jpg"]},{index:30,topic:"카파(Kappa) 아키텍처",define:`- 람다 간편화
- 배치레이어를 제거, 모든 계산을 스피드 레이어에서 스트림으로 처리 
- 레이어간 코드 공유 복잡성 제거

스서
- 스피드 레이어 
- 서빙 레이어`,head:"",remark:"위치 이동",image:["static/images/cellImage_1538922270_14.jpg"]},{index:31,topic:"데이터 분석기획",define:"- 어떤 목표(What)을 달성하기 위하여(Why), 어떠한 데이터를 가지고, 어떠한 방식으로(How) 수행할 지에 대한 일련의 계획을 수립하는 과정",head:"분석 3요소 : 데이터, 분석모델, 분석가(데모가)",remark:null,image:[]},{index:32,topic:"ㄴ분석기획유형",define:`- 분석 기획을 결정하는 중요한 요인 : what, how

최솔통발
최적화(Optimization)
솔루션(Solution)
통찰(Insight)
발견(Discovery)`,head:"",remark:null,image:["static/images/cellImage_1538922270_15.jpg"]},{index:33,topic:"ㄴ분석기획유형",define:"목표 시점에 따른 데이터 분석 기획 유형",head:"",remark:null,image:["static/images/cellImage_1538922270_16.jpg"]},{index:34,topic:"데이터 분석 마스터 플랜",define:`지속적으로 분석이 주는 가치를 체계적으로 관리하고, 분석 역량을 내재화 하기 위한 단기적인 과제 수행과 중·장기적 관점의 수행 계획
 
플랜 수립 방법 :  정보전략계획(ISP) , 마스터 플랜 수립 프레임 워크(우선 순위 고려 사항, 적용 범위·방식 고려 사항)`,head:`* 데이터분석 마스터 플랜 수립 절차
- 수행과제 도출 > 우선순위평가 > 단기적 세부이행계획 > 중장기분석로드맵 수립

* 과제 우선순위 평가 기준 
- 전략적 중요도/ 실행용이성 
- ROI : 누적비지니스효과(Value) / 총투자비용(3V)
- 포트폴리오사분면 : 시급성과 난이도로 평가`,remark:null,image:[]},{index:35,topic:"분석과제 발굴",define:"분석 문제를 정의하는 과정 (데이터 분석 과제로 무엇이 가장 필요한 지 찾아내는 작업)",head:`* 분석과제방법론
- 방법론, 하향식/상향식 접근법
- 하향식 : 지도학습, 상향식 : 디자인싱킹, 비지도학습, 프로토타이핑`,remark:null,image:[]},{index:36,topic:"분석과제방법론",define:`* 하향식 접근법(문제해결)
- 현황에서 문제를 정의하고 분석과제를 도출 및 검증하는 방법론
* 절차(문정해타)
문제탐색 (비지니스모델기반(What), 외부사례기반) 
정의 (데이터분석 문제 변환(How))
해결방안탐색 (수행옵션 도출)
타당성검토(타당성평가 > 과제선정)

- 지도학습`,head:`* 상향식 접근법(문제발견)
- 데이터를 활용하여 생각하지 못했던 의미와 패턴을 도출하고 시행착오를 통해 개선해 나가는 방법론
* 절차(분분식정)
- 프로세스 분류 > 흐름분석 > 분석요건 식별 > 분석요건 정의

- 디자인씽킹(공감, 정의, 아이디어, 프로토타입, 테스트)
- 비지도학습(데이터 자체의 연관성, 유사성 확인)
- 프로토타이핑(시행착오 통한 문제해결)`,remark:null,image:["static/images/cellImage_1538922270_17.jpg"]},{index:37,topic:"데이터 분석 방법론",define:"- 생명주기에 따른 정형화된 절차 및 방법, 도구 등을 체계적으로 정리하여 표준화한 문서",head:`통데빅
- 통계적 방법론
- 데이터마이닝 방법론
- 빅데이터 분석 방법론`,remark:null,image:[]},{index:38,topic:"ㄴ통계적 방법론",define:"- 전통적인 통계분석을 위한 방법론으로 주로 학술연구에 많이 이용되는 방법론",head:`* 기법/유형 
- 기술통계, 추론통계, 빈도분석, 분산분석, 회귀분석 등`,remark:null,image:[]},{index:39,topic:"ㄴ데이터마이닝 방법론",define:"- 비즈니스 활용 목적으로 만들어진 방법론으로 대용량의 자료로부터 패턴을 파악해 유의미하게 데이터를 추출하는 방법론",head:`* 기법/유형 
- SEMMA, CRISP-DM, KDD 등`,remark:null,image:[]},{index:40,topic:"ㄴㄴKDD",define:"- 통계적 패턴이나 지식을 찾기 위해 체계적으로 정리한 방법론",head:`* 절차 : 선전변데평
> Selection(데이터 셋 선택)
> Preprocessing(전처리)
> Transformation(데이터 변환)
> Data Mining(데이터 마이닝) 
> Interpretation/Evaluation(평가)`,remark:null,image:[]},{index:41,topic:"ㄴㄴCRISP-DM",define:"- 비즈니스의 이해를 바탕으로 데이터 분석 목적의 6단계로 진행되는 데이터 마이닝 방법론",head:`* 구성요소 : 최일세프
- 단계(최상위), 일반화 task, 세분화 task, 프로세스 실행 

* 절차 : 업데데모평배
- 업무이해 > 데이터 이해 > 데이터 준비 > 모델링 > 평가 > 배포`,remark:null,image:["static/images/cellImage_1538922270_18.jpg"]},{index:42,topic:"ㄴㄴSEMMA",define:"- 통계중심 5단계 방법론",head:`* 절차 : 샘탐수모평
- Sampling(샘플링)
- Exploration(탐색)
- Modification(수정)
- Modeling(모델링)
- Assessment(검증)`,remark:null,image:["static/images/cellImage_1538922270_19.jpg"]},{index:43,topic:"ㄴ빅데이터 방법론",define:"- 빅데이터 출현으로 인한 비정형데이터 활용을 위한 새로운 분석 방법론",head:`* 기법/유형 
- 계층적 프로세스 모델
(3계층, 5단계절차)`,remark:null,image:[]},{index:44,topic:"ㄴㄴ계층적 프로세스 모델3단계 계층",define:`- 문제를 정의하고 답을 도출하기 위한 체계적 절차 및 방법 

* 계층: 단테스 
- 단계(Phase)- Process Group: 프로세스 그룹을 통해 완성된 단계별 산출물이 생성됨, 베이스라인설정, 버전관리 등을 통해 통제 수행
- 테스크(Task)- Mapping: 단계를 구성하는 단위 활동
- 스텝(Step)- Unit Process: input, 프로세스, output으로 구성된 단위 프로세스`,head:`* 절차: 기준분구평 
> 분석기획 
> 데이터준비 
> 데이터분석 
> 시스템 구현 
> 평가 및 전개`,remark:null,image:["static/images/cellImage_1538922270_20.jpg"]},{index:45,topic:"ㄴㄴ계층적 프로세스 모델5단계 절차",define:`1. Planning(분석 기획)
2. Preparing(데이터 준비)
3. Analyzing(데이터 분석)�
4. Developing(시스템 구현)
5. Deploying(평가 및 전개)�`,head:"",remark:null,image:["static/images/cellImage_1538922270_21.jpg"]},{index:46,topic:"데이터 확보 계획",define:`* 데이터 확보 계획 수립 절차
-목표정의
-요구사항도출
-예산안 수립
-데이터 확보 계획 수립

* 데이터 확보 고려사항: 위유수분비
- 데이터 위치: 내부, 외부
- 데이터 유형: 정형, 반정형, 비정형
- 수집기술: 크롤링, FTP, OpenAPI 등
- 분석방법: 통계기반, 데이터마이닝 기반, 변수 기반
- 비식별화`,head:`* 데이터 확보 방안 : 점필내외확 
- 데이터 확보 계획 점검 
- 필요 데이터 정의 
- 내부 데이터 확보 방안 
- 외부 데이터 확보 방안 
- 분석 데이터 확보 및 점검`,remark:null,image:[]},{index:47,topic:"ㄴ데이터 수집 절차",define:`* 데이터 수집 절차(도목소선계주실)
수집데이터 도출 > 목록작성 > 데이터 소유기관 파악 및 협의 > 수집 기술 선정 > 수집 계획서 작성 > 수집 주기 결정 > 데이터 수집 실행 

* 빅데이터 수집절차 (유수솔하검)
데이터 유형파악 > 수집기술 검토 > 수집 솔루션 확인 > 하드웨어 구축 > 실행환경 검토`,head:`수집대상 및 데이터선정 -->수집세부계획수립 --> 테스트 수집 실행

* 데이터 수집 고려요소(서데주저개)
- 서비스 활용여부, 데이터위치, 주기성, 수집데이터의 저장형태, 개인정보보호`,remark:null,image:["static/images/cellImage_1538922270_22.jpg"]},{index:48,topic:"ㄴㄴ데이터 유형 및 속성 파악",define:`* 데이터 유형 
- 구조(정형/반정형/비정형), 위치(내부/외부), 시간(실시간/비실시간), 저장 형태(파일/컨텐츠/스트림/데이터베이스)`,head:`* 데이터 속성파악  
- 척도 : 데이터의 속성(특성)을 구분 짓는 기준, 기준데이터에 일정한 규칙을 가지고 �데이터를 기호 또는 숫자로 표현하는 방법
- 범주형, 수치형, 측정척도(명서등비)`,remark:null,image:[]},{index:49,topic:"ㄴㄴㄴ척도(Scale)",define:"- 척도 : 데이터의 속성(특성)을 구분 짓는 기준, 기준데이터에 일정한 규칙을 가지고 �데이터를 기호 또는 숫자로 표현하는 방법",head:`* 척도에 따른 데이터 분류 
- 명목척도 : 혈액형, 남/여
- 서열척도 : 등수, 인기순서
- 등간척도 : 온도, 연도
- 비율척도 : 무게, 길이`,remark:null,image:["static/images/cellImage_1538922270_23.jpg"]},{index:50,topic:"ㄴ데이터 변환",define:`* 데이터 정제 
- 데이터 수집 후 데이터 유형과 분석 목적 등을 고려하여 데이터 전/후처리 과정을 통해 활용 목적에 맞도록 데이터를 변환하여 저장`,head:`1) 데이터 전처리 
- 수집 데이터를 저장소에 적재하기 위해 데이터 필터링, 유형변환, 정제 등의 기술을 사용해 데이터를 변환하는 과정 
2) 데이터 후처리 
- 저장 데이터를 분석에 용이하도록 변환, 통합, 축소 등의 기술을 사용해 가공하는 과정`,remark:null,image:["static/images/cellImage_1538922270_24.jpg"]},{index:51,topic:"ㄴㄴ데이터변환기법",define:`- 비정형 > 정형 : 평활화(변환), 집계(요약), 일반화(범용), 정규화(0~1), 표준화(평균0,표준편차1)
- 소수점스케일링(조정), 속성생성(특성생성), 범주화(변환), 데이타갯수 축소(샘플링), 차원축소`,head:`평집일정표
소속범데차`,remark:null,image:[]},{index:52,topic:"ㄴㄴ데이터 비식별화",define:`- 식별 가능한 데이터를 수정하여 특정 개인을 식별 할 수 없도록 처리하는 프로세스

- 데이터 수집, 저장, 처리, 분석 시 개인정보 포함여부, 데이터 연계시 보안, 실제 분석 진행 및 완료후 보안 고려
- 결합시 결합기준 확인

* 비식별화 적용 대상 (식준민)
- 식별자(주여면외), 준식별자(개인/신체특성), 민감정보(종교,정치성향등) 

식별 방지 - 가총삭범마
프라이버시 모델 - K익명성L다형성T근접성
가명정보 활용 - 동형암호화, 재현데이터`,head:"",remark:null,image:[]},{index:53,topic:"ㄴㄴㄴ식별 방지 방법",define:`* 가명처리(Pseudonymization)
- 휴리스틱 가명화
- 암호화
- 교환 방법

* 총계처리(Aggregation)
- 총계처리
- 부분총계
- 라운딩
- 재배열

* 데이터 삭제(Data Reduction)
- 식별자 삭제
- 식별자 부분삭제
- 레코드 삭제
- 식별요소 전부삭제`,head:`* 데이터 범주화(Data Suppression)
- 감추기
- 랜덤 라운딩
- 범위 방법
- 제어 라운딩

* 데이터 마스킹(Data Masking)
-임의 잡음 추가
-공백과 대체`,remark:null,image:[]},{index:54,topic:"ㄴㄴㄴ프라이버시 모델 - KLT",define:`재식별 가능성 검토 기법

* k-익명성 [두음:익연]
- 준식별자의 모든 가능한 조합에 해당하는 데이터의 갯수가 최소한 k개 이상이 되어야 한다는 조건을 구현한 기법 
- 연결 공격 방지

* l-다양성 [두음:다동배]
- 특정인 추론이 안된다고 해도 민감한 정보의 다양성을 높여 추론 가능성을 낮추는 기법 
- 동질성 또는 배경지식 등에 의한 추론 방지

*T-근접성[두음:근쏠유]
 - 전체데이터의 문포와 특정 정보의 분포차이를 t이하로 하여 추론 방지 
- 쏠림공격방어, 유사성공격방어`,head:"",remark:null,image:[]},{index:55,topic:"ㄴㄴ동형 암호화(Homomorphic Encryption)",define:`- 암호화 상태에서 데이터를 결합하고 연산/분석 등이 가능한 4세
대 암호화 기법`,head:`* 종류 
- 부분, 준, 완전
* 연산방식 유형 
- Gen09, DGHV10, CRT-Based
* 알고리즘 
- Paillier, RSA, BGV, BFV, CKKS, 
TFHE`,remark:null,image:["static/images/cellImage_1538922270_25.jpg"]},{index:56,topic:"ㄴㄴ재현 데이터(Synthetic Data)",define:"- 원본과 통계적으로 유사하나 가상으로 다시 만들어진 합성 데이터",head:`* 유형 
- 완전, 부분, 하이브리드
* 생성단계
- 원본데이터 수집 > 생성 > 유용성 평가
> 익명성 평가 > 활용
* 생성기법
- 전통적 통계 또는 베이지안 방법, 기계학습 모델, 차등정보보호 기반 기법
* 평가기법
- 유용성 평가 : 상관관계 유사도, 통계적 유사도
- 검증지표 : pMSE, 머신러닝 효율성`,remark:null,image:[]},{index:57,topic:"ㄴㄴPET 기법(Privacy Enhancing Technologies)",define:`- 개인 식별 위험을 최소화하는 것이 목적의
프라이버시 강화 기술`,head:"",remark:null,image:["static/images/cellImage_1538922270_26.jpg"]},{index:58,topic:"ㄴ개인정보 처리 가이드라인(2024 개정)",define:`개인정보보호법 28조2에 따라 개인정보 처리자는 통계작성, 과학적 연구, 공익적 기록 보존등을 위하여 정보주체 동의 없이 가명정보를 처리할 수 있음
처리해야되는경우 5단계 절차를 따름
두음: 사위가적안
(내 사위는 빨간눈이다)`,head:"",remark:null,image:["static/images/cellImage_1538922270_27.jpg"]},{index:59,topic:"ㄴ데이터 품질 검증",define:"- 해당조직이 운영/관리하고 있는 정보시스템에 저장된 정형/비정형 데이터의 품질을 측정하여 현재의 수준을 평가하고 품질저하의 요인을 분석하여 개선 사항을 제안하는 절차",head:`- 데이터 품질, 데이터 품질관리, 품질 진단, 품질 개선
- 품질진단 : 대상정의 > 진단실시 > 결과분석
- 품질개선 : 계획수립 > 개선수행 > 품질통제`,remark:null,image:[]},{index:60,topic:"ㄴ데이터 품질 지표",define:`* TDQM 정의
내재적, 상황적, 표현적, 접근적

* 한국 정보화 진흥원 정의
-정형데이터(정완유일유)
:정확성, 완전성, 유효성, 일관성, 유일성
-비정형데이터(기신사효이)
:기능성, 신뢰성, 사용성, 효율성, 이식성`,head:`* DQM3 품질기준(정일 유접적)
- 데이터 유효성
: 정확성, 일관성
- 데이터 활용성
: 유용성, 접근성, 적시성, 보안성`,remark:`* DQ인증 기준
- 완전성, 유효성, 일관성, 정확성, 접근성, 유일성`,image:[]},{index:61,topic:"데이터 적재",define:`- 구조화된 데이터와 구조화되지 않은 데이터를 비롯한 전체 데이터(수집 데이터)를 가져와
비즈니스 목적에 실질적으로 유용한 상태로 변환하는 과정`,head:"",remark:null,image:[]},{index:62,topic:"ㄴ전통적 데이터 중심",define:`데이터 웨어하우스(DataWarehouse,DW)
- 정형 데이터 분석 중심`,head:`* 기법
ETL(Extract,Transform,Load )
ODS(OperationalDataStore, 운영 데이터 저장)`,remark:null,image:[]},{index:63,topic:"ㄴ빅데이터 중심",define:`데이터 레이크(DataLake)
- 데이터 저장 중심
- 정형·비정형 포함 
데이터 패브릭(Data Fabric)
- 기술 중심 자동화
- 메타데이터 활용
데이터 메시(DataMesh)
- 조직 중심 분산 운영
- 데이터를 제품으로 관리`,head:"",remark:null,image:[]},{index:64,topic:"ㄴㄴ데이터레이크",define:`- 대규모의 다양한 원시 데이터 세트를 기본 형식으로 저장하는 데이터 레파지토리의 한 유형 

- 수집한 로우데이터를 그대로 보존 
- 필요에 따라 DW, DM을 통해 가공`,head:"",remark:"위치 이동",image:["static/images/cellImage_1538922270_28.jpg"]},{index:65,topic:"ㄴㄴ데이터레이크하우스",define:`- 하이브리드 데이터 관리 아키텍처
- 데이터레이크 + 데이터웨어하우스
- 데이터레이크의 유연성 및 확장성과 데이터웨어하우스의 데이터 구조 및 데이터 관리 기능을 결합한 새로운 개방형 데이터관리아키텍처 

 -> 데이터레이크하우스는 구조화되지 않은 데이터에도 필요한 데이터 버전 관리, 거버넌스, 보안 및 ACID 속성을 제공`,head:`* 데이터레이크하우스의 구성요소(수스메아소)
1) 수집계층 
- 다양한 소스에서 데이터를 수집하여 스토리지 계층으로 보내는 역할 
- NoSQL 데이터베이스,파일 공유,CRM 애플리케이션,웹 사이트,사물인터넷 센서,소셜 미디어,SaaS애플리케이션 및 RDBMS 등
2) 스토리지레이어 
- AWS S3와 같은 저렴한 객체 저장소에 다양한 유형의 데이터를 객체로 저장
3) 메타데이터레이어 
- 데이터레이크에 저장된 모든 항목에 대한 메타데이터(다른 데이터 조각에 대한 정보)를 제공하고 관리기능 제공 카탈로그
- 캐싱, 인덱스, 스키마관리구현, 스타/스노우플레이크스키마 토폴로지 사용, 데이터거버넌스, 감사기능 제공`,remark:`4) API계층 
- 최종 사용자가 작업을 보다 빠르게 수행하고 보다 정교한 통계를 얻는 데 사용할 수 있는 여러 API를 호스팅
5) 소비층 
- Power BI, Tableau 및 기타 도구와 앱은 소비 계층에서 호스팅, 보관된 모든 메타데이터와 모든 데이터는 클라이언트 앱에서 액세스, 회사 내의 모든 사용자가 모든 종류의 분석 작업, 비즈니스 인텔리전스 대시보드 생성, SQL 쿼리 및 기계 학습 작업 실행`,image:[]},{index:66,topic:"ㄴㄴ데이터레이크하우스 절차",define:"정형/반정형/비정형>배치스트리밍>데이터레이크하우스>메타데이터캐칭 및 인덱스>메타데이터API>SQL API>비지니스활용, ML, 데이터사이언스",head:"",remark:"위치 이동",image:["static/images/cellImage_1538922270_29.jpg"]},{index:67,topic:"데이터 저장",define:`- 데이터를 고성능으로 저장하고 필요한 경우 데이터를 검색하여 수정,�
삭제 또는 원하는 내용을 읽어오는 방법`,head:`* RDBMS방식
* NoSQL방식(NotonlySQL)
* 분산파일시스템 방식
-GFS, HDFS`,remark:null,image:[]},{index:68,topic:"ㄴNoSQL",define:`- 데이터의 읽기보다 쓰기에 중점을 둔, 수평적 확장이 가능하며 다수 서버들에 데이터 복제 및 분산저장이 가능한 데이터베이스
- BASE
- 수평, 복제, 분산`,head:`* 종류
- Key/Value Store: Redis 
- Column Family: Hbase, Cassandra (내부 key sorting) 
- Document Store: MongoDB(BSON, Replication)
- Graph: Neo4j`,remark:`* 특징: BASE
- Basically Available: 가용성 중시, 복사본 저장
- Soft-State: 노드 도달시 갱신
- Eventually Consistent: 일시적 비일관적 상태`,image:[]},{index:69,topic:"ㄴCAP 이론",define:"- 대용량 분산 데이터 저장소는 데이터 일관성, 가용성, 단절내성을 모두 만족시키는 것이 불가능하므로 두 가지만 전략적으로 선택해야 한다는 이론",head:`- Consistency: 일관성
- Availability: 가용성
- Partition Tolerance: 단절내성`,remark:null,image:["static/images/cellImage_1538922270_30.jpg"]},{index:70,topic:"ㄴPACELC 이론",define:"- CAP 이론으로 부족한 부분을 보완하기 위해 네트워크 장애상황과 정상상황으로 나누어서 설명하는 이론",head:"",remark:null,image:["static/images/cellImage_1538922270_31.jpg","static/images/cellImage_1538922270_32.jpg"]},{index:71,topic:"데이터 전처리(저장에 용이하게)",define:"- 데이터 정제와 통합, 축소, 변환을 포함하는 광의적 개념이며 데이터를 분석 및 처리에 적합한 형태로 만드는 과정을 총칭",head:`- 데이터 필터링: 목적에 맞지 않은 데이터를 제거해 분석하는 과정 
- 데이터 변환: 데이터 저장이 용이한 형태나 구조로 변환하는 과정(비정형/반정형->정형) 
- 데이터 정제: 결측값 처리, 이상값 및 잡음을 제거하는 과정`,remark:null,image:["static/images/cellImage_1538922270_33.jpg"]},{index:72,topic:"데이터 후처리(분석에 용이하게)",define:`- 데이터 스케일링: 분석에 용이하도록 일관성 있는 형식으로 변환(평활화, 집계, 일반화, 정규화 등) 
- 데이터 통합: 중복데이터를 검출하거나 표현 단위 일치 
- 데이터 축소: 고유한 특성은 손상되지 않도록하고 속성의 특성을 유지하면서 축소`,head:`* 데이터 스케일링 : 평집일정표
- 평활화: 잡음 제거를 위해 이상값 변환 
- 집계: 다양한 방식으로 데이터를 요약 
- 일반화: 특정 구간에 분포하는 값으로 스케일을 변환 
- 정규화: 데이터를 정해진 구간으로 변환 
- 표준화: 0을 중심으로 양쪽으로 데이터 분포 
- 소수 스케일링: 소수점을 이동하여 데이터 크기 조정`,remark:null,image:[]},{index:73,topic:"ㄴㄴ데이터 실수화",define:"- 문자열, 범주형 데이터 등의 데이터를 컴퓨터가 이해할 수 있는 실수형으로 변환하는 과정",head:`* 기법 
1) Bag of Words: 단어의 빈도수를 카운트하여 단어를 수치화하는 단어 표현 방법 
2) TF-IDF: 단어의 빈도와 역 문서 빈도를 사용하여 DTM(문서단어행렬) 내의 각 단어들마다 중요한 정도를 가중치로 주는 방법`,remark:null,image:[]},{index:74,topic:"ㄴㄴ데이터 정제",define:"데이터 전처리의 한 과정으로 결측값, 잡음, 이상값 등 데이터 오류를 일으킬 수 있는 요인을 제거하고, 불일치를 해결하여 데이터의 신뢰도를 높이는 과정",head:`* 데이터 정제: 실정통 
데이터 실수화, 데이터 정제, 데이터 통합 
* 분석 변수 처리: 축파불변 
데이터 축소, 파생변수 생성, 불균형 데이터 처리, 데이터 변환`,remark:null,image:[]},{index:75,topic:"ㄴㄴㄴ결측값",define:`- 입력이 누락된 값(NA, Null, NaN, Inf) 

결측값 식별>결측값 부호화>결측값 처리`,head:`* 결측값  종류(완무비)
- 완전 무작위 결측: 결측값의 발생이 다른 변수들과 아무런 상관이 없는 경우 
- 무작위 결측: 다른 변수에 따라 조건부로 결측값이 발생하는 경우 
- 비무작위 결측: 위 두가지 상황이 아닌 경우`,remark:`* 결측값 처리 방법 
1) 단순 대치법 (완평단)
- 완전 분석법 
- 평균 대치법 
- 단순확률 대치법: 핫덱 대체, 콜드덱 대체, 혼합 대체
2) 다중 대치법: 단순대치 n번
3) 단일값 삭제 
4) 목록 삭제`,image:[]},{index:76,topic:"ㄴㄴㄴ이상값",define:`- 관측된 데이터의 범위에서 벗어난 아주 작거나 큰 값 
- 입력 오류, 데이터 처리 오류등의 이유로 특정 범위에서 벗어난 데이터 값 

* 이상값 발생원인 
- 데이터 입력 오류, 측정 오류, 실험 오류, 고의적인 이상값, 표본추출 에러`,head:`* 이상값 검출방법(통밀의마머시개)
- 개별 데이터 관찰 
- 통계값 이용: Z검정(표준화점수 활용), Q검정, T검정, 카이제곱검정
- 시각화 이용: 상자그림, 히스토그램
- 머신러닝 기법 이용: K-means 
- 마할라노비스 거리, knn
- 밀도기반 이상치 탐색: LOF(local Outlier Factor), DBScan, iForest
- 의사결정나무 이용 기법`,remark:`* 이상값 처리 
- 삭제 
- 대체
- 변환: 자연로그를 취해 값을 감소 
- 박스플롯 해석: 사분위수를 이용해 제거 
- 분류하여 처리`,image:[]},{index:77,topic:"ㄴㄴ데이터 통합",define:"- 여러개의 데이터베이스, 데이터 집합 또는 파일을 통합하는 작업",head:"",remark:null,image:[]},{index:78,topic:"ㄴ분석변수처리",define:"확보한 데이터 사용하여 정보를 추가하는 일련의 과정, 새로운 데이터 추가없이 기존의 데이터를 유용하게 만드는 방법",head:"",remark:null,image:[]},{index:79,topic:"ㄴㄴ데이터 축소",define:`- 변수선택: 해결하고자하는 문제에 대해 유의미한 변수를 선택하는 과정 

- 차원축소: 샘플링, 차원축소, 특징선택 및 추출을 통해 데이터 크기를 줄이는 과정`,head:`* 변수선택 기법(필래임)
1) 필터 기법: 통계적 특성으로 변수 선택 
- 정보이득(information Gain), 카이제곱, 피셔스코어, 상관계수
2) 래퍼 기법: 변수의 일부만 모델링. 결과 확인 반복하여 변수 선택 
- 전진 선택법, 후진 제거법, 단계적 방법
- 전체집합 > [[하위집합선택 <-> 알고리즘학습]] > 모델성능평가
3) 임베디드 기법: 필터+래퍼. 학습알고리즘 자체에 feature selection을 넣는 방식 
- 라쏘(제곱,L1norm), 릿지(절대값,L2), 엘라스틱넷(라쏘+리찌)
- 전체집합 > [[하위집합선택 <-> 알고리즘학습, 모델성능평가]]`,remark:`* 차원축소 기법 : 특성추출 > 특성선택
1) 주성분분석(PCA): 선형 연관성이 없는 저차원 공간으로 변환하는 기법 
2) 특이값 분해(SVD): 행렬데이터에서 특이 값 추출. 방향성 추출 
3) 요인분석(FA): 잠재요인 도출 
4) 독립성분 분석
5) 다차원 척도법(MDS): 유사성, 비유사성을 측정하여 개체 집단화 시각적으로 표현 
6) 판별분석(LDA)
7) 오토인코더(AE)
8) t-SNE : 고차원>저차원으로 시각화`,image:[]},{index:80,topic:"ㄴㄴ파생변수 생성",define:`- 기존변수에 특정조건, 함수 등을 활용하여 새로운 변수를 만드는 과정

- 변수 + 특정조건,함수 => 파생변수`,head:`* 파생변수 생성방법 
- 단위 변환 
- 표현형식 변환 
- 요약 통계량 변환 
- 변수 결합`,remark:null,image:[]},{index:81,topic:"ㄴㄴ변수 변환",define:`- 데이터를 한 형식이나 구조에서 다른 형식이나 구조로 변환하는 과정 
- 데이터 스케일링: 데이터를 표준화, 정규화, 이산화 또는 집계 등의 기법을 이용해 데이터를 변환하는 작업`,head:`1) 정규변환: 로그변환, 제곱변환, 제곱근 변환, 박스콕스 
2) 정규화: 데이터의 범위를 가장 작은 값을 0, 가장 큰 값을 1로 변환(데이터의 분포 조정), 최소최대(0,1), 최대 절대값(-1,1)
3) 표준화: 데이터를 0을 중심으로 양쪽으로 데이터를 분포시키는 방법(평균0, 표준편차1). 데이터가 평균으로부터 얼마나 떨어져 있는가를 나타냄`,remark:null,image:[]},{index:82,topic:"ㄴㄴ불균형 데이터 처리",define:`- 특정 클래스의 데이터가 타 클래스의 데이터 수와 너무 차이가 날 때, 샘플링을 통해 이 비율을 맞추는 작업 

* 불균형 데이터 처리 
1) 언더 샘플링/다운 샘플링: 데이터의 분포가 높은 값을 낮은 값으로 맞춰주는 작업(잘사용안함)
- 랜덤 언더 샘플링: 무작위 샘플링 
- Tomek link: 클래스를 구분하는 경계선 가까이에 존재하는 데이터를 제거(경계선 대/소 클래스 쌍) 
- CNN: 다수 클래스에 밀집된 데이터가 없을 때까지 제거(경계 동일거리 대표값만 유지)
- OSS: Tomek link+CNN
- ENN: 소수 주위에 인접한 다수 클래스 제거`,head:`2) 오버 샘플링/업 샘플링: 분포가 작은 클래스의 값을 분포가 큰 클래스로 맞춰주는 샘플링 방법 
- 랜덤 오버 샘플링: 소수 데이터 복제
- SMOTE: 소수 데이터 주변에 가상의 데이터 생성(KNN 사용)
- Borderline SMOTE: 두클래스간 결정 경계에 따라 생성
- ADASYN: 가장 가까운 무작위의 k개 데이터 사이에 가상의 직선을 그려 직선위에 데이터 생성
- Combine Sampling: 복합샘플링`,remark:`3) 임계값 이동: 임계값을 데이터가 많은 쪽으로 이동 
4) 앙상블 기법: 같거나 서로 다른 여러가지 모형들의 예측/분류결과를 종합

- 언TCO, 오SA`,image:[]},{index:83,topic:"데이터 탐색",define:`* 통계기반의 데이터 탐색 방법 : 모탐확예
- DDA: 묘사적-평균, 표준편차, 빈도수, 왜도, 첨도
- EDA: 탐색적 -그래프분석, 정규성검정
- CDA: 확증적-추정, 가설검정
- PDA: 예측적-모델링기법`,head:`- 탐색적 데이터 분석 : 수집한 데이터를 분석하기 전에 그래프나 통계적인 방법을 이용하여 다양한 각도에서 데이터의 특징을 파악하고 자료를 직관적으로 바라보는 분석 방법 

* 탐색적 데이터 분석(EDA)의 4가지 주제 (저잔재현)
- 저항성 : 자료의 오류, 이상값에 대해 영향을 둔감하게 받는 성질 
- 잔차의 해석 : 잔차를 통해 데이터의 다른 특징 탐색 
- 데이터 재표현 : 자료변수의 재표현을 통한 다각적 시도 (로그변환)
- 데이터 현시성: 데이터 분석 결과 시각화`,remark:null,image:[]},{index:84,topic:"상관관계 분석",define:`- 두 변수간의 선형관계(비례식성립)를 분석하는 기법 
- 선형성 강도에 대한 통계적 분석

* 상관분석의 가정사항(조건) - 이정선
- 이변량: 비교 가능한 두개의 연속형 변수 존재 
- 정규분포: 두 변수 중 적어도 하나의 변수는 정규성 만족
- 선형성 검증: 연속형 두 변수간 선형적 관계 존재(산점도)

* 학습시간 - 성적의 관계, 키-몸무게`,head:`* 상관관계 해석
- 선형성 : 비례식, 산점도로 확인
- 선형 관계의 방향(단조성) : 양, 음, 없음
- 관계의 크기(강도) : -1~+1사이, 피어슨상관계수`,remark:`* 상관계수 종류 : 피스켄
1) 피어슨 상관계수(감마) 
- 적률 상관계수
- 등간/비율변수-등간/비율변수
2) 스피어만(로우)
- 순위 상관계수
- 서열변수-서열변수
3) 켄달(타우)
- 서열변수-서열변수`,image:[]},{index:85,topic:"공분산",define:`- 두 변수 x, y가 서로 어떤 패턴을 보여주는가를 나타내는 지표, 서로 다른 변수들 상이에 얼마나 의존하는지 수치적으로 표현
- 두 변수는 수치형변수
- 단위의 크기에 영향을 받는 문제있음 
- -무한대 ~ +무한대`,head:"",remark:`A중학교 다니는 학생5명의 영어,국어점수 연관성 사례
공분산 4.25로 영어증가시 국어점수 증가되는것으로 확인
- 영향은 확인 가능하나 강도는 나타내지 못함`,image:["static/images/cellImage_1538922270_34.jpg"]},{index:86,topic:"기초통계량",define:"기술통계 기법으로 정의하는 수치 데이터",head:"",remark:null,image:[]},{index:87,topic:"ㄴ중심경향값",define:`- 분포의 중심 
- 중심경향성의 통계량
- 평균, 중앙값, 최빈값`,head:`- 산술평균: 모든 값의 총합을 개수로 나눈 값 
- 절사평균: 정해진 개수의 극단값을 제외한 나머지 값들의 평균 
- 가중평균: 가중치를 곱한 값의 총합을 가중치의 총합으로 나눈 값 
- 기하평균: n개의 양수값을 모두 곱한 값에 n 제곱근을 적용한 값`,remark:`- 중간값: 데이터에서 가장 가운데 위치한 값 
- 가중 중간값: 데이터를 정렬한 후, 가중치 값을 위에서부터 더할 때, 총합의 중간에 있는 데이터 값 
- 최빈값: 주어진 데이터 중 가장 많이 관측되는 수`,image:[]},{index:88,topic:"ㄴ산포도",define:`- 산포도: 데이터의 흩어진 정도, 범위, 사분위수범위, 편차, 분산, 표준편차, 번동계수 
- 분포의 퍼짐도 
- 데이터의 흩어진 정도를 표현하는 기초 통계량
- 편차, 표준편차, 분산, 범위, 사분위`,head:`- 범위: 데이터의 최대값과 최소값의 차 
- 분산: 평균으로부터 흩어진 정도 
- 표준편차: 분산의 양의 제곱근 
- 변동계수(CV), 상대표준편차: 표준 편차를 표본 평균이나 모 평균 등 산술 평균으로 나눈 것 
- 사분위수 범위(IQR): 중간 50%에 포함되는 자료의 산포도`,remark:null,image:[]},{index:89,topic:"ㄴ비대칭도",define:`- 자료 분포의 형태를 설명해주는 통계량
- 왜도, 첨도`,head:"",remark:null,image:[]},{index:90,topic:"ㄴㄴ왜도",define:"- 좌우 기울러짐 정도",head:"",remark:null,image:["static/images/cellImage_1538922270_36.jpg","static/images/cellImage_1538922270_37.jpg"]},{index:91,topic:"ㄴㄴ첨도",define:"- 중심에서 어느정도 몰려있는가 측정, 뽀족한 정도",head:"",remark:null,image:["static/images/cellImage_1538922270_38.jpg","static/images/cellImage_1538922270_39.jpg"]},{index:92,topic:"통계학",define:`- 집단현상을 수량적으로 관찰하고 분석하는 방법을 연구하는 학문 

- 모집단: 어떤 확률분포로부터 관찰될 수 있는 모든 관측값들 
- 무한모집단: 모집단의 크기가 무한한 경우 
- 유한모집단: 모집단의 크기가 유한한 경우`,head:`- 표본: 모집단의 부분집합으로서, 실험자가 미지의 확률분포를 조사하기 위해 사용하는 측정값들 
- 모수: 모집단을 요약/설명해주는 기술 통계도구(모집단의 특성)
- 통계량: 표본에서 얻은 수치 특성 값(표본평균, 표본표준편차)
- 표본통계량/추정치: 표본을 요약/설명해주는 기술통계도구(표본의 특성)
- 표본/표집오차: 표본통계량과 모수간의 차`,remark:`- 표준오차: 표본 통계량의 표준 오차(표본들간의 편차) 
- 표본오차: 모 평균 추정치의 표본오차(표본과 모수 차이) 

- 오차한계: 모평균 추정구간의 중심으로부터 최대 허용할 허용오차 
- 오차범위: 표본을 통해 어떠한 모집단의 모수를 추정할 때, 실제 모집단의 모수가 확률적으로 존재하는 범위`,image:[]},{index:93,topic:"통계",define:`- 통계: 집단현상에 대한 구체적인 양적 기술을 반영하는 숫자 
- 기술통계: 조사 및 측정된 자료를 통해 그 자료가 가지고 있는 특징을 수치, 표, 그래프로 정리하는 과정(기초통계량, 그래프, 표/요약)
- 추론통계: 관심대상 전체로부터 일부의 샘플을 추출, 분석하여 그 결과로부터 전체 모집단에 대한 특성을 예측하는 과정(추정, 가설검정, 통계분석)`,head:"",remark:null,image:["static/images/cellImage_1538922270_40.jpg"]},{index:94,topic:"자료분석방법",define:`- 자료: 관심의 대상인 사물이나 속성을 측정,관찰,조사한 값들의 모음 
- 개체: 관찰된 항목이나 대상 
- 요인: 개체 특성 중 연구자가 관심을 갖는 특성 
- 변수: 요인의 특성을 수치화하기 위해 쓰이는 속성 
- 척도: 일정한 규칙을 가지고 기호 또는 숫자로 나타낸 것`,head:"",remark:null,image:["static/images/cellImage_1538922270_41.jpg"]},{index:95,topic:"ㄴ범주형자료(일변량)",define:`* 도수분포표 
- 데이터 각 값의 출현도수를 세거나 몇개의 구간으로 나누어 각 구간에 속하는 데이터의 개수를 세어서 정리한 표 
- 수집된 자료를 적절한 계급으로 분류, 정리한 표 

- 상대도수: 범주에 속한 개체의 비율 
- 누적도수: 범주에 속한 개체의 누적비율`,head:"",remark:null,image:[]},{index:96,topic:"ㄴ범주형자료(다변량)",define:`* 분할표/교차표 
- 관측치를 몇개의 범주로 분할하여 그 해당 도수로 자료를 정리해 놓은 표 
- 분할표의 행은 독립변수, 열은 종속변수  

- 분할표를 이용한 두 집단의 관련성 척도: 상대 위험도, 오즈비 확인
- 분할표를 이용한 통계분석: 교차분석(적합도 검증), 동질성 검정, 독립성 검정`,head:`- 상대위험도(RR): 관심 집단의 위험률과 비교 집단의 위험률에 대한 비  

- 승산비(오즈비): 특성 사건이 발생할 확률에 대한 그 사건이 발생하지 않을 확률의 비`,remark:"- 교차표분석: 두 범주형 변수간의 상호 관련성을 알아보고자 할 때 사용하는 방법",image:[]},{index:97,topic:"ㄴ수치형자료(일변량)",define:`- 각 단위가 갖는 특정한 양적 성질을 측정하여 계량에 의해 관찰할 수 있는 자료 

- 중심경향: 평균, 중앙값, 최빈값 
- 퍼짐 정도: 분산, 표준편차, 범위, 사분위수 
- 치우침 정도: 왜도, 첨도`,head:`* 편차(Deviation) - 관측치와 평균 차
- 분포상의 무게 중심, 자료값 또는 변량과 평균의 차이를 나타내는 수치 
- 평균을 중심으로 다 더하면 0 

* 분산(Variance) - 편차의 제곱의 합의 평균
- 자료가 평균을 중심으로 얼마나 광범위하게 분포하고 있는가를 하나의 수치로 나타낸 통계량`,remark:`* 표준편차  - 분산의 제곱근
- 자료가 평균을 중심으로 얼마나 광범위하게 분포하고 있는 가를 하나의 수치로 나타낸 통계량

* 자유도(n-1)
- 자유롭게 가질 수 있는 편차의 수`,image:[]},{index:98,topic:"ㄴ수치형자료(일변량)",define:`* 표준화
- 측정단위 등과 관계없이 자료를 0을 중심으로 양쪽으로 데이터를 분포시키는 방법`,head:`* 변동계수(CV) 
- 측정단위가 다르거나 자료 값의 차이가 큰 경우에 사용 
- 변동계수의 값이 클수록 상대적인 차이가 크다는 것 

- 변동계수 = 표준편차 / 평균`,remark:`* 왜도
- 데이터의 분포가 정규분포로부터 오른쪽 또는 왼쪽으로 치우친 정도, 대칭의 정도 

* 첨도
- 자료 분포의 뾰족한 정도`,image:[]},{index:99,topic:"ㄴ수치형자료(일변량)",define:`- 점도표 
- 밀도추정 
- 히스토그램 
- 줄기-잎 그래프 
- 상자도표`,head:"",remark:null,image:[]},{index:100,topic:"ㄴ수치형자료(다변량)",define:`* 시계열 자료
- 시간의 변화에 따른 자료 

* 산점도 
- 두 변수 x, y의 관측치를 좌표평면상에 점으로 나타낸 그림`,head:`* 상관관계 
- 두 변수간 상호 의존관계가 있을 때 이 관련성을 통계적으로 분석(선형관계 존재여부)`,remark:`* 상관계수 종류 
1) 피어슨 상관계수(감마) - 수치형
- 적률 상관계수
2) 스피어만(로우) - 범주형
- 순위 상관계수
3) 켄달(타우) - 범주형`,image:[]},{index:101,topic:"전수/표본 조사",define:`전수 조사(Complete Enumeration Survey) 또는 센서스(Census) : 모집단 전체를 대상으로 조사하는 방법 (전체를 대상으로 연구하므로 가장 이상적인 연구방법)

표본 조사(Sample Survey) : 관심의 대상이 되는 전체에서 일부의 부분 집단을 선택한 후, 그 일부 집단에 대해서 조사한 자료를 분석하여 전체 집단의 특성을 추정하는 통계 조사 방법`,head:"",remark:null,image:[]},{index:102,topic:"표본조사방법",define:`1) 확률추출: 단계층집 
- 모집단에 속하는 모든 추출단위에 대해 사전에 일정한 추출확률이 주어지는 표본 추출법 
2) 비확률추출: 편할포눈 
- 추출단위가 표본에 추출될 확률을 객관적으로 나타낼 수 없는 표본 추출법`,head:`* 확률추출 
- 단순확률추출: 모집단을 구성하는 요소 하나하나가 뽑힐 확률이 동일한 상황에서 뽑는 방법(현대카드 사용자100만명중 1000명추출)
- 계통추출법: 모집단의 추출틀에서 k번째 간격마다 하나씩 표본으로 추출(식당방문자 중 10,20 등 간격추출)
- 층화확률추출: 모집단을 겹치지 않는 여러 층으로 분할한 후, 각 층별로 단순임의 추출(층간 이질성, 층내 동질성)(서울시 구별로 100명 추출 선호도조사) 
- 집락추출법: 서로 인접한 기본단위들로 구성된 군집을 만들고, 추출된 군집 내의 일부 또는 전체를 조사(집락간 동질성, 집단내 이질성)(서울시 대학생 용돈조사)`,remark:`* 비확률추출 
- 편의추출: 연구자가 이용 가능한 대상을 임의대로 선택 
- 할당법: 확률적 근거없이 임의로 연구자가 표본을 분류하여 추출 
- 포커스 그룹: 깊이 있는 연구를 위해 대표하는 사람을 추출 
- 눈덩이 추출법: 사전에 알고 있는 사람들을 대상으로 해당 집단에 속하는 다른 사람들을 소개받아서 조사 진행
- 지원자표본추출 : 지원자 모집`,image:[]},{index:103,topic:"확률의 종류",define:`- 고전적확률 
: 이론적, 수학적, 모든 결과갯수에 대한 특정비
- 경험적확률 
: 통계적, 객관적, 알려주고 확인해봄
- 공리적확률 
: 고전+상대도수의 극한`,head:"",remark:null,image:[]},{index:104,topic:"확률의 계산",define:`- 복원추출(중복 허용)
- 비복원추출(중복 허용 안함)
- 경우의수 : 순열(비복원+순서 고려)과 조합(비복원 + 순서 고려 안함)`,head:"",remark:null,image:[]},{index:105,topic:"확률",define:`- 비슷한 현상이 반복해서 일어날 경우에 어떤 사건이 발생할 가능성을 0과 1 사이의 숫자로 표현한 것 

- 종속사건 
- 독립사건 (동시 발생)
- 배반사건 (동시 발생 불가)
- 여사건 
- 교사건 
- 합사건`,head:`1) 고전적 확률(이론)
- 표본공간의 결과가 유한할 때 모든 결과가 발생 할 가능성이 같다고 볼수 있을 때 

2) 통계적 확률(경험)
- 각각의 실험에서 발생하는 결과는 표본이고 실험을 무한히 반복한다는 것은 표본이 결국 모집단이 된다는 의미 
- 상대도수의 극한: 실험을 무한히 반복한다면 표본이 무한히 커지며 모집단으로 수렴`,remark:`3) 공리적 확률 
- 증명할 수 없으나 옳다고 하는 명제(확률의 3가지 공리)`,image:[]},{index:106,topic:"확률변수",define:`- 표본공간에 있는 각 원소에 값을 대응시켜 주는 규칙 또는 함수 

* 확률변수 종류 
- 이산확률변수: 특정한 수치만을 가지는 확률변수(정수)
- 연속확률변수: 어떤 범위에서 연속적인 값을 취할 수 있는 확률변수(실수)`,head:"",remark:null,image:["static/images/cellImage_1538922270_44.jpg"]},{index:107,topic:"ㄴ이산확률분포",define:`- 이산 확률변수가 가지는 확률 분포 변수(셀 수 있음) 
- 기대값: 확률변수 x의 평균 또는 중심위치, 가중평균 

* 이산확률분포 종류 (이초베이포기음)
1) 이산형 균등분포
- 확률변수 x가 이산값을 가지며 각 값들이 취할 확률이 동일한 확률 분포
- 주사위 1회 던지는 확률실험 

2) 초기하분포 
- 모집단 n이며 원하는 원소가 d일 때, n개의 표본을 비복원으로 뽑았을 때 원하는 원소의 수에 대한 확률분포 
- 45개 중 로또 번호중 내가 선택할 번호가 당첨확률`,head:`3) 베르누이 분포 
- 실험을 1회 시행하여 일어난 두가지 결과에 의해 그 값이 각각 0과 1로 결정되는 확률 분포 
- 한 개의 동전던지기 
- 베르누이 시행: 확률실험의 결과가 성공 혹은 실패와 같이 두가지 결과로만 나타나는 실험

4) 이항분포 
- 베르누이 시행을 n번 시행했을 때의 확률분포 
- 축구선수가 패널티킥을 찬다고 가정할 때 10번차서 얻은 성공확률`,remark:`5) 포아송 분포 
- 포아송가정(독립성, 비례성, 비집락성)을 만족하는 실험에서 단위 시간당/공간당 발생하는 사건의 수에 대한 확률분포 
- 단위 시간동안 걸려오는 전화 횟수

6) 기하분포 
- 베르누이 시행을 독립적으로 반복해 나가는 시행에서 확률변수 x를 첫번째 성공이 발생할 때까지 총 시행횟수에 대한 확률분포  
- 야구선수가 6번째 타석에서 첫 홈런을 칠 확률

7) 음이항분포
- n번째 성공이 일어날때까지 총 시행 횟수
- 야구선수가 6번째 타석에서 n번째 홈런 칠 확률`,image:[]},{index:108,topic:"ㄴ연속확률분포",define:`- 확률 밀도 함수를 이용해 분포를 표현할 수 있는 경우(셀 수 없음) 

- 연속확률 변수: 어떤 범위에서 연속적인 값을 취할 수 있는 확률변수(실수) 
- 확률밀도 함수: 연속확률변수가 특정 구간에 포함될 확률 
- 누적분포 함수: 주어진 확률 변수가 특정 값보다 작거나 같은 확률을 나타내는 함수`,head:`* 연속확률분포 종류 
1) 정규분포 - 왜도0, 첨도3
- 평균을 중심으로 좌우대칭이고 종모양을 갖는 확률분포 

2) 표준정규분포 
- 평균0, 표준편차 1로 표준화한 정규분포 
- 측정단위 등과 관계없이 자료를 표준화 시킨 값 

- 표준화점수(Z-score): 통계학적으로 정규분포를 만들고 개개의 경우가 표준편차상에 어떤 위치를 차지하는지 보여주는 차원 없는 수치`,remark:`3) T분포(평균차이검정) 
- 모집단의 정보가 없고 표본이 충분하지 못한경우(30개이하) 사용하는 분포 
- 모집단은 정규분포를 이룬다는 가정 필요 
- 표준정규분포 + 카이제곱분포

4) 카이제곱분포 (χ²분포)
- 한개의 표본 분산을 추론한 분포 
- 정규분포를 따름, 교차분석에 의한 통계량으로 사용
- 분산의 추론과 관련된 분포

5) F분포 
- 두개의 표본 분산을 추론한 분포 
- 정규분포를 따르지 않음 
- 분산의 추론과 관련된 분포`,image:[]},{index:109,topic:"통계량",define:"- 확률분포로부터 관찰될 수 있는 관측값, 확률표본을 구성하는 확률변수들의 함수",head:"",remark:null,image:["static/images/cellImage_1538922270_45.jpg"]},{index:110,topic:"중심극한의 정리",define:"- 추출한 표본이 충분히 크면 모집단 분포의 모양에 상관없이 추출된 표본의 분포는 정규분포를 따른다는 법칙",head:"",remark:null,image:["static/images/cellImage_1538922270_46.jpg"]},{index:111,topic:"t-분포",define:`- 정규분포의 평균을 측정할때 사용되는 분포
- 표준정규분포 + 카이제곱 결합
- 일반적으로 n < 30`,head:`- 정기분포와 같이 대칭적, 예측범위를 넓힘
- 표준정규분포에 비해 평균(0)을 중심으로 분포가 완만함
- 자료의 크기증가에 따라 표준정규분포에 근접`,remark:`* 원재료 리터당 제품 500g씩 제조 주장, 매월19개 표본추출
95%확률로 실험결과가 500gd이 아니면 잘못된 주장
19개 샘플의 표준평균이 518g이고 표준편자 40g이었다면 어떤결론?`,image:[]},{index:112,topic:"F-분포",define:`- 카이제곱분포 2개의 비율 확률 분포
- 두집단의 산포를 비교하는데 이용`,head:"",remark:`* A반, B반 영어성적 학업성취도 확인
- A반6명, B반9명 확인, A반 표본분산30, B반 표본분산20
유의수준 a=0.05해당하는 F값?`,image:["static/images/cellImage_1538922270_47.jpg"]},{index:113,topic:"추정(추론통계)",define:`- 점 추정: 추정하고자 하는 모수를 하나의 수치로 추정 
- 구간 추정: 추정하고자 하는 모수가 존재하리라 예상하는 구간을 추정`,head:"",remark:null,image:[]},{index:114,topic:"ㄴ점추정",define:`- 모수에 가장 가까우리라고 생각되는 하나의 값으로 모수를 추정하는 통계기법

- 추정량: 모수 추정에 사용되는 통계량, 확률변수, 평균, 표준편차, 중앙값 등을 추정 
- 추정값: 추정량으로부터 구한 측정값`,head:`* 점추정의 조건: 불효일충 
- 불편성(=불편추정량): 표본으로부터 구한 통계량의 기대치가 추정하려는 모수의 실제값에 같거나 가까워지는 성질 
- 효율성: 분산이 작은 추정량이 모수를 정확하게 추정할 가능성이 높은 성질 
- 일치성: 표본크기가 무한으로 접근할 때 추정량의 값이 모수와 같아지는 성질
- 충분성: 동일한 표본으로 부터 얻은 추정량이 모집단에 대한 더 많은 정보를 제공하는 성질 

* 표본평균 : 모평균의 불편추정량
* 표본분산 : 모분산의 불편추정량`,remark:`* 점추정 방법 (최적우)
- 최소제곱법: 회귀분석에서 사용 
- 적률법: 기대값 이용 
- 최대가능도(우도)추정법: 원하는 값들이 나올 가능도 함수를 최대로 만드는 모수 선택(조건부 확률) 
- 직관적 추정량`,image:[]},{index:115,topic:"ㄴ구간추정",define:`- 모수의 값이 속할 것으로 기대되는 일정한 범위(신뢰구간)를 이용하여 모수를 추정 

- 신뢰수준: 90%, 95%, 99% 등 

- (가정)모집단의 표준편차를 알경우: 표준정규분포 
- (실제)모집단의 표준편차를 모를경우: t분포`,head:`- 신뢰계수: 모수의 참값이 포함되어 있으리라는 확신의 정도를 나타낸 측도 
- 신뢰수준: 모수가 어느 범위 안에 있는지를 확률적으로 보여주는 방법
- 신뢰구간: 특정확률을 가지고 모집단의 모수가 포함될 것으로 예견되는 구간을 표본으로부터 도출한 범위의 값 
- 유의수준: 오차에 대한 허용범위`,remark:null,image:["static/images/cellImage_1538922270_48.jpg"]},{index:116,topic:"ㄴ구간추정",define:"모평균의 신뢰 구간 추정",head:"",remark:null,image:["static/images/cellImage_1538922270_49.jpg"]},{index:117,topic:"통계적 가설검정(가설검정/ 유의확률 유의성 검정)",define:`- 모집단 실제값이 얼마나 되는가 하는 주장과 관련해서, 표본이 가지고 있는 정보를 이용해 가설이 올바른지 그렇지 않은지 판정하는 과정

통계적모형구축>가설수립>자료수집>가설/모형검정 
- 유의수준: 모수와 통계량의 차이가 커서 확률적으로 가설을 기각할 수 있는 값(오류 허용수준) 
- p-value(유의확률): 측정된 검정통계량의 값으로 계산된 확률. 검정통계량의 값을 기각값과 직접적인 값으로 비교하는 대신, 그에 대응하는 확률값으로 검정하는 방법 

- 우측검정, 좌측검정, 양측검정`,head:`- 귀무가설(H0): 기존에 일반적인 사실로 받아들여지고 있는 내용 
- 대립가설(H1): 연구자가 새로이 주장하여 검정하고자 하는 연구가설 

- 검정통계량: 귀무가설과 대립가설 중에서 하나의 가설을 선택하는데 사용하는 표본의 통계량 
- 기각역: 검정통계량의 분포에서 유의수준의 크기에 해당하는 영역 
- 채택역: 검정통계량의 분포에서 유의수준을 제외하는 크기에 해당하는 영역 
- 1종오류: 귀무가설이 참임에도 이를 기각하는 오류 
- 2종 오류: 귀무가설이 거짓임에도 이를 채택하는 오류`,remark:null,image:["static/images/cellImage_1538922270_50.jpg"]},{index:118,topic:"ㄴ통계적 가설검정절차, 종류와 유형",define:`* 통계적 가설검정의 절차
(가유검가유결)
- 가설설정
- 유의수준(a) 결정
- 검정통계량 선정 및 계산
- 가설검정(기각역):검정통계량<유의수준(채택)
- 유의성검정(P-Value):P-Value<유의수준(기각)
- 통계적 결론

* 종류
- 양측검정, 좌측검정, 우측검정`,head:`* 통계적 가설검정의 유형 
- 유의성 검정: 통계적으로 유의미한가를 판단 
- 정규성 검정: 정규분포를 따르는가 
- 적합도 검정: 추정된 확률분포가 타당한가 
- 독립성 검정: 두 변량간 독립성 판단
- 동질성 검정: 두 변량의 확률분포의 동질성을 판단. 주로 카이제곱 검정`,remark:null,image:[]},{index:119,topic:"ㄴ통계적 가설검정방법의 종류모수통계/ 비모수통계",define:`* 모수통계 
- 모집단의 분포를 가정 
- Z, T, F, 카이제곱 분포를 따른다고 가정 
- 분석방법: t-test, ANOVA, 회귀분석 등

* 비모수통계 
- 모집단의 분포를 가정하지 않음 
- 맨 휘트니 U test, 윌콕슨 부호 test 등`,head:"",remark:`위치 이동
통합`,image:["static/images/cellImage_1538922270_51.jpg"]},{index:120,topic:"분석 모델 선정",define:`- 분석 모델 : 어떤 현상 또는 프로세스를 해결 가능한 방정식의 집합으로 표현한 도구

- 선정시 고려 사항 : 분석기법, 모델 조합, 평가기준, 결과검토, 데이터 확보`,head:`분석 목적 규명 : 서술, 진단, 예측, 규범  
목표변수 유/무 : 지도/비지도  
특성 파악(목표변수): 예측(연속), 분류(범주)`,remark:null,image:["static/images/cellImage_1538922270_52.jpg"]},{index:121,topic:"ㄴ부적합 모델의 발생 원인",define:"- 원인 : 모델 오류, 변수 누락, 데이터 부족, 편향/분산",head:`- 편향(Bias) :  학습 알고리즘에서 잘못된 가정을 했을 때 발생하는 오차, 편향이 크면 과소 적합
(Under Fitting) 야기

- 분산(Variance) : 트레이닝 세트에 내재된 작은 변동(Fluctuation) 때문에 발생하는 오차, 분산이 크면 과대 적합
(Over Fitting)을 야기`,remark:null,image:[]},{index:122,topic:"데이터 분할",define:`- 주어진 한정된 데이터에 대해서만 높은 성능을 보이는 문제(과적합, 과소적합)를  방지하기 위해 
일부 데이터는 모델의 학습 용도로 활용하고 학습에 사용되지 않은 일부 데이터는 학습된 모델을 검증하는 용도로 분리하는 과정

- 각 학습 데이터, 검증 테이터, 테스트 데이터는 중복이 없도록 구성`,head:"",remark:null,image:["static/images/cellImage_1538922270_54.jpg"]},{index:123,topic:"통계분석방법",define:"",head:"",remark:null,image:["static/images/cellImage_1538922270_55.jpg","static/images/cellImage_1538922270_56.jpg"]},{index:124,topic:"회귀분석(Regression)",define:`- 독립변수와 종속변수의 인과관계
- 하나 이상의 독립변수들이 종속변수에 미치는 영향(인과관계)를 추정할 수 있는 통계 기법 
- 회귀분석의 목표: B0와 B1을 구하는 것

* 기본가정사항: 선등정독 비
- 선형성(독립/종속), 등분산성(오차), 정규성(오차), 독립성(오차), 비상관성`,head:"",remark:null,image:[]},{index:125,topic:"회귀분석 모형",define:`1) 단순선형회귀모형 
- 독립변수와 종속변수와의 관계가 선형, 독립변수가 1개인 모형 
2) 다중 선형 회귀모형 
- 독립변수와 종속변수와의 관계가 선형, 독립변수가 2개 이상인 모형 
 3) 비선형 회귀분석 
- 독립변수와 종속변수의 관계가 선형이 아닐때 
4) 로지스틱 회귀분석 
- 종속변수의 값이 이분형(범주형)일 때`,head:"",remark:null,image:["static/images/cellImage_1538922270_57.jpg","static/images/cellImage_1538922270_58.jpg"]},{index:126,topic:"ㄴ단순회귀 분석",define:`- 하나의 독립변수가 종속변수에 미치는 영향을 추정하는 회귀분석 기법
독립/종속변수 각각 한개
오차항이 있는 선형관계`,head:`*가정사항
-선형성, 정규성, 등분산성, 독립성

* 회귀계수 추정
- 최소제곱법

* 회귀계수 유의성 검정
- t검정

* 적합성 검정
- 모델적합성:F검정(ANOVA)
- 모델설명력:결정계수
-데이터의 모델적합성:기본가정 확인`,remark:null,image:[]},{index:127,topic:"ㄴ다중회귀 분석",define:"- 두개 이상의 독립변수가 하나의 종속변수에 미치는 영향을 추정하는 회귀분석 기법",head:`* 가정사항
-선형성, 정규성, 등분산성, 독립성
-다중공선성

* 회귀계수 추정
- 최소제곱법

* 회귀계수 유의성 검정
- t검정

* 적합성 검정
- 모델적합성:F검정(ANOVA)
- 모델설명력:결정계수`,remark:null,image:[]},{index:128,topic:"ㄴ회귀절차",define:`* 회귀분석 절차 (회결회독다)
- 회귀계수도출(최소제곱법)
- 결정계수도출
- 회귀식유의성검정(F검정)
- 독립변수유의성검정(T검정)
- 다중공선성진단(VIF)`,head:`* 단순회귀
최소제곱법(회귀계수 추정) 
>회귀식의 적합도(결정계수)
>회귀분석의 적합성(분산분석표)-f
>회귀계수 검정
>회귀분석 가정 검정

* 다중회귀
수정된 결정계수, 다중 공선성 확인`,remark:`* 결정계수 R^2
- 회귀식이 오차를 설명하는 정도 
- 전체 데이터 중 회귀모델이 설명할 수 있는 데이터의 비율`,image:[]},{index:129,topic:"ㄴ회귀분석유의성 검정",define:`* 절차(선경계유적영최)
-회귀모델선정
-데이터경향성확인
-회귀계수추정-최소제곱법
-회귀계수유의성확인-T검정
-회귀식적합성확인-F검정,데이터의 모델적합성확인(선등정독)
-회귀식의영향력진단
-최종모델선정`,head:"",remark:`-> 다중회귀 분석은 독립변수간의 유의성을 다중공선성으로 검정, 로지스틱 회귀 분석은 모형의 유의성을 카이제곱 검정으로 검정 
결정계수=(집단내변동-집단간변동)/전체변인 
결정계수>0.65 이상 유의미`,image:[]},{index:130,topic:"ㄴ결정계수",define:`종속변수의 분산 중에서 독립변수로 설명되는 비율
모델의 설명력 검정`,head:"",remark:null,image:["static/images/cellImage_1538922270_59.jpg"]},{index:131,topic:"ㄴ다중회귀 독립변수 선택 방법",define:`- 모두 사용 : 전후단
- 전진 선택법
- 후진 제거법 
- 단계적 방법 
=> 래퍼기법 이용

- 변수가 많아질수록 결정계수가 높아져 수정 필요 : 수정된 결정계수`,head:"",remark:null,image:["static/images/cellImage_1538922270_60.jpg"]},{index:132,topic:"ㄴ다중회귀분석중요변수 결정 방법",define:`(맬수아배)
맬로우즈CP, 수정된결정계수(AdjustR^2), 아카이케정보기준(AIC), 베이즈정보기준(BIC)`,head:"",remark:null,image:[]},{index:133,topic:"ㄴ분산분석 사후검정방법",define:`튜키 HSD(Tukeys HonestSignificantDifference)
:스튜던트 범위 분포(q)를 기반, 평균 차 검정
쉐페(Scheffé)
:모든 가능한 조합, 보수적
던칸(Duncan)
:평균 크기 순 정렬, 다중 범위 비교(MRT)�방식
본페로니(Bonferroni)
: 유의수준/비교 횟수
피셔 LSD(Fisher’sLeastSignificant Difference)
: 개별 t검정을 수행`,head:"",remark:null,image:["static/images/cellImage_1538922270_61.jpg"]},{index:134,topic:"ㄴ다중회귀 다중공선성",define:`* 진단법(상결허분)
- 독립 변수간의 상관관계 확인(피어슨상관계수 -1~1)
- 결정계수 확인(R^2, P-Value)
- 허용오차(1-R^2<=0.1)
- 분산팽창요인(VIF > 10)
- 높은 상관관계 r(상관계수)>=0.9 일 경우 다중 공선성이 있다고 판단 
- 공차한계 값 10이하는 다중공선성이 높음(공차한계: 한 독립변수가 다른 독립변수들에 의해서 설명되지 않는 부분을 의미)`,head:`* 해결법 
- 상관관계가 높은 독립변수 중 하나 혹은 일부를 제거 
- 변수를 변형시키거나 새로운 관측치를 이용 
- 자료를 수집하는 현장의 상황을 보아 상관관계 이유를 파악하여 해결 
- 주성분분석(PCA)를 이용해 차원축소`,remark:null,image:["static/images/cellImage_1538922270_62.jpg"]},{index:135,topic:"ㄴ 회귀 모델 진단",define:`* 데이터 진단(Data Diagnostics) 
: 데이터의 변화에 따른 모델의 추정값 확인 (영향/이상값), 
-레버리지(Leverage), 
-표준화 잔차(Standardizedresidual)
-스튜던트 잔차(Studentizedresidual), 
-쿡의 거리(Cook’s Distance), 
-마할라노비스 거리(Mahalanobis distance)
-𝐷𝐹𝐹𝐼𝑇𝑆
-𝐷𝐹𝐵𝐸𝑇𝐴𝑆`,head:`* 모델 진단(Model Diagnostic)
-오차의 등분산성
: 레빈, 바틀렛 검정 이용
-다중공선성`,remark:null,image:[]},{index:136,topic:"ㄴ 회귀 모델 평가지표",define:`평균 오차 (Average Error)
평균 절대 오차(Mean Absolute Error)
평균 절대 백분율 오차(Mean Absolute Percentage Error)

평균백분율오차(Mean Percentage Error)
평균제곱오차(Mean Square Error)
평균제곱근오차(Root Mean Square Error)

R Square(결정 계수)
수정된 결정계수(Adjusted R Square)`,head:"",remark:null,image:["static/images/cellImage_1538922270_63.jpg","static/images/cellImage_1538922270_64.jpg"]},{index:137,topic:"ㄴ선형회귀분석",define:"- 종속변수 y와 한개 이상의 독립변수 x와의 선형 상관관계를 모델링하는 회귀분석 기법",head:`- 최적화: Gradient Descent 
- 목적: 예측기반 
- 선형회귀식:`,remark:null,image:["static/images/cellImage_1538922270_65.jpg"]},{index:138,topic:"ㄴ로지스틱 회귀분석",define:`- 독립변수 연속형/종속변수 범주형 
- 분석 대상들이 여러 집단으로 나누어진 경우, 독립변수의 선형 결합을 이용하여 개별 관측치가 어느 집단에 속하는지 확률을 계산하는 분류기법 

- 종류 : 이항, 다항, 서수 

- 최적화: 크로스 엔트로피`,head:`* 절차 
1) 확률의 선형 모델 표시 
2) 오즈 적용: 양의 값 무한대 변환
3) 로짓 적용(연결함수): 음의 값 무한대 변환 
4) 판별함수: 판별함수 수식으로 선형함수 사용  
5) 시그모이드: 0~1사이의 값을 가지는 출력변수로 변환`,remark:null,image:["static/images/cellImage_1538922270_66.jpg"]},{index:139,topic:"ㄴ규제(Regularization)가 있는 회귀분석",define:`- 회귀계수에 제약조건 추가, 과적합 막는 방법
- 모델 정확도 개선, 학습연산 속도증가, 
모델의 해석능력 향상

- 라쏘 
- 리찌 
- 엘라스틱넷(변수선택-임베디드기법)`,head:"",remark:null,image:[]},{index:140,topic:"ㄴ일반화 선형 모델",define:`- 일반선형모델 : 독립,종속변수간 통계적 관계 설명, 분산분석, 공분산분석, 선형회귀 등
- 일반화선형모델 : 연결함수써서 선형결합한 모델, 로지스틱회귀, 다항 로지스틱회귀 등`,head:`일반화 선형 모델의 3가지 성분 :확률요소, 선형예측자, 연결함수 
- 연결 함수 : 로지스틱 회귀(로짓), 선형회귀/분산분석(항등함수)`,remark:null,image:[]},{index:141,topic:"범주형 자료 분석",define:`- 독립변수 혹은 종속변수가 범주형 변수
모델의 유의성을 분석하는 방법`,head:"",remark:null,image:[]},{index:142,topic:"교차분석=카이제곱검정",define:`- 두 범주형 변수간의 연관관계를 볼때 교차표(분할표)를 작성하여 변수들간 관계를 분석하는 기법
(적동독)
1) 적합도 검정 - 변수 1 (불량원인-작업조)
- 하나의 범주형 변수에 대해 관측 값들이 어떤 이론이나 이론적 분포를 따르고 있는지 검정하는 것 
2) 독립성 검정 - 변수 2 (작업조-기계호기 고장횟수)
- 두개의 범주형 변수에 대해 관측값들이 다수의 인자들에 의해 분할되어 있는 경우 그 인자들의 관찰값에 영향을 주고 있는지 아닌지를 검정하는 방법 
3) 동질성 검정 - 변수 2 (성별-자동차선호도)
- 두개의 범주형 변수에 대해 각각으로부터 정해진 표본의 크기만큼 자료를 추출한 후, 분할표에서 각 집단간의 비율이 동일한가를 검정하는 방법 
- 집단간 분포의 동질성을 통해 두 집단간의 차이를 검정`,head:`* 검정 절차 (관기기)
가설>분할표>관측값 및 기대값 도출>검정통계량 산출>자유도>유의수준, 기각역`,remark:`* 교차분석 기본가정
- 빈도 분석의 특성별 차이분석
- 범주형변수(명목, 서열)
- 교차분석표 각 셀의 기대빈도가 5보다 커야함
- 기대빈도가 5보다 작은 셀의 수는 최소 전체 셀의 25%를 넘지 않아야 함
- 위 가정 만족못할 경우 피셔의 정확 검정수행(Fisher's Exact Test)`,image:[]},{index:143,topic:"다변량 분석",define:"- 여러 현상이나 사건에 대한 측정치를 개별적이 아닌, 동시에 분석하는 통계 기법",head:"",remark:null,image:["static/images/cellImage_1538922270_69.jpg"]},{index:144,topic:"ㄴANOVA/분산분석 (Analysis Of Variance)",define:`- 독립집단 3개 이상 (일이반이사후)
- 집단간의 평균이 서로 차이가 있는지 확인하기 위한 검정 방법 
- 다중비교를 통해 확인 가능

- 귀무가설: 셋 이상의 집단간 평균은 차이가 없음 
- 대립가설: 최소 한 집단 간에는 차이가 있다`,head:`- 집단간 분산비교, 차이분석(평균)을 위한 통계 분석 기법 

- 검정방법: F-test 
F통계량 = 집단간분산/집단내분산 
- F통계량이 1근처이면 집단간 차이없음, 1보다 크면 집단간 차이있음`,remark:null,image:["static/images/cellImage_1538922270_70.jpg"]},{index:145,topic:"ㄴANOVA/분산분석 (Analysis Of Variance)",define:"",head:"",remark:null,image:["static/images/cellImage_1538922270_71.jpg","static/images/cellImage_1538922270_72.jpg"]},{index:146,topic:"ㄴㄴ일원 분산분석(one-way ANOVA)",define:`- 두 개 이상의 범주를 갖는 하나의 실험요인에 대한 하나의 종속 변수의 평균 차이를 검정하는 분석(일반적으로 3개 이상) 

- 기본가정사항: 정규성, 독립성, 등분산성`,head:"",remark:`- 한 개의 집단 구분 독립 변수 분석
- 독립변수1 / 종속변수1`,image:["static/images/cellImage_1538922270_73.jpg"]},{index:147,topic:"ㄴㄴ이원 분산분석(two-way ANOVA)",define:`- 팩토리얼 디자인: 두개 이상의 독립처치 변수의 수준 변화에 따른 결과변수 값의 변화를 조사하기 위한 실험 디자인 

- 상호작용효과: 한 처치 변수의 변화가 결과변수에 미치는 영향이 다른 처치 변수의 수준에 따라 달라지는 것에 관심`,head:"",remark:`- 두 개의 집단 구분 독립 변수 분석
- 독립변수2 / 종속변수1`,image:["static/images/cellImage_1538922270_74.jpg"]},{index:148,topic:"ㄴㄴ반복측정(Repeated Measures ANOVA)",define:`- 동일개체에 대해 시간의 흐름에 따라 여러번 해당 결과를 반복하여 측정한 자료 분석 

- 기본가정사항: 정규성, 등분산성, 구형성(반복 측정시점사이의 관측값들의 분산이 모두 동일)`,head:"",remark:`- 집단에 대한 반복 측정 분석
- 독립변수1 / 종속변수1`,image:["static/images/cellImage_1538922270_75.jpg"]},{index:149,topic:"ㄴㄴ이원반복측정(Two-way Repeated Measures ANOVA)",define:"",head:"",remark:null,image:["static/images/cellImage_1538922270_76.jpg"]},{index:150,topic:"ㄴㄴ사후분석(Post-hoc Analysis)",define:`- 분산의 차이를 가지고 분석하기 때문에 사후분석 필요 
- 모든 집단 쌍에 대해 평균 차이의 유의성을 검정하는 방법(차이가 존재 할 때) , 
- 그룹끼리 차이가 있는지 확인 필요`,head:"",remark:`표분수, 분산
      O     O      Turkey, Duncan
      X      O      Sheffe, Bonferonni
      X      X       Games-Howell, Dunnet`,image:[]},{index:151,topic:"시계열 분석",define:`- 불규칙성을 가지는 시계열 데이터에 특정한 기법이나 모델을 적용하여 
규칙적 패턴을 적용 또는 예측할 수 있도록 하는 분석 기법`,head:"데이터가 정상성을 갖는다는 가정하에 사용",remark:null,image:[]},{index:152,topic:"ㄴ시계열 데이터",define:"- 연도, 분기, 일별 또는시간별 등 시간의 경과에 따라 순서대로 관측되는 데이터",head:"",remark:"내용 정리",image:["static/images/cellImage_1538922270_77.jpg"]},{index:153,topic:"ㄴ정상성",define:`- 시계열 데이터에서 평균,분산,자기상관(Autocorrelation)이 시간에 따라 일정한 성질

* 3가지 조건
평균 : 일정성
평균/분산 : 시점 비의존
공분산 : 시차의존, 시점 비의존`,head:`* 확인 방법
-시각적 분석 : 그래프 확인
-ADF 검정 : 귀무가설 데이터 정상성 X
-KPSS 검정 : 귀무가설 데이터 정상성 O
-PP 검정 : 단위근 존재 여부 확인
-ACF/PACF(자기상관 함수 분석)
-분산 분석 : Levene/Bartlett Test,
-스펙트럼 분석 : 푸리에 변환 >  주기적 패턴 확인

* 부여방법
-차분(Differencing) 
-계절 차분(SeasonalDifferencing) 
-로그 변환(LogTransformation) 
-Box-Cox변환 
-다항 회귀 제거(Detrending)`,remark:null,image:["static/images/cellImage_1538922270_78.jpg"]},{index:154,topic:"ㄴ자기상관성",define:`- 시간에 따른 데이터의 특정 시점 값이 과거의 값과 얼마나 연관성이 있는지(상관 관계가 있는지)를 측정하는 개념
- 이전 값이 현재 값에 영향을 미치는 정도를 나타내는 시계열 데이터의 특성
- 현재의 값이 과거의 값과 비슷한 패턴을 가지는지를 나타내는 척도`,head:`* 계수 범위
양의 자기상관 (ACF>0) 
음의 자기상관 (ACF<0) 
자기상관 없음 (ACF≈0) 

* ACF�(자기상관 함수) 
- 전체적인 자기상관을 측정 
* PACF�(부분 자기상관 함수)
- 특정 시차에서의 순수한 자기상관을 측정`,remark:`* 목적
- 예측 가능성을 확인
- AR(자기회귀)�모델의 적절한 차수 결정`,image:[]},{index:155,topic:"베이지안 분석",define:"베이즈 정리를 기반으로 확률적 추론을 수행하는 분석 방법",head:"",remark:null,image:[]},{index:156,topic:"비율과 비",define:`- 비율: 전체 중에서 사건이 차지하는 크기 
- 비: 사건 a와 b의 상대적 크기 
- 율: 특정시간동안 발생한 사건과 노출된 횟수(=비율) 

- 승산비: 사건이 발생할 확률과 발생하지 않을 확률간의 비`,head:`* 조건부확률
- 시간의 관점에서 a라는 사건이 이루어진 이후에 b라는 사건이 발생할 확률 
- 표본공간이 바뀜`,remark:"* 확률의 곱셈법칙",image:[]},{index:157,topic:"ㄴ베이즈 정리",define:`두 확률 변수의 사전 확률과 사후 확률 사이의 관계를 나타내는 정리하여
사후확률을 추론
불확실성 추론의 통계적 기법

* 구성
사조후 확전베

* 법칙
조건부 확률
확률의 곱셈 정리
전확률의 법칙`,head:"",remark:null,image:["static/images/cellImage_1538922270_81.jpg","static/images/cellImage_1538922270_82.jpg"]},{index:158,topic:"ㄴ나이브 베이즈 정리",define:"- 독립변수의 조건부 독립을 가정, 조건을 나이브하게 하고 베이즈 정리를 이용해 최대 가능도 추정",head:`* 종류
GaussianNaiveBayes
(가우시안 나이브 베이즈)
Multinomial�Naive�Bayes�
(다항 나이브 베이즈) 
Bernoulli�naive�Bayes
(베르누이 나이브 베이즈)`,remark:null,image:["static/images/cellImage_1538922270_83.jpg"]},{index:159,topic:"데이터마이닝",define:"- 대용량의 데이터 간 관계, 패턴, 추세를 발견하고 이를 의미있는 정보로 변환하여 기업의 의사결정에 활용하는 기술",head:`- 예측: 입력값을 기반으로 결과값 또는 목표 예측(회귀, 분류)
- 서술: 결과값이 알려져 있지 않은 입력데이터에 대해 패턴을 찾아내는 방법(군집화, 연관규칙)`,remark:"데이터 > 목표데이터 > 사전처리 > 변형 > 패턴 > 지식",image:[]},{index:160,topic:"비정형 데이터 분석(비정형 데이터 마이닝)",define:`- 텍스트, 이미지, 영상 등 비정형 데이터를 체계적인 통계적 규칙이나 패턴을 탐색하고 이를 의미 있는 정보로 변환하기 위한 분석 

- 텍스트 마이닝, 웹 마이닝, 오피니언 마이닝(감성분석), 리얼리티 마이닝, SNA`,head:"데이터 가치 높음",remark:null,image:["static/images/cellImage_1538922270_84.jpg"]},{index:161,topic:"ㄴ텍스트 마이닝",define:`- 텍스트 형태로 이루어진 비정형 데이터들을 자연어 처리 방식을 이용하여 정보를 추출하는 기법
- 자연어 처리 기술을 사용해 인간의 언어로 쓰인 비정형 텍스트에서 유용한 정보를 추출하거나 다른 데이터와의 연계성을 파악하여 분류나 군집화 등 빅데이터에 숨겨진 의미 있는 정보를 발견하는 것 

- 텍스트 시각화 : 워드클라우드(많이 노출된 단어), 의미연결망분석(단어간 연결-선거별후보 지지율)`,head:`* 기법 
- 정보 추출: 일반적인 텍스트 문서로부터 사용자가 원하는 정보를 추출 
- 문서분류(군집화): 문서들을 문서의 내용에 따라 구조화
- 문서요약: 문서에서 다른 중요 내용을 글로 요약 
- 웹 마이닝: 텍스트 마이닝 기법을 웹에 적용
- Concept Linkage: 문서들에서 공유되고 있는 의미를 발견하여 사용자에게 제공
- Question Answering: 사용자가 자연어로 질문을 던지면 시스템이 대답 제공
- Topic Tracking: 사용자 프로필에 따라 관심 가질 것으로 예상되는 문서들만 추출하여 제공`,remark:`* 절차 
데이터 수집/클리닝/반환 > 전처리 > 정보추출 > 클러스터링/범주화 > 요약/검색`,image:[]},{index:162,topic:"ㄴ텍스트 마이닝",define:`- 텍스트 형태로 이루어진 비정형 데이터들을 자연어 처리 방식을 이용하여 정보를 추출하는 기법
- 자연어 처리 기술을 사용해 인간의 언어로 쓰인 비정형 텍스트에서 유용한 정보를 추출하거나 다른 데이터와의 연계성을 파악하여 분류나 군집화 등 빅데이터에 숨겨진 의미 있는 정보를 발견하는 것 

- 목적 : 문서요약, 문서분류, 문서군집, 정보추출  

- 텍스트 시각화 : 워드클라우드(많이 노출된 단어), 의미연결망분석(단어간 연결-선거별후보 지지율)`,head:`* 기법 
- 정보 추출: 일반적인 텍스트 문서로부터 사용자가 원하는 정보를 추출 
- 문서분류(군집화): 문서들을 문서의 내용에 따라 구조화
- 문서요약: 문서에서 다른 중요 내용을 글로 요약 
- 웹 마이닝: 텍스트 마이닝 기법을 웹에 적용
- Concept Linkage: 문서들에서 공유되고 있는 의미를 발견하여 사용자에게 제공
- Question Answering: 사용자가 자연어로 질문을 던지면 시스템이 대답 제공
- Topic Tracking: 사용자 프로필에 따라 관심 가질 것으로 예상되는 문서들만 추출하여 제공`,remark:"위치 이동",image:[]},{index:163,topic:"ㄴㄴ텍스트마이닝절차",define:`* 절차 
데이터 수집/클리닝/반환 > 전처리 > 정보추출 > 클러스터링/범주화 > 요약/검색`,head:"",remark:"위치 이동",image:["static/images/cellImage_1538922270_85.jpg"]},{index:164,topic:"ㄴ텍스트 마이닝",define:`텍스트 전처리 : 특정한 문서로부터 구체적인 정보를 정제하는 과정 

말뭉치(Corpus) 형성, 토큰화(Tokenization), 불용어(Stop word) 처리, 정제(Cleaning), 정규화(Normalization), 어간 추출(Stemming), 표제어 추출(Lemmatization)
텍스트 인코딩(Text Encoding)`,head:"",remark:"위치 이동",image:["static/images/cellImage_1538922270_86.jpg"]},{index:165,topic:"ㄴ웹 마이닝",define:`- 인터넷에서 수집한 정보를 데이터 마이닝 기법으로 분석하는 것 
- 웹에서 발생하거나 웹 사이트에 저장한 데이터를 대상으로 유용한 패턴을 찾아내는 기법`,head:`* 유형
1) 웹 구조 마이닝: 웹 사이트의 노드와 연결구조 분석 
2) 웹 사용 마이닝: 웹 서버 로그 파일 분석하여 맞춤형 서비스 지향 (전처리, 패턴탐색, 패턴분석)
3) 웹 콘텐츠 마이닝: 웹 페이지에 저장된 콘텐츠로부터 사용자가 원하는 정보를 빠르게 찾는 기법`,remark:null,image:[]},{index:166,topic:"ㄴ오피니언 마이닝 (= 감성분석)",define:`- 다양한 온라인 뉴스와 소셜 미디어 코멘트, 사용자가 만든 콘텐츠에서 표현된 의견을 추출/분류/이해하고 자산화 하는 컴퓨팅 기술 

- 어떤 사안이나 인물, 이슈, 이벤트에 대한 사람들의 의견이나 평가, 태도, 감정 등을 분석 
- 인터넷에 산재한 게시물 및 댓글 등에서 소비자의 의견을 수집/분석해 제품이나 서비스 등에 대한 평한을 추출해 내는 마이닝 기법`,head:`* 수행단계 
1) 특징추출: 의미 있는 요소, 특징을 추출하는 단계 
2) 의견 분류: 어떤 의미로 사용되었는지 분석하고 분류하는 단계 
3) 요약 및 전달: 선호도가 밝혀진 오피니언 정도를 요약하고 사용자에게 전달`,remark:null,image:[]},{index:167,topic:"ㄴ리얼리티 마이닝",define:"- 휴대폰 등 모바일 기기를 사용하여 인관관계/행동방식/라이프 스타일 등을 분석하는 기술",head:"휴대폰을 통해 사람들의 통화/메시징, 위치 등의 데이터를 수집하고, 기계학습 기법을 써서 그들의 사회적 행위를 마이닝",remark:"생체인식을 통한 소비자 식별과 맞춤화된 마케팅, 감정에 따른 심리적 변화를 추적해 제품판매에 반영",image:[]},{index:168,topic:"ㄴ소셜 네트워크 분석(SNA, 사회연결망 분석)",define:`- 수학의 그래프 이론을 바탕으로 소셜 네트워크 서비스에서 소셜 네트워크 연결 구조와 연결 강도를 분석하여 사용자의 명성 및 영향력을 측정하는 것
- SNS데이터 활용해 사회연결망과 사회구조등을 사회과학적으로 분석하는 기법 

- 속성 : 노드, 링크, 차수(밀도)

- 사회연결망 분석-워드클라우드 

- 표현 방법 : 집합론적 방법(관계 쌍), 그래프, 행렬 이용`,head:`* 분석절차
그래프생성>가공및분석>커뮤니티 탐지 및 역할정의>데이터변환 및 마이닝 기법활용`,remark:`* 분석 주요속성
응집력(관계), 등가, 명성(하위), 범위, 중계(나중심연결) 

* 분석 기법 
- 중심성 분석 : 연결중심성(Degree Centrality), 매개중심성
(Betweenness Centrality), 근접(인접) 중심성(Closeness Centrality), 고유벡터 중심성(Eigenvector Centrality) 
- 이웃 분석
- 응집도 분석
- 밀도 분석
- 친화도 분석`,image:[]},{index:169,topic:"ㄴ프로세스 마이닝",define:"- 업무 프로세스 수행을 지원 또는 수행 결과를 기록하는 정보시스템 ERP, BPM, CRM, SCM 등에 저장되어 있는 과거 업무수행기록(정보시스템 로그)를 분석하여 업무 수행결과에 대한 여러가지 정보 및 지식을 추출해내는 것을 목적으로 하는 활동 및 방법론",head:`* 접근법
1) 발견: 기존의 프로세스로부터 정보를 추출하여 새로운 프로세스를 찾아냄
2) 순응도(적합): 이벤트 로그와 프로세스 모델간의 일치 정도를 분석
3) 확장: 원래의 프로세스를 확장시켜 적합성 상승`,remark:null,image:[]},{index:170,topic:"ㄴ모수의 분산차이 검정",define:`*카이제곱검정
- 관측 빈도와 기대 빈도 간의 차이를 검정
두 변수 간의 독립성 또는 분포의 적합성 확인
통계적 방법

*F검정
-정규모집단에서 독립적으로 추출한 두 표본의 분산
그 차이가 통계정으로 유의한가에 대해
두 모분산의 비를 이용패 판별하는 검정방법`,head:"",remark:"추가",image:["static/images/cellImage_1538922270_88.jpg"]},{index:171,topic:"ㄴ모수의 평균차이 검정",define:`* Z검정
* t검정
* 분산검정(ANOVA)`,head:"",remark:null,image:[]},{index:172,topic:"ㄴㄴZ검정",define:`- 정규분포를 가정하며 추출된 표본이 모집단에 속하는지 가설 검정하기 위해 사용
- 모분산을 알고 있는 경우, 모분산 모를 경우 표본이 30개 이상`,head:`정규분포 -
 모분산이 알려짐 : Z분포        
 모분산 모름 : Z분포(n>=30 대표본) 

- 귀무가설
: 두 집단간 평균은 차이가 없음 
- 대립가설
: 두 집단간 평균은 차이가 있음`,remark:null,image:["static/images/cellImage_1538922270_89.jpg"]},{index:173,topic:"ㄴㄴt-검정",define:`- 모분산 모를 경우 표본이 30개 미만일때,  
평균이 서로 차이가 있는지를 확인하기 위한 검정방법`,head:`모분산 모름 : t분포(n<30 소표본) 

- 귀무가설
: 두 집단간 평균은 차이가 없음 
- 대립가설
: 두 집단간 평균은 차이가 있음`,remark:null,image:["static/images/cellImage_1538922270_90.jpg"]},{index:174,topic:"ㄴㄴㄴz/t-검정의 종류",define:"(일대독)",head:"",remark:null,image:[]},{index:175,topic:"ㄴㄴㄴ일표본 z/t검정",define:`- 하나로 구성된 모집단의 평균값을 기준값과 비교하고자 할 때 사용 

- 기본가정사항: 정규성`,head:"",remark:`독립변수 그룹1(범주형) 
종속변수(연속형)`,image:["static/images/cellImage_1538922270_91.jpg"]},{index:176,topic:"ㄴㄴㄴ대응표본 z/t검정",define:`- 실험 이전의 집단과 실험 이후의 집단이 동일한 집단일 경우 사용하는 분석법 

- 기본가정사항: 정규성`,head:"",remark:`독립변수 그룹2(범주형) 
종속변수(연속형)`,image:["static/images/cellImage_1538922270_92.jpg"]},{index:177,topic:"ㄴㄴㄴ독립표본 z/t검정",define:`- 두 집단이 서로 독립적일 때 두 집단간 평균차이를 검정하기 위한 분석법  

- 기본가정사항: 정규성, 독립성, 등분산성`,head:"",remark:`독립변수 그룹2(범주형) 
종속변수(연속형)`,image:["static/images/cellImage_1538922270_93.jpg"]},{index:178,topic:"ㄴㄴ분산검정(ANOVA)",define:`- F검정을 이용 집단 간 분산, 집단 내 분산
비교하여 여러집단 평균차이를 검정하는 통계 기법`,head:"",remark:null,image:[]},{index:179,topic:"적합도 검정",define:`* 적합도
- 실험에서 얻은 결과, 이론적 분포, 일치정도
* 검정방법
- 카이제곱 검정
- 정규성 검정`,head:"",remark:null,image:[]},{index:180,topic:"ㄴ정규성 검정 (오차)",define:`콜샤큐
* 콜모고로프-스미르노프 검정
- 경험적 누적분포함수(ECDF, EDF) 
기반한 검정

* 샤피로-월크 검정
- 오차항이 정규분포 따르는지 확인하는 검정

* Q-Q Plot
-  두 분포의 분위수 비교, 데이터가 특정 분포 따르는지 시각적 확인하는 그래프`,head:"",remark:null,image:[]},{index:181,topic:"분석모델 해석",define:`* 해석기법
- 데이터 시각화
- 인포그래픽
- 정보시각화
- 빅데이터 시각화`,head:"",remark:null,image:[]},{index:182,topic:"ㄴ데이터 시각화",define:`- 데이터에 대한 이해를 돕기 위해 그럼, 도형 등 그래픽 요소들을 이용해 데이터를 묘사하고 표현하는 과정 

* 시각화 목적: 정보전달, 설득 

* 시각화 기능 
- 설명: 전달하려는 메시지와 분석 결과 설명 
- 탐색: 유의미하고 흥미로운 요소 명확하게 보여줌 
- 표현: 표현을 통해 이야기 전달과 공감을 불러일으키기 위한 기능`,head:`* 시각화 절차(구시표)
정보구조화
>정보시각화 특성정의
>정보시각화 표현`,remark:`시분관비공인 
- 시간시각화: 막대그래프, 누적 막대그래프, 점그래프 
- 분포시각화: 파이차트, 도우넛차트, 트리맵 
- 관계시각화: 스캐터플롯, 버블차트, 히스토그램, 산점도, 산점도 행렬 
- 비교시각화: 히트맵, 체르노프페이스, 스타차트, 평행좌표 
- 공간시각화: 등치지역도, 등치선도, 도트맵, 버블 플롯맵, 카토그램 유지 
- 인포그래픽: 중요정보를 하나의 그래픽으로 표현`,image:[]},{index:183,topic:"ㄴ데이터시각화",define:`벤프라이7단계
(정보구조화)획득,분해,선별,마인(mining)
(정보시각화)표현,정제
(정보시각표현))상호작용

구조-시각화-시각표현
-시간 : 막대그래프
-분포 : 파이차트, 도넛그래프
-관계 : 버블차트, 산점도
-비교 : 체르노프페이스, 버블차트
-공간 : 등치지도

시각화 구축절차
-기획->모델링->디자인->구축->배포->유지보수`,head:`획분선마 표정 상
구시표
시분관비공
기모디구배유`,remark:null,image:[]},{index:184,topic:"ㄴ인포그래픽",define:`정보+그래픽의 합성어
핵심정보를 그래픽으로 표현해 쉽게 이해할수 있게 만든 그래픽 메세지`,head:`지도타스만비
지도형, 도표형, 타임라인형, 스토리텔링형, 만화형, 비교분석형`,remark:null,image:[]},{index:185,topic:"데이터라벨링",define:"- 원천 데이터를 AI가 효과적으로 학습할 수 있도록 사람이 먼저 라벨링을 통해 데이터 셋을 만들어 주는 과정",head:"원천데이터수집>데이터전처리>데이터저장>라벨링>학습데이터 검토 및 업데이터>데이터 큐레이션 및 정제>모델적용>평가 및 모니터링",remark:null,image:[]},{index:186,topic:"ISO/IEC 20547",define:`- 빅데이터 참조 아키텍처 국제 표준
- 빅데이터 참조 아키텍처에 대한 구조, 절차, 기술적 고려사항, 보안 및 개인정보보호에 대해 정의한 빅데이터 참조 아키텍처 표준`,head:`1) 개요 및 적용 절차
2) 유즈케이스 및 기술적 고려사항
3) 빅데이터 참조 아키텍처
4) 보안 및 개인정보보호 
5) 표준 로드맵`,remark:null,image:["static/images/cellImage_1538922270_94.jpg"]},{index:187,topic:"ISO/IEC 22989",define:`- 인공지능 기능 구현 국제 표준
- 인공지능 시스템 구성 및 기능 구현에 대한 아키텍
처 참조모델을 제공하는 국내 주도의 ISO/IEC 표준
- 인공지능 파이프라인 수용하여 표준 생성`,head:`[Learning]
학습 데이터 > 분석요인 도출 > 머신러닝알고리즘 적용 > 분류/예측
[Prediction]
신규데이터 > 분석요인 도출 > 분류/예측 > 결과값`,remark:null,image:[]},{index:188,topic:"공공데이터베이스 표준화",define:"- 공공기관들이 보다 효율적으로 데이터 표준화 활동을 수행할 수 있도록 지원하고, 공공기관 및 국가차원에서 관리하고 있는 공공데이터의 데이터 표준화에 대한 필요성과 이해도를 높이기 위하여 마련된 매뉴얼",head:"계획 > 발주 > 설계(현황분석) > 개발(목표시스템 정의) > 완료(이행) > 운영",remark:null,image:[]},{index:189,topic:"NewSQL",define:`- RDBMS, NoSQL 장점 융합
- RDBMS의 ACID 특성을 보장하면서 NoSQL의 확장성을 제공하는 차세대 데이터베이스 관리 시스템

* VOLTDB`,head:`* 기술요소 
[RDBMS 측면]
- 인덱싱: 검색속도 향상
- MVCC: 동시성제어
- 샤딩: 분산저장
[NoSQL 측면]
- 스키마리스: key-value 기반 단순검색
- 인메모리: 고성능, 저지연, 버퍼 불필요
- DB스케일링: scale-out 방식 유연한 구조`,remark:`* 기능 
1) 트랜잭션 
- SQL 기반 상호작용 
- ACID 지원 
- 비잠금 동시성제어 
2) 아키텍처 
- 노드단위 고성능 
- 병렬/비공유`,image:[]},{index:190,topic:"연관규칙(Association Rule)",define:`- 장바구니 분석 
- Apriori 방법
- 특정사건들이 동시에 발생하는 빈도로 상호간의 연관성을 표현하는 규칙`,head:`- 모든 규칙은 사용자가 지정한 최소한도의 지지도(support)를 만족해야 한다
- 모든 규칙은 사용자가 지정한 최소한도의 신뢰도(confidence)를 만족해야 한다 

지지도 = x 교집합 y / 전체 n
신뢰도 = x 교집합 y / p(x) - 조건부확률
향상도(Lift) = x 교집합 y / p(x)p(y)
*연관규칙 발견과정 : 후데연`,remark:null,image:["static/images/cellImage_1538922270_95.jpg"]},{index:191,topic:"ㄴApriori 알고리즘",define:`- 연관규칙 하기 전에 수행
- 연관규칙 1세대 알고리즘
- 빈발항목집합만을 고려하여 데이터 간의 연관관계를 밝히기 위한 방법 -> 모든 가능한 항목집합의 개수를 줄이는 전략`,head:`* 선험적 규칙 
- 한 항목집합이 빈발 ---> 모든 부분집합은 빈발항목집합
- 한 항목집단이 비빈발 --->  모든 집합은 비빈발항목집합`,remark:`* 절차
1) 결합(Natural Join) 단계
2) 가지치기(Pruning) 단계`,image:[]},{index:192,topic:"ㄴ연속규칙(Sequential Pattern)",define:"- 연관규칙에 시간의 개념을 첨가하여 시간의 흐름에 따른 항목들의 상호 연관성 탐색",head:"정렬단계 > 빈발항목집합 단계 > 변환단계 > 시퀀스 단계 > 최대화 단계",remark:null,image:[]},{index:193,topic:"ㄴ빈발패턴성장 알고리즘(FP-Growth)",define:"- 분석해야할 데이터가 증가하면서 선험적(Apriori)알고리즘의 연산속도를 개선한 트리구조의 연관규칙 알고리즘",head:`시간적 특성 반영
Apriori + 연산속도 -> 트리구조 기반`,remark:null,image:[]}],i={subject:n,topics:e};export{i as default,n as subject,e as topics};
