const n="신기술",e=[{index:1,topic:"토픽",define:"설명",head:"두음",remark:"추가설명",image:[]},{index:2,topic:"가트너2023",define:`- 조직이 탄력성, 운영 또는 신뢰를 최적화하고, 수직적 솔루션 및 제품 제공을 확장하며, 새로운 형태의 참여, 신속한 대응 또는 기회를 개척하는데 도움을 주는 전략 기술 트랜드
 
- 구성요소: 최적화, 확장, 개척, 지속가능성`,head:"최적화, 확장, 개척, 지속가능성",remark:null,image:[]},{index:3,topic:"ㄴOptimize(최적화)",define:`1) 디지털 면역 시스템: 자동화, 공급망 보안 결합, 시스템의 복원력과 안정성 향상
2) 관찰 가능성 적용: 관측 가능한 아티팩트를 조정, 피드백 제공, 의사결정 가속화
3) AI 신뢰, 리스크 및 보안관리: 안정성, 신뢰성, 보안 보장위해 새로운 역량 도입 필요`,head:"디관아",remark:null,image:[]},{index:4,topic:"ㄴㄴ디지털면역시스템",define:`- 시스템,네트워크,장치를 사이버위협으로부터 보호하도록 설계된 SW 또는 시스템
 
- 6가지 요소: 관찰가능성, AI증강테스트, 카오스엔지니어링, SRE, 자동복구, APP공급망보안`,head:`복원력 강화
 
관아카s자a`,remark:null,image:[]},{index:5,topic:"ㄴScale(확장)",define:`4) 산업 클라우드 플랫폼: SaaS, PaaS, IaaS 이용한 비즈니스 지원
5) 플랫폼 엔지니어링: 개발자 경험 최적화
6) 무선의 가치 실현: NW가 직접적인 비즈니스 가치 원천`,head:"산플무",remark:null,image:[]},{index:6,topic:"ㄴPioneer(개척)",define:`7) 슈퍼앱: 앱, 플랫폼 및 생태계의 기능을 하나로 통합, 자체 미니 앱 개발 배포 지원
8) 적응형 AI: 실시간 피드백, 동적 목표 조정, 변경 최적화
9) 메타버스: 지속적이며 향상된 몰입 경험 제공`,head:"슈적메",remark:null,image:[]},{index:7,topic:"ㄴㄴ슈퍼앱",define:`- 하나의 앱 안에서 별도의 다른 앱을 설치하지 않아도 수많은 서비스를 이용할 수 있는 앱(하나의 앱에서 모든 서비스 이용) 
- 주요기능: 여러 서비스 및 기능 제공, 개인화, 원활한 사용자경험, 타사 서비스와의 통합, 결제통합, 소셜 네트워킹, 인앱광고, 보안 및 개인정보 보호
 
- 기술요소: Frontend, Backend, AI, Cloud, Seemless UX 
- 서비스: 검색, 금융, 주문, OTT 등`,head:"",remark:null,image:[]},{index:8,topic:"ㄴ지속가능성",define:"IT 서비스의 에너지와 효율성을 높이는 솔루션의 프레임워크(지속가능성 목표 달성과 ESG 충족위해 투자 필요)",head:"",remark:null,image:[]},{index:9,topic:"가트너2024",define:`* AI 변화 : 생산성 -> 창의성
* 투자보호, 가치전달, 빌더의 부상(투가빌)
 
T위기 플증산 지보증기
1.AI TRiSM : 생성형AI문제점
  - (AI할루시네이션, 개인정보보호문제, 범죄적활용)
  - 설명가능성/모델모니터링, 모델운영자동화(ModelOps), AI어플리케이션보안, 개인정보보호
2.지속적위험노출관리 : SW공급망 공격, 클라우드 사용증가
  - 공격표면 정의, 탐색, 우선순위, 유효성검증, 인력동원
3.지속가능한기술 : ESG 원칙준수, 태양광발전, 스마트기술, 재활용, 그린빌딩
  - 초기 투자 및 기술 전환에 따른 비용 고려, 전략적 계획 필요`,head:`4.플랫폼엔지니어링 : 기술 플랫폼을 설계, 구축 및 유지하는 과정 
  - 생산성 향상, 사용자경험 최적화, 경쟁우위 확보
  - 클라우드 인프라, 데이터 처리, API관리, 보안
5.AI 증강개발 : 개발시 AI 활용
  - 코드생성 및 이해, 코드변환, 기술부채 탐지 및 측정, 사용자 기대치 충족(대화식 프롬프트 기반), SW테스팅
6.산업클라우드플랫폼 : 산업에 맞추어 IaaS, PaaS, SaaS 사용하여 맞춤형 클라우드로 전환`,remark:`7.지능형Application : 자동화, 증강(실시간 분석), 적응성(사용자 행동, 선호도 학습)
  - 자동날씨알림, 자동보험사고접수등
8.보편화된 생성AI : LLM, 프롬프트, 클라우드컴퓨팅- CTEM
9.증강-연결된인력 : 인력분석(역량 최적화), 지능형App(업무 효율화)
10.기계고객 : 로봇, 자율주행차, 스마트기기 등 비인간 엔티티 - 다양한 산업, 분야에서 활용
 
* 3단락 : 2024CES 주요내용 -> 증강AI`,image:[]},{index:10,topic:"ㄴAI TRiSM(AI Trust, Risk, and Security Management)",define:`- AI모델에 대한 거버넌스, 신뢰성, 공정성, 효율성, 개인정보보호 및 데이터 보호 및 신뢰성을 가능하게 하는 프레임워크
 
- 핵심: AI모델 거버넌스, 신뢰성, 공정성
- 5가지 기본요소: 설명가능성, 모델옵스, 데이터 이상감지, 경쟁적 학습 대응력, 데이터 보호
- 시스템: AI시스템, 에이전트`,head:"",remark:null,image:[]},{index:11,topic:"ㄴCTEM(Continuous Threat Exposure Management)",define:`- 지속적인 모니터링, 분석, 개선 프로세스를 통해 조직의 보안노출을 관리하고 줄이는 전략
 
- 단계: 1단계 범위지정 -> 2단계 탐색 -> 3단계 우선순위 -> 4단계 유효성검증 -> 5단계 인력동원`,head:"",remark:null,image:[]},{index:12,topic:"ㄴ보편화된 생성형AI",define:`- 조직 내 모든 직원이 대화형 방식으로 정보에 접근가능 하고 기술적 지식이 없는 사람도 복잡한 시스템에 접근 가능한 기술(지식의 민주화, 기술의 민주화, LowCode/NoCode 솔루션)
* 기술요소 
  - 사전훈련된 LLM모델
  - Prompt Engineering
  - 파이썬 오픈소스 
  - 퍼블릭 클라우드
  - GAN
  - Stable Diffusion: U-Net(noise predicator) 이용 이미지생성
* 고려사항: 할루시네이션 모니터링, 생성형AI윤리 가이드준수, 설명가능한 모델 확보`,head:"",remark:null,image:["static/images/cellImage_1036301339_0.jpg"]},{index:13,topic:"ㄴMachine Customers(기계 고객)",define:`- 커스토봇(Custobot)으로도 알려진 기계고객은 기계가 인간을 대신해서 자율적으로 제품이나 서비스를 주문 및 결제하는 서비스
- 3단계 변화: 경계형 -> 적응형 -> 자율형`,head:"",remark:null,image:["static/images/cellImage_1036301339_1.jpg"]},{index:14,topic:"가트너 2023 하이프 사이클",define:`- 가트너 하이퍼 사이클에서는 각 기술의 위치를 아래 5단계로 표현하며, 가로축은 시간, 세로축은 기대치로 표현 
 
* 기타 모델: △매직 쿼드런트(Magic Quadrant) △임팩트 레이다 (Impact Radar) 
 
- 단계: 기술촉발->부풀려진 기대의 정점->환멸단계->계몽단계->생산성 안정 단계`,head:"",remark:null,image:["static/images/cellImage_1036301339_2.jpg"]},{index:15,topic:"초거대AI",define:`- 대용량 연산이 가능한 슈퍼컴퓨팅 인프라를 기반으로 대규모 데이터를 스스로 학습하여 연산, 학습, 판단능력이 뛰어난 차세대 AI기술
 
* 기술요소
  - 데이터: 초대규모 데이터셋
  - 컴퓨팅: 슈퍼컴퓨터, 고성능인프라
  - 알고리즘 모델: 파라미터, 자연어 처리, 전이학습, 자율지능공존, 복합인공지능`,head:`* 국내외 개발동향
  - 국내: LG 엑사온
  네이버 하이클로바 공개
  카카오 KoGPT
  - 국외: 구글의 스위치 트랜스포머
  엔비디아/MS의 메가트론
  딥마인드 고퍼Gopher
  중국의 우다오 2.0
  DALL-E2`,remark:null,image:[]},{index:16,topic:"초거대 멀티모달 AI",define:`- 다양한 모달리티(의사소통 채널)를 동시에 인식하는 AI 모델
- 텍스트(언어)와 시각적 정보(이미지, 동영상), 소리, 영상, 촉감 등 인간의 다양한 감각기관을 통합하여 학습 후 새로운 창작물을 생성하는 차세대 AI 기술`,head:`* 기술요소
  - 데이터: 초대규모 데이터셋
  - 컴퓨팅: 고성능 인프라
  - 알고리즘: 파라미터, 멀티모달(센싱, 3D, Actuator
 - AR/VR/XR, 텔레햅틱), 추론 프레임워크, 튜닝기능
 
 * 활용사례
 - 아바타, AI휴먼, 메타버스, 텔레햅틱 기술과 접목하여 컨텐츠 사업, 예술분야, 마케팅, 의료, 금융 분야에 활용 가능`,remark:null,image:[]},{index:17,topic:"생성모델과 판별모델",define:`- 생성모델 : 데이터의 분포를 학습하여, 학습한 데이터셋과 비슷하면서도 기존에 없던 새로운 데이터셋을 생성하는 모델
 
- 판별모델 : 분류 경계를 찾는 것을 목적으로 학습하여, 입력된 데이터셋을 특정 기준에 따라 분류하거나, 특정 값을 맞추는 모델`,head:`* 생성모델 알고리즘
 - 학습 데이터의 분포를 기반으로 하는 명시적 방법(Explicit Density)과 데이터의 분포를 모르더라도 생성하는 암시적(Implicit Density)로 구분`,remark:null,image:[]},{index:18,topic:"파운데이션 모델",define:`- 사용자가 원하는 목적에 맞게 다운스트림 작업에 대해 미세 조정이나 문맥내 학습 등과 같은 과정을 거침으로써 완성되는 기초모델
 
* 특징
  - 자기지도학습 기반: 방대한 양의 데이터 셋 스스로 학습
  - 창발성(Emergency): 모델이 스스로 문제해결 지식 도출
  - 균일화(Homogenization): 적용범위가 점차 확대되며 범용
  - 트랜스포머 기반: 셀프 어텐션 기법`,head:`* 기반기술
  - 대용량 학습데이터 구축
  - 자기 지도학습 기법
  - 트랜스포머 아키텍처
  (포지셔널 인코딩 이용,
  BERT : 트랜스포머 인코딩만 사용/
  GPT : 트랜스포머 디코딩만 사용)
  - GPU 클러스터링, 고성능 컴퓨팅`,remark:null,image:[]},{index:19,topic:"생성형 AI",define:`- 생성형 AI(Generative AI)는 딥러닝의 하위 분야
- 즉, 지도, 비지도, 준지도 학습 방법을 통해 레이블이 있는 데이터와 없는 데이터를 모두 처리할 수 있음`,head:`* 주요기술
  - 딥러닝(Deep Learning)
  - 자연어 처리 (NLP)
  - 이미지 처리 (Computer Vision)
  - 강화학습
  - 생성 모델 (Generative models)
  - 자기 지도 학습 (Self-supervised learning)
  - 파운데이션 모델(Foundation Model) 
  - 프롬프트 엔지니어링(Prompt Engineering) 
  - 파인 튜닝(Fine Tuning)`,remark:null,image:["static/images/cellImage_1036301339_3.jpg"]},{index:20,topic:"AI프롬프트",define:"- AI 분야에서 프롬프트는 AI 모델로부터 응답을 생성하기 위한 입력값",head:`* 구성요소(지문입출)
 - 지시(Instruction): 모델이 수행하기를 원하는 특정 작업,지침
 - 문맥(Context): 모델이 조정하는 외부정보, 추가 컨텍스트 
 - 입력(Input Data): 답을 구하고자 하는 것에 대한 입력 or 질문 
 - 출력(Output): 모델에서 기대하거나 요구하는 출력의 유형,형식`,remark:null,image:[]},{index:21,topic:"프롬프트 엔지니어링",define:"- AI가 생성하는 결과물의 품질을 높일 수 있는 프롬프트 입력 값들의 조합을 찾는 작업",head:`* 기법 
 - Zero-shot Prompting 
 - One-shot Prompting: 하나 예제 기반 답변 생성 
 - Few-shot Prompting 
 - Transfer Learning(전이학습)
 - Reinforcement Learning, NLP
 - CoT(Chain of Thought): 답변에 도달하는 과정을 학습시키는 것을 목적`,remark:`* 보안위협
 - Prompt Injection, Leaking, JailBreaking
 프롬프트 인젝션
 프롬프트 리킹
 제일브레이킹`,image:[]},{index:22,topic:"DALL-E",define:`- 자연어 처리와 컴퓨터 비전을 결합하여 텍스트에서 이미지를 생성할 수 있는 AI 모델(Text-to-Image)
- Open AI에서 공개
- GPT-3의 auto regressive transformer 기반 생성모델 이후 진화
- 2021년 DALL-E 발표 후 DALL-E2로 진화함`,head:`* 기술요소
  - 데이터: GPT-3
  - 알고리즘: 자연어처리(NLP), 이미지 인식(YOLO, CNN, Faster R-CNN, OCR 이미지인식), Zero-hot learning의 시각영역으로 확장`,remark:null,image:[]},{index:23,topic:"텍스트 투 비디오 모델 (Text to Video Model)",define:`- 자연어 처리 기반의 모델에서 진화한 기술로, 프롬프트 텍스트 기반의 동영상 제작 서비스 제공 모델
- 복잡하고 사실적인 장면 및 특정 동작, 배경 묘사 가능하게 진화`,head:"",remark:null,image:["static/images/cellImage_1036301339_4.jpg"]},{index:24,topic:"Few Shot Learning",define:`- 적은 양의 데이터로 모델을 학습하여 테스트 데이터에서 유의미한 성능을 얻고자 하는 작업
- 대두 배경: 높은 데이터 수집 및 레이블링 비용, 충분한 데이터 확보의 어려움, 이미지를 보고도 구분 가능한 능력이 딥러닝에 필요 요구
 
* 구성요소
  - Support Set: 이미지와 레이블로 구성된 적은 양의 학습 데이터셋(모델학습) 
  - Query Set: Support Set으로만 모델을 학습한 후, 모델의 성능을 평가할 데이터 셋`,head:`* Few Shot Learning 접근법 
  - 전이 학습(파인 튜닝)
  - 메타 러닝: 인간과 유사한 메타 인지를 표방
  - 거리 학습: 유사도 기반
  - 액티브 러닝: 반 자동화 라벨링
  - 생성 모델 활용`,remark:null,image:[]},{index:25,topic:"메타러닝",define:`- ’학습하는 법을 학습한다’ 는 개념으로, 적은 양의 데이터와 주어진 환경만으로도 스스로 학습하고, 학습한 정보와 알고리즘을 새로운 문제에 적용하여 해결하는 학습 방식
 
* 메타러닝 학습 기법 
  - Metric-based Approach(거리 기반 학습 기술)
  - Model based Approach(모델 기반 학습)
  - Optimization-based Approach(최적화 기반 학습)`,head:`* 메타러닝 연구동향
  - 오토ML: 데이터만으로 ML을 자동화
  - 하이퍼변수 최적화: 적은 GPU 자원을 토대로 데이터 양 자가증식
  - 신경 구조망 탐색: 주어진 데이터 학습에 있어 효율적인 신경망 구조를 자동으로 찾는 기술`,remark:null,image:[]},{index:26,topic:"연합학습",define:`- 다수의 개인 모바일 기기의 데이터로 인공지능 모델을 학습하고 학습된 파라미터를 클라우드 상의 서버로 전송하여 통합한 파라미터를 인공지능 모델 학습에 사용하고 이를 반복하는 방법
 
* 연합학습의 주요 알고리즘
  - FedSGD: 각 단말(엣지, 클라이언트)는 자신이 한번 학습한 파라미터 값을 중앙서버(클라우드)로 전달, 중앙서버는 취합한 모든 클라이언트의 로컬 파라미터 값의 평균 계산하여 글로벌 파라미터를 업데이트(반복)
  - FedAVG: 각 단말이 일정 횟수 k만큼 반복 학습 수행 후 파라미터 값을 서버로 전달하는 방식`,head:`* 연합학습의 보안 및 프라이버시 강화
  - 차등정보보호, 동형암호, 안전한 다자간 계산`,remark:null,image:[]},{index:27,topic:"할루시네이션(Hallucination)",define:`- AI모델이 훈련데이터에 없는 정보를 생성 하거나 잘못된 정보를 생성하는 현상
 
* 원인
  - 데이터부족, 과적합, 잘못된 레이블링, 모호한 상황
 * 대응방안
  - 데이터부족: 추가데이터 수집, 데이터 증강
  - 과적합: 다양한데이터 사용, 정규화
  - 잘못된 레이블링: 정확한 레이블링, 이상치 탐지
  - 모호한 상황: 불확실성 모델링, 앙상블 모델`,head:"",remark:null,image:[]},{index:28,topic:"AI 리터러시(Literacy)",define:`- 개인이 AI기술을 비판적으로 평가할 수 있게 해주는 일련의 역량으로, AI와 효과적으로 의사소통하고 협업하며 온라인, 가정 및 직장에서 AI를 도구로 사용하는 역량
 
* 필요성: AI기술접근성 확대, AI활용역량 향상, AI 윤리준수
* 강화방안
  - 연구: 정책연구, 교육 커리큘럼 개발
  - 교육: 디지털 취약층 교육, 교육자 대상 교육
  - 협력: 국제협력, 민관산학연 협력`,head:`* 글로벌 동향
  - 국내: 디지털 포용 추진
  - 미국: 교육기술처 중심 형평성 증진 교육
  - 영국: 디지털 교육 파이프라인 강화
  - EU: 디지털 교육 실행계획 수립`,remark:null,image:[]},{index:29,topic:"검색 증강 생성 기술 RAG (Retrieval-Augmented Generation)",define:`- 언어모델관점 정의: 대규모 언어 모델에서 질문에 대한 답변이나 텍스트를 만들기 전에 광범위한 문서 집합에서 관련 정보를 질의하고, 이를 이용하여 응답을 생성하는 방법
 
- 환각 해소관점의 정의: 기존 텍스트 생성 모델의 사실적 오류, 문맥 부족, 정보 누락 등의 문제점을 개선하기 위해, 검색 결과를 통해 이러한 문제점을 보완하고 보다 정확하고 풍부한 텍스트를 생성하는 매커니즘
 
* 필요성: 사실적 정확성, 정보의 풍부성, 문맥적 적절성, 정보 누락 방지`,head:"",remark:null,image:[]},{index:30,topic:"검색 증강 생성 기술 RAG (Retrieval-Augmented Generation)",define:`* RAG 모델 3가지 메커니즘
  - 기본(Native) RAG: 검색 모델을 사용 데이터 수집하고 청크로 분할하여 임베딩 후 Vector DB에 저장
  - 고급(Advanced) RAG: 기본RAG의 부족한 점을 개선하기 위해 3단계로 수행하는 매커니즘
  - 모듈형(Modular) RAG: 다양한 모듈과 기능 통합하여 패턴화하고, 시나리오, 요구사항에 맞게 조정 가능한 메커니즘`,head:"* AI레드팀: 시스템 취약점을 일부러 도출 및 에방하여 생성형 AI의 부적절한 답변을 끌어내고 AI 보안을 강력하게 하는 가상의 적으로 설정된 보안팀",remark:null,image:["static/images/cellImage_1036301339_5.jpg"]},{index:31,topic:"벡터 데이터베이스(Vector database)",define:`* ChatGPT의 전두엽
 - 인공지능 결과 저장 최적화. 벡터 형태 저장
 - 방대한 양의 고차원 데이터를 벡터 형태로 최적화하여 보관하고 쿼리하기 위해 특화된 데이터베이스 
 
 - 벡터: 임베딩 기술을 통해 중요한 정보를 유지하면서 저차원 공간으로 변환되는 복잡한 데이터 항목의 수치 표현 
 
 Vector > indexing > vecterDB > Querying > Post Processing
 
* 알고리즘
  - PQ(Product Quantization) : 제품양자화
  - LSH(Locality Sensitive Hashing) : KNN 인덱싱기술
  - HNSW : 벡터간 유사성
 
* 3단락 전략 : ChatGPT 활용사례
  - ChatGPT Plugins + 벡터DB > AI시맨틱 정보검색, 장기메모리 등`,head:`* 특징 
 - 인덱싱 전략을 사용하여 특정 쿼리 벡터와 유사한 벡터 검색 용이 
 - 인공지능에 시멘틱 정보 검색, 장기 메모리 등의 고급 기능 구현 가능
 - 고차원검색, 맞춤형 색인 
 
 * 장점 
 - 효율적 데이터 저장, 관리 및 속도 
 - Large Language Model(LLM)과의 결합 
 - 다양한 분야, 세부 태스크 활용 
 
 * 종류 
 - Pinecone, Chroma, Weaviate, Qdrant 등
 
 * 하이브리드 데이터베이스 = 관계형+벡터 결합`,remark:null,image:["static/images/cellImage_1036301339_6.jpg"]},{index:32,topic:"인공지능 윤리",define:"- 인간성을 구현하기 위해 인공지능의 개발과 활용 전 과정에서 인간의 존엄성, 사회의 공공선, 기술 합목적성 원칙의 3대 원칙과 인권보장, 프라이버시보호, 다양성 존중, 침해금지, 공공성, 연대성, 데이터 관리, 책임성, 안전성, 투명성의 10대 핵심요건을 제시",head:"",remark:null,image:[]},{index:33,topic:"생성형AI가이드윤리 가이드라인",define:`* 안전한 생성형AI의 활용
 - 생성형AI 투명한 활용을 위해 3대기본원칙과 9대핵심요건을 제시한 가이드라인
* 3대기본원칙:사용자중심, 위험예방, 지속가능성
* 9대핵심요건: 이용자검증역량, 책임성, 데이터 권리와 책임, 사용가능성확보, 데이터안전성, AI윤리소양, 공공성, 생태계지속가능성, 보안성`,head:`사위지
 이책데사 안윤 공생보`,remark:null,image:[]},{index:34,topic:"생성형AI 활용 보안가이드라인",define:"- 생성형 AI: 이미지, 비디오, 오디오, 텍스트 등을 포함한 대량의 데이터를 학습하여 사람과 유사한 방식으로 문맥과 의미를 이해하고 새로운 데이터를 자동으로 생성해 주는 기술",head:`* 보안위협 : 잘아아유데플확
 1) 잘못된 정보 
 2) AI 모델 악용 
 3) 유사 AI 모델 서비스 빙자 
 4) 데이터 유출 
 5) 플러그인 취약점 
 6) 확장 프로그램 취약점 
 7) API 취약점`,remark:`* 안전한 활용 가이드라인 
 1) 서비스 사용시 주의사항 
 2) 서비스와의 대화시 주의사항 
 3) AI 모델 플러그인 사용 주의사항 
 4) AI 모델 확장 프로그램 사용 주의사항 
 5) AI 모델 생성기반 공격 대처방안
 
* 사용, 대화, 플러그인, 확장, 대처`,image:[]},{index:35,topic:"AI 신뢰성 인증(CAT)",define:`- 인공지능(AI, Artificial Intelligence)이 인간을 대신해 학습, 추론, 자기 개발 등을 할 경우 발생할 수 있는 다양한 신뢰성(Trustworthiness), 윤리(Ethic) 이슈를 방지하기 위한 인증 제도
  - 한국정보통신기술협회(TTA)가 평가
 
* 인증 대상
  - 지식기반, 자연어 처리, 음성인식, 지능로봇, 컴퓨터비전
 
* 인증항목(요구사항 15개)
  1. 계획 및 설계: 위험관리 계획/수행, 거버넌스, 테스트 계획
  2. 데이터 수집 및 처리: 데이터 활용 상세정보, 데이터 강건성 확보 점검, 데이터 편향 제거
  3. 인공지능 모델 개발: 오픈소스 라이브러리 보안/호환성, 모델편향 제거, 모델공격 방어, 모델명세 및 추론결과 설명
  4. 시스템 구현: 시스템 구현 편향 제거, 안전모드 구현, 사용자 이해도 제고, 추적가능성 및 변경이력 확보`,head:`* 인증절차: 사전교육->검증항목 선별->개발안내서 적용->검인증
 
* 인공지능 신뢰성 프레임워크`,remark:null,image:[]},{index:36,topic:"ㄴ인공지능 신뢰성 제고를 위한 요구사항(TTA)",define:`인공지능 신뢰성 적용 범위 및 세부특성
 - 적용범위 : AI기술이 적용된 제품 및 서비스, AI시스템 개발에 필요한 서비스 기획, 데이터 수집 및 가공, 시스템 통합, 배포 및 모니터링 과정 전체 범위
 - 세부특성 : 견고성, 보안성, 설명가능성, 신뢰성, 안전성, 예측가능성, 제어가능성, 책임성, 투명성, 공정성, 프라이버시, 회복단력성`,head:`인공지능 시스템 신뢰성 15가지 요구사항

위거테추데 이편보편 공설편안 이서`,remark:null,image:[]},{index:37,topic:"인공 일반지능(AGI)과 지능 레벨",define:"- 인간이 할 수 있는 어떠한 지적인 업무도 성공적으로 해낼 수 있는 (가상적인) 기계의 지능, 인공지능 연구의 주요 목표",head:"",remark:null,image:[]},{index:38,topic:"ISO/ IEC 42001",define:`- 조직 내 인공지능 경영시스템(AISM)을 수립, 구현, 유지 및 지속적으로 개선하기 위한 요구사항에 대한 지침을 제공하는 국제 표준
 
- 특징: 인증가능한 유일한 국제 표준, PDCA 라이프사이클`,head:"",remark:null,image:[]},{index:39,topic:"온디바이스AI",define:`* AI전환(AX) 시대의 도래
 서버나 클라우드를 거치지 않고 자체적으로 정보를 수집.연산하는 기술(칩)
 - 인터넷 연결없이 텍스트, 음성 질문, 답변, 이미지생성
 - 이용자 관련 정보가 기기내부에서 처리
 - 이용자 패턴 학습해 개인 맞춤형 서비스 제공
 - 중앙집중형 -> 개인분산형
 
* MS-파이2
* 라마2, 미스트랄7B, 나노2
* 국내-업스테이지의 솔라, 샤피온 X350, 삼성 엑시노스
 
* 본래 있던 기술이었으나 생성형AI가 보편화되면서 다시 부각`,head:`* 기술요소 : 
 (HW)TPU, GPU : 네트워크 연산 최적화
  NPU : 뉴로모픽 기술 활용 
 (SW)경량AI모델 : 모델구조변경, 합성곱필터변경, 모델자동탐색
  AI모델경량화 기술 : 모델압축, 모델압축 자동탐색
 
* 장점
  - 프라이버시보호, 빠른 반응속도, 높은 안정성, 전력소모감소`,remark:null,image:["static/images/cellImage_1036301339_7.jpg"]},{index:40,topic:"sLLM",define:`기존 대형 언어모델에 비해 매개변수 수가 줄어들어 학습 비용과 시간이 절감되지만, 미세조정을 통해 특정 분야에서는 대형 모델과 비슷한 성능을 낼 수 있는 모델
 
  - 인터넷연결: 연결없이 기기자체 기반 데이터 처리
  - 구동환경: 온디바이스 AI
  - 모델: 구글 젬마, MS 파이, 오르카
  - 매개변수: 약 수십억개
  - 컴퓨팅 자원: 적은 활용, 특정 언어영역 특화, 신속 파인튜닝
  - 최적화과정: 프루닝->파인튜닝->양자화`,head:"",remark:null,image:[]},{index:41,topic:"인공신경망 경량화 기술",define:`* 딥러닝 경량화, 딥러닝 모델 경량화 
 - 인공신경망 모델의 크기 증가에 따른 고비용의 HW용량 및 연산량을 줄이기 위해 알고리즘 자체를 효율적인 구조로 설계하거나 모델의 파라미터를 줄이는 기술 
 
* 중요성 
 - 모델 정확도 향상을 위한 크기 중가에 따른 연산량과 메모리 점유율 증가 
 - 모바일 기기, IoT 기기 및 엣지 컴퓨팅 등을 위한 저전력, 저성능 기기에서의 동작 필요`,head:`* 연구동향 
 1) 경량 알고리즘 연구: 구필모
 - 모델 구조 변경 : 파라미터축소, 성능개선(ResNet, DenseNet)
 - 합성곱 필터 변경 : 연산줄임(MobileNet, SuffleNet)
 - 자동 모델 탐색 : 강화학습 통해 최적모델 자동 탐색
 2) 알고리즘 경량화 연구: 압지가탐
 - 모델 압축(DropOut(가지치기), 가중치분해, 가중치공유, 양자화)
 - 지식증류 (다른ML모델의 지식을 전하는 기법)
 - 하드웨어 가속화(GPU)
 - 모델압축 자동탐색`,remark:"모델 : 파이, 알파카, 돌리2.0",image:[]},{index:42,topic:"인공지능 데이터 품질관리 및 지표",define:"- 배경: 인공지능 사업 활성화와 더불어 핵심이 되는 데이터에 대한 품질관리 절차 및 품질관리를 위한 지표 등이 부각",head:`* 인공지능 데이터 품질관리 기준 수립 절차 
 1) 사례분석 
 2) 기준수립, 원칙정의 
 3) 품질지표 정의 
 4) 진단기준 정의 
 5) 진단방법 수립`,remark:`* 품질지표 
 [절차측면]
 - 준비성, 완전성, 유용성 
 [데이터 측면]
 - 적합성, 정확성, 유효성 
 [유효성 성능지표]
 - 분류성능, 탐지성능, 인식성능, 질의응답, 기계번역, 문서요약, 음성인식, 음성합성`,image:[]},{index:43,topic:"AI 디지털 교과서",define:"AI 기반 학생 진단‧분석을 바탕으로 교사‧학부모에게 학생의 객관적인 학습 정보를 제공하고, 개별 학생에게는 학업성취도 및 특성을 고려한 최적의 학습경로와 학생 맞춤 처방 및 지원을 제공하는 교과서",head:`* 주요내용
  - 도입 과목: 25년 수학, 영어, 정보, 국어(특수교육)를 우선 도입하고, 전과목 도입 목표로 28년까지
  - 개발범위: 보충학습과 심화학습
  - 개발방식: 웹표준 개발, SaaS기반 플랫폼 구축
  - 역할분담: 정부와 공공기관 통합저장소 구축, 과목별 디지털 교과서는 민간 개발`,remark:null,image:[]},{index:44,topic:"휴머노이드 로봇",define:`인간의 신체적 특징을 닮은 외형을 지녔으면서 인간과 유사한 동작을 취할 수 있는 로봇
  - 부각배경: 제조원가 하락, 인공지능 기술 혁신 
  - 기술요소
  ㄴ(인지)LiDAR, 카메라, 마이크 센서, 멀티모달 
  ㄴ(추론/의사결정)AI반도체,인공지능 시스템, SW
  ㄴ(동작)액추에이션 시스템(서보모터, 감속기, 제어기, 토크센서, 인코더 등)
  - 활용분야: 산업,의료,서비스,교육,엔터테인먼트
  - 사례: 테슬라 옵티머스, 엔지니어드아츠 아메카, 오픈AI 피큐어01, 휴보, 아시모`,head:"* 크게 3가지 유형으로 구분",remark:null,image:["static/images/cellImage_1036301339_8.jpg"]},{index:45,topic:"물리AI",define:`물리적인 세계를 이해하고 그 안에서 작용하는 힘과 에너지를 모델링하여 예측하고 제어하는 인공지능
 
 - 인공지능 기술을 실제 물리적 장치나 시스템에 통합하여, 자율적으로 행동하고 환경과 상호작용 할 수 있는 능력을 갖춘 인공지능`,head:"",remark:null,image:[]},{index:46,topic:"임보디드AI (Embodied AI)",define:`물리 환경과 상호작용 하고 학습할 수 있는 인공지능
 - 인공지능 시스템이 물리적 몸을 가지고 환경과 상호작용
 - 휴머노이드(신체) X LLM*LMM(뇌) = 임보디드AI
 - 임보디드AI는 물리적AI의 일부분으로 물리적 환경에서 자율적으로 활동하는 인공지능 중에서 특히 물리적 몸을 가진 시스템을 포함하는 개념
 * 휴머노이드는 대표적인 임보디드 AI로 구분`,head:"",remark:null,image:["static/images/cellImage_1036301339_9.jpg","static/images/cellImage_1036301339_10.jpg"]},{index:47,topic:"AI 쳇봇",define:`- AI와 NLP 이용 인간의 대화를 시뮬레이션함으로써 고객의 질문을 이해하고 자동으로 응답하는 컴퓨터 프로그램
 
* 주요기술 : NLP, NLU(자연어이해), LLM, ML, 딥러닝`,head:`* 종류
 - 규칙기반, 검색, 생성형, AI비서형, 소셜, 작업지향
 
* 보안위협
 - 피싱메일 및 악성코드생성, 민감정보 유출 및 결과물 오남용, 인공지능에 대한 공격`,remark:`* 대응방안
 - 기술보안 대책강화
 - 보안교육강화, 지속적 테스트
 - 보안 프레임워크 마련
 - 법령준수 및 보안사고 책임강화
 - R&D투자, 인증제도마련`,image:[]},{index:48,topic:"ㄴ챗봇 윤리 가이드라인",define:"인간과 교감하며 대화하는 인공지능 챗봇 서비스의 개발과 운영, 활용 등의 과정에서 챗봇이 인간과 공존하며 인간에게 도움이 되는 방식으로 활용될수 있도록 하는 가이드라인",head:`* 배경 및 목적
 - 챗봇에 지나친 의존과 잘못된 활용으로 인한 정신적, 경제적 피해 예방
 - 과도한 챗봇 이용에 따른 사회적 고립이나 단절로 사회 공동체 붕괴 우려 해소`,remark:`* 5대원칙(인프다책투)
 인간의 존엄성 및 권리 존중 원칙
 프라이버시 보호 및 정보보안 원칙
 다양성 존중 원칙
 투명성 원칙
 책임 원칙
 
* 개발자, 운영자, 사용자 준수사항`,image:[]},{index:49,topic:"휴먼인더루프",define:`- 사람이 참여하는 AI
- 전문지식을 가진 전문가 인간이 기계에 인사이트를 부여하고 기계는 인간이 탐내기 힘든 벌크 데이터를 분석하는 체계`,head:"* 연구동향 : HITL SW, 데이터로봇HITL, 아마존증강AI",remark:null,image:[]},{index:50,topic:"RPA와AI OCR",define:"문서스캔->AI-OCR보안->데이터분류.보관활용->RPA적용",head:"",remark:null,image:[]},{index:51,topic:"AIoT(Artificial Intelligence of Things)",define:"- 사물인터넷과 인공지능을 융합하여 프라이버시, 지연, 시스템 불안정성, 추가 비용 등의 이슈를 해결한 기술",head:`* AIoT 특성 
 - 실시간 의사결정 
 - 데이터 전송비용 감소 
 - 위험관리 전략 개선`,remark:"* 모든 영역에서 AI + IoT 결합, 발전",image:[]},{index:52,topic:"ABIoT(Artificial Blockchain Intelligence of Things)",define:`- AIoT와 블록체인 기술의 융합 
- AIoT 기술의 보안 문제를 해결하기 위해, 분산원장을 통해 해킹을 막는 블록체인 기술을 융합한 신기술`,head:`* ABIoT 사례 
 - 서울시의 블록체인 기반 위험 구조물 안전진단 플랫폼 
 - 자동차와 충전시스템 간 거래가 자동으로 블록체인에 저장 및 결제 
 - 스마트홈 사물인터넷 자동화 및 제어를 위한 보안솔루션`,remark:null,image:[]},{index:53,topic:"인공지능 반도체",define:`기존 반도체 아키텍처에 기반한 인공지능 연산 전용 가속 프로세스
- FPGA, ASIC, GPU 기술을 기반한 별도 칩 혹은 SoC 탑재 유닛형태로 CPU와 연동하여 작동
- 초저전력의 대규모 병렬연산 가능. On-chip에서 학습/추론 효과적 처리
 
* 반도체 유형
  - 기존 반도체 진화형: CPU, GPU, FPGA
  - 1세대 AI 반도체: ASIC/ASSP
  - 2세대 AI 반도체: 뉴로모픽 반도체
 
* 개발동향
  - (국외)인텔 로이히(Loihi), 구글 TPU, MS HPU, 화웨이 Kirin 1020
  - (국내)삼성전자 엑시노스9, SK하이닉스`,head:"",remark:null,image:[]},{index:54,topic:"인공지능 반도체 칩렛",define:`프로세서를 구성하는 작은 구성 단위, IP(Intellectual property) 블록 단위로, 각기 다른 기능을 수행하는 반도체를 하나의 패키지로 만드는 기술
- 배경: Reticle Size제약 성능이슈, Chip Size 증가로 수율 저하
- 장점: 수율향상, 빠른설계, 이종칩결합, 비용감소
- TSV 기법은 HBM에 사용
- 칩렛 상호 연동을 위해 UCIe의 프로토콜이 규격화`,head:`* 국내 기업 움직임
- 넥스트칩: 차량용 ADAS 적용 검토
- 라벨리온: AI반도체  리벨-퀴드 적용
- 퓨리오사AI: 차세대 NPU에 적용`,remark:null,image:[]},{index:55,topic:"메모리 중심 컴퓨팅",define:`대용량 데이터의 고속처리를 위해 데이터 처리 성능 및 용량 한계 극복을 위한 데이터 중심 컴퓨팅
 - 엄청난 SCM 메모리 풀을 다수의 서버가 공유하는 구조
 - 기존의 CPU들의 비효율적인 메모리 접근 문제가 해결
 - 스케일아웃(scale-out)이 용이한 시스템 구성 
 
* 기술동향
  ①SCM 하드웨어 개발: 삼성, SK하이닉스, 마이크론, 인텔 
  ②메모리 패브릭 네트워크 프로토콜 및 하드웨어 개발
  - Gen-Z, OpenCAPI, CCIX 프로토콜
  ③메모리 중심 컴퓨팅 OS 및 소프트웨어 개발
  - HPE 社의 경우 “The Machine"`,head:"",remark:null,image:[]},{index:56,topic:"PIM(Processing In Memory)",define:`하나의 칩 내부에 메모리와 프로세서 연산기를 집적한 차세대 반도체
 
 - 메모리 영역 내 데이터 연산이 가능해져 CPU/GPU와 메모리 간 데이터 이동 최소화하여 속도 개선 -> 인공지능 성능 향상
 
 - 종류: Processing In Memory, Process near memory, In-memory PIM`,head:`- Processing In Memory: 하나의 메모리 다이(die)에 메모리 부분과 연산용 회로가 함께 집적
 
  - Process near memory: 서로 다른 메모리 다이에 메모리와 연산 로직이 따로 구현되어 다이 간 연결
 
 - In-memory PIM: 하나의 다이 안에 메모리와 연산 소자가 구분없이 뒤섞인 구조`,remark:null,image:[]},{index:57,topic:"HBM(고대역폭 메모리)",define:`고성능 데이터 처리를 위해 DRAM 적층화 및 TSV 배선 기반 데이터 이동 병목 현상을 해소한 DRAM 적층형 고성능 메모리
 
* 적용기법
  - TSV (Through Silicon Via): 메모리 칩을 수직으로 쌓고 칩 사이에 얇은 금속 터널을 만들어 데이터 전송 속도를 높이는 기법
  - CoW (Chip on Wafer): 웨이퍼 위에 칩을 붙이는 기법
  - TCB (Thermal Compression Bonding): TSV가 적용된 얇은 칩을 정밀하게 쌓아 올리는 패키징 기법

* 활용분야
  - 고성능 그래픽: 고사양 게임, 가상현실 (VR), 증강현실(AR)등
  - 인공지능: 딥 러닝, 머신 러닝 등
  - 고성능 컴퓨팅: 데이터 분석, 과학 계산 등`,head:`* 구성요소
  - 메모리 적층화: TSV, DRAM die, Base(Logic) die, Micro Bump
  - 칩셋 구성: SoC, PHY, Silicon Interposer, Package Substrate`,remark:null,image:["static/images/cellImage_1036301339_11.jpg"]},{index:58,topic:"CXL (Compute eXpress Link, 컴퓨트 익스프레스 링크)",define:`중앙처리장치(CPU)와 메모리, 그래픽 처리장치(GPU), 저장장치 등을 보다 효율적으로 활용할 수 있게 해 주는 인터페이스
 
 - 인터페이스를 하나로 통합해 각 장치를 직접 연결하고 메모리를 공유, 거대한 공용 메모리 풀(pool)을 형성
 
* Version
  - CXL Type 1. 장치: CXL.io, CXL.cache
  - CXL Type 2. 장치: CXL.io, CXL.cache, CXL.mem
  - CXL Type 3. 장치: CXL.io, CXL.mem`,head:"",remark:null,image:["static/images/cellImage_1036301339_12.jpg"]},{index:59,topic:"Redis",define:`BSD기반 오픈소스 NoSQL 중 하나로 Key/Value Store 특징을 자기는 In-Memory DB. 
 - 운영 중인 웹 서버에서 Key-Value 형태의 데이터 타입을 처리해야 하고 I/O가 빈번히 발생해 다른 저장 방식을 사용하면 효율이 떨어지는 경우에 사용함
 
* 특징
  - Pub/sub 모델 지원, Sharding 용량 확장, Persistence, 데이터 자동삭제 정책 보유, 컬렉션 지원, 복제(Replication), 빠른 속도`,head:`* 데이터 저장 방식
  - Snapshotting(RDB) 방식: 순간적으로 메모리에 있는 내용 전체를 디스크에 옮겨 담는 방식
  - AOF(Append On File) 방식: Redis의 모든 write/update 연산 자체를 log 파일에 기록하는 형태`,remark:null,image:[]},{index:60,topic:"Cassandra",define:`대용량 자료의 저장과 처리를 목적으로 하는 Key-Value 기반의 높은 가용성을 가지는 NoSQL 
 
 - 특징: 분산모델기반, SPoF 없음, Column기반`,head:`- 장점: 분산화와 집중화, 탄력적인 확장성, 고가용성과 결함 허용
 - 단점: 높은 진입장벽, 복잡한 조건 검색 불가, 데이터 입력 시 자동화 처리가 어려움`,remark:null,image:[]},{index:61,topic:"Mongo DB",define:`저장 되어 지는 형식이 정해져 있으나 구조에 대한 유연성을 보장하는 NoSQL
 - (다큐먼트 저장소에 저장하는 형태는 보통 XML,JSON,BSON형태(저장 형태), Replication제공
 
 - 특징: 키- 값 저장(Documented – Oriented DB), 강력한 쿼리, 빠른 처리속도, 확장 용이성, 고가용성(HA), 비정형처리, 오픈소스`,head:"",remark:null,image:[]},{index:62,topic:"Apache Kafka",define:`고성능 데이터 파이프라인, 스트리밍 애널리틱스, 데이터 통합, 미션 크리티컬 애플리케이션에 사용하는 기술 스택
 - 2011년 링크드인(LinkedIn)에서 개발된 이벤트 스트리밍에서 널리 쓰이는 플랫폼
 
* 구성요소
  - 메시지처리: 프로듀서, 브로커, 컨슈머
  - 모니터링: 주키퍼
  - CoreAPI: Producer API, Consumer API, Stream API, Connector API`,head:"",remark:null,image:["static/images/cellImage_1036301339_13.jpg","static/images/cellImage_1036301339_14.jpg"]},{index:63,topic:"Apache Kafka",define:`- 분산메시징 시스템
- 고성능 데이터 파이프라인, 스트리밍 애널리틱스, 데이터 통합, 미션 크리티컬 애플리케이션에 사용하는 기술 스택
- Pub/Sub 모델, Message 큐`,head:`* 카프카 핵심 API
Admin API: 토픽, 브로커, 객체 관리
Producer API: 이벤트 스트림 게시
Consumer API: 토픽 구독, 처리
Kafka Connect API: 데이터 커넥터 구축

* 카프카 구성요소
producer 
consumer
broker, topic
zookeeper`,remark:`* 데이터모델 구성요소
  - Topic: 데이터가 들어가는 장소
  - partition: 토픽은 여러개의 파티션으로 구성
  - offset: 파티션마다 메시지 저장 위치
  - 가용성유지: 리플리케이션`,image:[]},{index:64,topic:"MSA 서킷브레이커 패턴(Circuit Breaker Pattern)",define:`- 장애에 강한 MSA 서비스 구현
- 장애를 감지하고 일시적 외부시스템 장애 또는 예상치 못한 시스템 장애가 지속적으로 반복되는 것을 방지하는 로직을 캡슐화 한 디자인 패턴 
- 장애가 전파되는 MSA 패턴의 구조적 한계 개선`,head:`* 회로상태 
 - close: 회로차단기의 기본상태
 - open: 대기시간만큼 회로차단이 열린 상태
 - half open: 새로운 호출들이 정상적이라 면 닫힘 상태로 변경하고 임계값을 초기화, 실패하면 다시 열린상태로 변경`,remark:`* 회로제어 
 - 실패율 임계값: 비정상 처리율에 대한 임계치 
 - 지속시간: 회로가 열림상태를 유지하는 시간
 
* 메시징 처리 
 - Fall-back`,image:[]},{index:65,topic:"MSA SAGA Pattern",define:`- Application을 통한 트랜잭션 관리 
 - 마이크로서비스들끼리 이벤트를 주고받아 특정 마이크로서비스에서 작업이 실패하면 이전까지의 작업이 완료된 마이크로서비스들에게 보상 이벤트를 소싱함으로써 분산 환경에서 원자성을 보장하는 패턴 
  
* 특징 
 - 트랜잭션 관리 주체가 Application에 있음`,head:`* saga 패턴 유형 설명 
 1) Choreography based SAGA 패턴 
 - 각 서비스 간 이벤트를 주고 받는 event Pub/Sub 방식 
 2) Orchestrator based SAGA 패턴 
 - 오케스트레이터를 중심으로 한 invoke/reply 방식 
 - 트랜잭션 실패시 보상이벤트를 호출하여 데이터 정합성을 맞춤`,remark:null,image:[]},{index:66,topic:"이벤트 드리븐 아키텍쳐 (Event Driven Architecture)",define:`MSA가 적용된 시스템을 보완하는 아키텍쳐로 분산된 시스템에서 이벤트를 생성(발행)하고 발행된 이벤트를 수신자에게 전송하는 구조로 수신자는 그 이벤트를 처리하는 방식의 아키텍처
* 구성요소
  - Event Generator (Publisher, Producer, Creater)
  - Event Channel (Bus)
  - Event Processing Engine (Consumer, Processor)`,head:`* 동작방식
  - Message 생성 (Publish/Subscribe): 이벤트가 생성되면 Subscriber(수신자)에게 전달
  - Event Source: Event Processor에게 이벤트를 전달하는 역할
  - Event Processor: 수신된 이벤트에 대한 여러 Action을 수행
  - Event Consumer: 이벤트에 대한 처리, 실질적인 Biz Logic을 수행`,remark:null,image:[]},{index:67,topic:"하이퍼바이저",define:"가상화 클라우드 환경: 호스트 PC의 하드웨어 자원을 응용 프로그램이 가상화된 환경에서 사용하도록 하이퍼바이저라는 미들웨어 기반으로 Guest OS를 지원하는 환경",head:`* 유형
  - Type I (Bare-metal/Native): Host OS가 따로없어 하이퍼바이저가 해당 하드웨어에서 직접실행 
  - Type II (Hosted): Host OS가 실행되며, 호스트 OS 에 의해 운영체제가 관리되는 구조
 
* 기술: VM웨어, KVM, 젠, 하이퍼-V`,remark:null,image:[]},{index:68,topic:"도커",define:`하이퍼바이저(hypervisor)없이 리눅스 컨테이너(Linux Container, LXC) 기술을 바탕으로 애플리케이션을 격리된 상태에서 실행하는 가상화 솔루션 
 
* 특징
 1) 호스트 운영체제 공유 2) 컨테이너 내 샌드박스 격리  3) 무중단 배포 4) 실시간 프로비저닝`,head:`* 구성요소: 이미지, 컨테이너, LXC(Linux Container), 도커 엔진, 도커 허브 
 
* 오케스트레이션 도구 유형
  - 도커 스웜 모드, 쿠버네티스, 메소스피어, 마라톤`,remark:null,image:[]},{index:69,topic:"유니커널",define:`클라우드 운용에서 민첩성과 보안 위해 개별 응용 프로그램만의 독립적인 커널을 지원하는 환경
 
 - 필요한 운영체제의 기능을 라이브러리 형태로 포함, 이미지 자체가 해당 커널 포함`,head:`* 기술동향
  - OSv, MirageOS, includeOS, Rumprun`,remark:null,image:[]},{index:70,topic:"컨테이너 관리 자동화 - 쿠버네티스",define:`컨테이너의 배포, 관리, 확장, 네트워킹을 자동화 하는 기술
* 쿠버네티스 : YAML 기반 Pod내 컨테이너들로 구성된 중대형 시스템
 
* 헬스체크 기능
 - Liveness Prob : 가동여부 주기적 체크
 - Readness Prob : 서비스 불가한 경우 마킹`,head:`kubectl, kubelet, kube-proxy
* Pod : 배포단위
 오케스트레이션 : 서비스 디스커버리, 로드밸런싱, 스케쥴링, 클러스터링`,remark:null,image:["static/images/cellImage_1036301339_15.jpg"]},{index:71,topic:"클라우드 네이티브,클라우드 네이티브 애플리케이션",define:`MSA 기반으로 Application 구조를 업무에 특화된 독립단위로 개발하고, 컨테이너 단위로 생성하여 Cloud 환경에서 관리하고 배포할 수 있는 개발방법론

* 기술요소
- 조직/프로세스 측면: DevOps, Agile, CI/CD
- 아키텍처/인터페이스 측면: MSA, API
- 가상화측면: 컨테이너,Orchestration, Multitenancy`,head:"",remark:null,image:[]},{index:72,topic:"SaaS(Software as a Service)",define:`SW 및 관련 데이터는 중앙에 호스팅 되고 사용자는 웹 브라우저 등의 클라이언트를 통해 접속하는 형태의 소프트웨어 전달 모델

* 특징 
- 응용 소프트웨어 제공
- 구독형태 과금
- 사용자 편의성, 확장성 유연성 
- 활용 : 클라우드 스토리지 서비스, 협업툴, 구독형태 상품 개발`,head:`* 대표 서비스: SPA의 CRM, ERP S/W, Microsoft Office 365, 슬랙(Slack)
드롭박스(Dropbox)

* 공공부문 SaaS 이용 가이드라인 단계
1) 공공부문 SaaS 이용 기획
2) 공공부문 SaaS 이용 준비
3) SaaS 이용 계약 및 이용
4) 공공부문 SaaS 이용 종료`,remark:null,image:[]},{index:73,topic:"소버린 클라우드",define:`현지 법률과 규정을 준수하여 데이터 접근이 이루어지도록 설계하고 구축된 클라우드 컴퓨팅 아키텍처

* 등장배경: 데이터 주권 문제
* 주요기능
- 데이터 소유권 강화
- 강화된 보안
- 높은 서비스 가용성
- 국가 또는 조직의 특정 요구 충족`,head:`* 구축단계
1) 암호화 키 도입을 통한 데이터 통제권
2) 자국 기업의 클라우드 운영
3) 국가 클라우드 기술 자주성 확보

* 사례: AWS 디지털 주권 서약, 오라클 독일, 스페인에 유렵연합용 소버린 클라우드 리전설립`,remark:null,image:[]},{index:74,topic:"매터(Matter)",define:`- IP기술을 기반으로 하는 개방형 스마트홈 연동 표준 
- 23년 7월 현재 1.1
- 목적: 단순성, 상호연동성, 신뢰성, 안전성`,head:`* 매터 특성 
 - 멀티어드민: 동일 디바이스 ID로 여러 스마트홈 플랫폼에 동시 등록 
 - 로컬 제어: 디바이스 상태 확인 및 제어를 로컬에서 진행가능`,remark:`* 매터 데이터 모델 
 - 엔드포인트: 논리적으로 구분되는 디바이스 
 - 클러스터: 엔트포인트의 특정한 기능 
 - 어트리뷰트: 클러스터의 상태를 나타내는데 사용되는 것(읽기, 쓰기, 보고)`,image:[]},{index:75,topic:"매터(Matter)",define:"",head:"",remark:null,image:["static/images/cellImage_1036301339_16.jpg","static/images/cellImage_1036301339_17.jpg"]},{index:76,topic:"디지털권리장전",define:`* 디지털시대 신질서 마련
* 정의 : 새로운 디지털 질서 정립의 기본방향을 담은 헌장
* 목적 : 디지털 심화시대 국가적 차원의 원칙과 기준을 제시하고 글로벌을 리드할수 있는 보편적 디지털 질서 규범의 기본방향 마련
 
 - 디플정 핵심 사업
 - 기본5개, 핵심 23가지 외우기`,head:`* 기본원칙(자공안혁증)
 1. 자유와 권리보장(접표다개디근)
  - 접근, 표현, 다양성, 개인정보 접근/통제, 디지털 대체수단, 디지털 근로/휴식 보장 
 2. 공정한 접근과 기회의 균등(공자리데사)
  - 공정경쟁, 자산보호, 리터러시 향상, 데이터 접근보장, 사회안정망강화
 3. 안전과 신뢰의 확보(개위프환아)
  - 윤리적개발과사용, 위험대응, 프라이버시보호, 환경조성, 아동/청소년보호
 4. 디지털 혁신의 촉진(혁규혁갈)
  - 혁신활동 자유, 규제 개선, 혁신지원, 갈등조정
 5. 인류후생의 증진(지격협)
  - 지속가능디지털사회, 국가간 디지털 격차해소, 국제규범위한 협력
* 적용방안 : 개인정보보호, 공공성, 디지털역기능, 보안
 
 자유, 공정, 안전, 혁신, 증진`,remark:`* 디지털권리장전 적용방안
  - 개인정보보호법 개정사항 적극 반영
  - 공공데이터 활용 활성화
  - 디지털 역기능 해소
  - 보안위협 대비 선제적 대응`,image:[]},{index:77,topic:"디지털안전3법",define:`데이터센터 안전성, 생존성
 디지털위기관리 기반구축
 디지털서비스 대응력, 복원력
 
* 구현효과
 - 과기정통부 사전예고, 주요시설 관리강화, 협력체계구축, 통합운영체계 마련`,head:`방정전
 - 방송통신발전기본법 : 3개월평균 이용자수 1000만명, 전산실 바닥면적 22500, 수전설비용량40MW, 매출100억이상
 - 정보통신망법 : 전산실 바닥면적500m이상, 매출액 및 이용자수 기준 보호조치 의무 적용
 - 전기통신사업법 : 시행령 중복규정 삭제, 기존시행령 상향입법`,remark:`- 방송통신발전기본법 : 국민생활에 영향이 큰 사업자 포함, 전산실 바닥면적과 수전설비의 용량을 고려해 재난관리 대상 선정
 - 정보통신망법 : 배터리모니터링시스템(BMS) 개선, UPS에 배터리 연결 차단 체계 설치, 배터리 랙간 간격 0.8~1m확보`,image:[]},{index:78,topic:"디지털시장법(DMA)",define:`기술산업 내 공정한 경쟁과 엄격한 개인정보보호를 목표에 두고 고안된 법안, 빅테크 기업이 투명하게 경영하고 사용자 데이터를 독점하지 못하도록 규제하는 법안
* 게이트 키퍼: 대형 온라인 플랫폼
- 알파벳, 아마존, 애플, 메타, MS, 바이트댄스(틱톡)
* 규제(준수)사항
- 제3자 기업의 공정한 엑세스 보장
- 광고주 및 퍼블리셔에 데이터 제공
- 자사서비스 노출 우대 금지
- 자체 서비스/플랫폼 자료 공유 금지`,head:"",remark:null,image:[]},{index:79,topic:"디지털서비스법(DSA)",define:`온라인 플랫폼 서비스 제공자의 정보서비스에 관한 투명성을 강화하고, 서비스 이용자의 개인정보를 적극 보호하기 위해 유럽의회에서 시행한 법률 
* 온라인 플랫폼 서비스: 소셜미디어(SNS,미디어 공유/검색엔진등)
* 주요내용
1. 불법 콘텐츠 삭제 2. 투명성 강화 3. 대규모 온라인 플랫폼에 대한 규제 강화`,head:"",remark:null,image:[]},{index:80,topic:"인공지능법(AI Act)",define:`인간 중심적이고 신뢰할 수 있는 인공지능 활용을 촉진하며, 인간의 건강, 안전, 기본권을 보장하는 데에 목적을 둔 AI 규제법안
* 배경: AI 관련 거버넌스 구축 필요, 안전한 AI 생태계 조성
* 특징: 
- 유럽 인공지능 위원회 수립
- 특정 유형 AI 시스템 금지
- 엄격한 생체 인증 정보 관리
- AI 시스템의 위험도 분류(4단계)
 ㄴ 저위험->제한적 위험->고위험->수용불가능한 위험
- 범용 AI(GPAI) 특별관리`,head:`* 범용 AI(GPAI:General Purpose AI) 관련 조항
- GPAI 분류
- GPAI 제공자 의무
- 시스템 위험이 있는 GPAI 선정방법`,remark:null,image:[]},{index:81,topic:"데이터 품질인증",define:`데이터내용, 데이터 구조를 포함한 관리체계를 진단하고 수준을 평가해 품질을 인증하는 제도
* 대상
 - 데이터내용 : 정형, 비정형비정형
 - 데이터구조 : 개논물 데이터 모델
 - 데이터관리체계 : 관리원칙, 업무기능, 조직, 프로세스, 제도`,head:`* 인증종목
 - 데이터 내용 인증, 데이터 관리체계 인증
* 품질기준(정일유접적보)
 - 완전성, 일관성, 보안성, 접근성, 다양성, 유효성, 정확성, 유용성, 적시성, 유일성`,remark:null,image:[]},{index:82,topic:"데이터 가치평가",define:`기업등이 보유하고 있는 데이터의 경제적 가치를 시장, 수익, 원가접근법 중 가능한 기법을 사용하여 평가하는 제도(데이터산업법 제14조)
* 평가기법: 시장접근법, 수익접근법, 원가접근법
* 운영절차:
1) 과기부 평가기관 지정공고, 기관지정
2) 평가신청 접수
3) 평가기관 가치평가 수행
4) 평가기관 평가결과서 작성`,head:`* 활용방안
- 데이터 담보권 설정, 투자유치
- 데이터 매매, 라이선스 가격 결정
- 기업 가치 증진, 장기 경영전략 수립`,remark:null,image:[]},{index:83,topic:"디지털 플랫폼 정부(디플정,DPG)",define:`- 모든 데이터가 연결되는 디지털 플랫폼 위에서 국민, 기업, 정부가 함께 사회문제를 해결하고, 새로운 가치를 창출하는 정부
 
* 4가지 추진과제 (국원민플)
 1) 오직 국민을 위한 정부 
 - 하나의 범정부 통합서비스 창구 구축 
 - AI 혜택 알리미 구현
 2) 똑똑한 원팀 정부 
 - 기관 간 데이터 공유/활용 확대 
 - 정부 전용 초거대 AI 도입 
 - DGP허브 구축`,head:`3) 민관이 함께 성장하는 플랫폼 
 - 데이터 경제 생태계를 조성
 - 거브테크(GovTech) 산업 확대 
 - 서비스형 소프트웨어(SaaS) 기업 육성 확대 
 4) 믿고 안심할 수 있는 플랫폼 정부 
 - 마이데이터 유통체계 확대
 - 제로트러스트 기반 보안 체계 도입`,remark:`* 기술요소 
 [통합플랫폼]
 - 빅데이터 플랫폼, 공공데이터 포털, RPA, RDA 
 [맞춤형서비스]
 - 초거대AI, 메타버스, 국민집사로봇 
 [협업 플랫폼]
 - 5G, 공공클라우드, OpenAPI
 [안전중심]
 - 제로트러스트, 블록체인, SOAR`,image:[]},{index:84,topic:"마이데이터",define:`정보주체를 중심으로 산재된 개인데이터를 한 곳에 모아 개인이 직접 열람하고 저장 하는 등 통합 관리하고 활용하는 서비스
* 개인정보 자기결정권, 전송요구권 행사
* 이용절차
- 전송요구->본인인증->정보전송* 
* 문제점
- 금융자산 일괄조회,상세내역 미제공
- 오프라인 영업, 부수업무 제한
- 이용자 동의/철회 번거로움
- 제3자 정보 및 장기미사용자 정보유출 우려`,head:`*마이데이터 2.0 '24.4월 발표
* 주요내용
- 마이데이터 정보확대: 
  전체 금융자산 조회, 결제상세정보 제공
- 마이데이터 영업활성화:
 오프라인 가입조회, 겸업, 부수업무 유연화
- 이용자 편의 제고:
어카운트인포 연계, 동의절차 간소화 등`,remark:null,image:[]},{index:85,topic:"개인정보보호법 시행령 개정 내용(23.9)",define:`- 23.9.15 국민의 실질적 권익보호를 강화하고 온오프라인으로 이원화되었던 개인정보처리기준을 디지털 환경에 맞게 일원화 한 개인정보보호법의 상세한 세부규정
 
* 국민의 권익보호, 영상정보처리기기 운영기준 개선, 개인정보 국외이전 요건 다양화`,head:`- 개인정보의 국외이전 분야 전문위원회의 설치
 - 개인정보의 이용.제공 내역 통지 : 정보주체에게 통지
 - 아동의 개인정보 보호에 관한 사항 : 개인정보동의방법 구체화
 - 이동형 영상정보처리 기기의 운영 : 필요한 경우 규정
 - 개인정보의 국외 이전 중지 명령의 기준 및 이의신청
 - 공공기관의 개인정보 안전성 보호조치
 - 개인정보 처리방침의 평가대상 및 절차
 - 개인정보 유출의 통지
 - 개인정보 유출 등의 신고`,remark:"전통아이국공평통신",image:[]},{index:86,topic:"PETs",define:`- 프라이버시보호모델:KLT
- 연합학습
- 재현데이터(합성테이터):GAN,차등정보보호,베이지안최적화
- 동형암호화
- PPDM: 프라이버시 보존 데이터 마이닝, 랜덤, 압축, 교란`,head:"프연재동피",remark:null,image:[]},{index:87,topic:"ㄴ프라이버시 보호모델",define:"K-익명성(연결공격), L-다양성(동질성,배경지식공격), T-근접성(유사성,쏠림공격)",head:"",remark:null,image:[]},{index:88,topic:"ㄴ연합학습",define:`사용자기기에서 학습하는 On-Device방식을 통해 생성된 모델을 중앙에서 취합하는 모델
 - 개인정보 제외한 결과만 전송되어 안전
 - 유형 : 데이터센터 분산학습, 크로스-사일로 연합학습, 크로스-디바이스 연합학습`,head:"",remark:null,image:["static/images/cellImage_1036301339_18.jpg"]},{index:89,topic:"ㄴ재현데이터(합성데이터)",define:`원본의 성질을 유지한채 개인정보 특성을 분석하여 새로운 데이터를 생성하는 기법
 - 유형 : 완전(전체), 부분(민감정보만), 복합(일부변수 재현+실제데이터->또다른 일부변수)
 - 기법 : 베이지안 최적화, ML, 차등정보보호
 
 * 재현데이터 생성도구
 - PopGen, MoSeS, Synthia, VirtualBelgium`,head:"원본>합성데이터기법>합성데이터생성>유용성>익명성평가>활용",remark:null,image:["static/images/cellImage_1036301339_19.jpg"]},{index:90,topic:"ㄴ재현데이터(합성데이터)",define:"",head:"",remark:null,image:["static/images/cellImage_1036301339_20.jpg","static/images/cellImage_1036301339_21.jpg","static/images/cellImage_1036301339_22.jpg"]},{index:91,topic:"ㄴ동형암호화",define:`암호화된 데이터를 복호화없이 연산하여 암호화된 상태로 데이터 분석이 가능하도록 지원하는 차세대 암호기술
 - 유형 : 부분(한가지 연산만), 준동형(연산횟수제한), 완전동형(무제한)`,head:"",remark:null,image:[]},{index:92,topic:"ㄴPPDM",define:`프라이버시 보존 데이터 마이닝
 - 개인정보를 공개하지 않은 상태에서 통계적 처리나 기계학습에 사용될수 있도록 데이터의 함축적인 지식이나 패턴을 찾아내는기술`,head:`- 데이터 + 노이즈추가
- 구분 : 랜덤화된 응답기반, 압축기반, 교란기반, 차등정보보호`,remark:null,image:[]},{index:93,topic:"제로트러스트가이드라인",define:`6대원칙:무신뢰, 중앙집중접근제어, 사용자기기인증관리, 자원분류 세밀 접근제어, 논리경계생성, 모니터링/로그/신뢰지속성검증
1.인증체계강화 2.네트워크 세그멘테이션 3.SW정의경계(SDP)`,head:`무중사자논모
인세소`,remark:null,image:["static/images/cellImage_1036301339_23.jpg"]},{index:94,topic:"CBDC(중앙은행 디지털 화폐)",define:`* 실시간 화폐이동 확인 가능
 - 전자적 형태로 중앙은행에서 발행되는 디지털 화폐
 - CBDC 결재, 지갑관리, 트랜잭션 간소화, 기부모델 아이디어 제시 
 - 기대효과 : 화폐발권비용 감소, 실시간 화폐이동 데이터 활용, 화폐 위변조, 자금세탁 방지
 
* 단일원장방식(중앙집중식)
* 분산원장방식: 허가형, 비허가형
* 블록체인 합의 알고리즘
* 스마트컨트렉트
 
* 시중은행간 트랜잭션 절차 간소화, CBDC 지갑관리, CBDC 활용 기부모델`,head:"",remark:`* CBDC가 촉발한 Web3.0전환가속
 - 현금이용감소세
 - 디지털 전환 가속화
 - 금융-경제 여건 빠른 변경 배경
 
* 활용성 테스트`,image:["static/images/cellImage_1036301339_24.jpg"]},{index:95,topic:"ㄴCBDC 동향",define:"",head:`* 최근 범용(Retail)CBDC에서 기관(WholeSale)CBDC 움직임 보임
* CBDC 활용성 테스트 : 혁신적 서비스 활용사례 테스트, 디지털 통화 생태계 조성 목적
 - 비잔틴합의 알고리즘 사용
 
 1.예금토큰
 2.CBDC를 담보로 별도 발행하는 디지털통화
 3.특수목적 디지털통화 : 
 일상적 거래용도 아직 불필요, 테스트 필요
  * 경제 파급효과 고려 : 기술적, 법제도적 측면, 국제 공동연구`,remark:null,image:["static/images/cellImage_1036301339_25.jpg"]},{index:96,topic:"ㄴCBDC 실거래 테스트",define:`한국은행이 발행한 디지털 화폐를 실제 상점에서 사용하는 테스트가 올해 12월 진행
* 참여기관: 농협은행 등 시중은행, 하나로마트 등 가맹점
* 시스템구축: 은행들은 CBDC 사용 시스템 구축, 은행, 가맹점, 한국은행을 연결하는 전산망 구축 진행
* 국제협력: 국제결제은행(BIS) 과 함께 협력`,head:`* 테스트의 의미
- 디지털 화폐시대 준비
- 금융시스템 혁신
- 국제협력 강화`,remark:null,image:[]},{index:97,topic:"증권형 토큰(STO, Security Token)",define:`* 블록체인 기술 활용 토큰형태 증권
 - 실물(부동산, 지적재산권 등) 또는 금융(주식, 채권 등) 자산을 블록체인 기반의 토큰에 연동한 디지털 자산 
 - 해당 암호화폐를 발행한 회사의 자산에 대한 소유권을 가진 토큰형태로 발행하는 증권
 
* 장점 : 높은 유동성, 분할소유, 중간회수시장 형성, 프로그래밍 가능성, 투자자 안전성 확보, 기관투자자 유입
 
* 기대효과 
 - 조각투자, 투자자보호, 안정성 확보`,head:`분할소유 가능, 발행비용 저렴, 실물가치 근거 
스마트 컨트렉트`,remark:`* 분류(지유자)
 지불형 토큰: 비트코인, 이더리움
 유틸리티 토큰: app, 서비스 이용시
 자산형 토큰: 주식, 실물자산 담보`,image:[]},{index:98,topic:"ㄴ디지털자산 활성화 방안",define:`* 금융상품 연계, 디지털자산 연계, 웹3.0가상경제
 
 - 레거시금융권의 금융서비스 다양화
 - 실물자산 연계 디지털 자산 거래 활성화
 - NFT와 STO 접목
 - 메타버스 기반 가상경제 활성화`,head:`- 가상자산 시장의 제도 수립 우선
- 관련 법 제정 및 가이드라인 구체화
- 디지털 자산에 대한 사회적 합의
- 다양한 도메인 간 융합 사례 발굴`,remark:null,image:[]},{index:99,topic:"양자정보기술",define:`양자컴퓨팅, 양자통신, 양자센싱
 
 - 원자나 분자등을 1개씩 조작하여 반도체 재료 등을 나노수준에서 제어하는 기술
 - QPU 조기개발 목표, 절대보안 통신 구현`,head:"",remark:null,image:["static/images/cellImage_1036301339_26.jpg"]},{index:100,topic:"ㄴ양자통신 연구개발 동향",define:`(국내) 유선양자암호, 무선양자암호, 양자전송, QKD네트웍, 양자네트웍, 위성양자통신, 양자통신이론, 양자통신용 소재/ 소자 기술
 (국외) 미국 - 법제화통해 18년부터 양자인터넷 연구중, 유럽 - 대학주도 연구중, 중국 - 양자네트웍 백본 구축`,head:"양자인터넷 : 초가산성, 초활성화, 인과적활성화",remark:null,image:[]},{index:101,topic:"양자컴퓨터",define:"큐비트를 이용하여 큐비트수가 늘어남에 따라 계산공간이 지수 함수적으로 늘어나는 양자 병렬성을 가진 컴퓨터",head:`* 주요기술(초이다위)
초전도 루프, 이온 트랩, 다이아몬드 점결합, 위상큐비트`,remark:null,image:[]},{index:102,topic:"ㄴ양자암호화",define:`중첩, 얽힘, 불확정성, 복제불가능성
 - 자연현상기반 원타임패드 생성하는 이상적 방법
 - 광원기술 : 양자광원, 광자검출기
 - 키분배기술
 - 난수기술(QRNG)
 - 양자암호 프로토콜 : QKD 프로토콜(BB84, COW04)
 - 시스템 고도화 기술 : 양자중계기, 양자다중화중계기, 집접양자소자, 양자인증, 서명`,head:`중얽불복
BC
광키난양시`,remark:null,image:[]},{index:103,topic:"ㄴㄴCOW04",define:`- one way 방식
 - 장점 : 고속동작
 - 단점 : 환경변화에 따른 시스템동작의 안정성 떨어짐`,head:"",remark:null,image:[]},{index:104,topic:"ㄴㄴBB84",define:`- two way 방식
 - 장점 : 시스템의 안정적인 동작에 유리
 - 단점 : 비밀키 분배 속도 시간 소요`,head:"",remark:null,image:[]},{index:105,topic:"양자내성암호(QKD)",define:`양자컴퓨터를 이용한 모든 공격에 대해 내성이 있어 안전한 공개키 암호화
 - shor, grover알고리즘에 대한 안전성 기반
 
 - 상용화 어려움`,head:`다코격아해
 - 다변수기반 : Rainbow
 - 코드기반 : Wild McEliece
 - 격자기반 : SS-NTRU, 크리스탈
 - 아이소제니 : SDH
 - 해시 : SPHINCS`,remark:null,image:["static/images/cellImage_1036301339_27.jpg"]},{index:106,topic:"디지털역기능",define:`정신적,신체적,경제적
 디지털역기능, 과의존, 결정장애, 치매
 기술포비아, 지식재산침해, 허위정보침해
 -교육,컨텐츠,대응방안,징별제`,head:"정신경",remark:null,image:[]},{index:107,topic:"양자컴퓨터",define:`- 양자역할을 이용한 포스트 무어 컴퓨터
- 큐비트를 이용하여 큐비트수가 늘어남에 따라 계산 공간이 지수 함수적으로 늘어나는 양자 병렬성을 가진 컴퓨터 
 
* 특징: 중얽불복
 양자중첩, 양자얽힘, 불확정성, 복제불가능성`,head:`* 구성요소
 - (HW)양자비트, 게이트, 레지스터, 센서 및 제어장치
 - (SW)양자알고리즘, 언어, 시뮬레이터, 프로그래밍 도구
 
* 주요기술(초이다위)
 초전도 루프, 이온 트랩, 다이아몬드 점결합, 위상 큐비트
 
* 한계 : 성질 취급, 극저온, 접근성불가, 상용화한계
 - ML이용 오류탐지, 해결 방안 가능`,remark:`* 양자컴퓨팅 플랫폼
 - Qiskit(IBM): 양자회로 구성, 시각화
 - Braket(Amazon): 양자 클라우드
 - Quantum(MS): Q#언어 양자프로그램 구현가능`,image:[]},{index:108,topic:"블록체인",define:`- 다수의 노드에 합의된 블록을 분산, 저장, 보관하고 이를 네트워크 참여자에 투명하게 공개하여 위변조를 방지하는 분산원장 및 그 기술
- 주요기술 : 분산원장, 합의프로토콜, 전자서명, 스마트컨트렉트`,head:"분합전스",remark:null,image:[]},{index:109,topic:"블록체인 합의 알고리즘",define:`- 블록체인의 거래 정당성 검토
- 분산 네트워크 상에서 신뢰관계가 없는 참여자들간에 수학적으로 계산된 결과값을 상호검증함으로써 시스템의 무결성을 보장하는 알고리즘`,head:`참여자가 거래를 관리하고 원장 공유
 Public 합의 알고리즘: 작업증명, 지분증명
 Private 합의 알고리즘: PAXOS, PBFT`,remark:null,image:[]},{index:110,topic:"ㄴ작업증명(PoW, Proof of Work)",define:`- 가장 일반적인 알고리즘
- 특정 난이도의 해시값을 찾아 Nonce를 계산/검증`,head:`* 문제점
 소스에게 채굴권 집중, 51% 공격 발생가능`,remark:null,image:[]},{index:111,topic:"ㄴ지분증명(PoS, Proof of Stake)",define:`- PoW의 컴퓨터 파워 낭비문제를 해결하기 위한 대안
- 참여자가 보유한 자산을 기준으로 권한분배`,head:`* 문제점
 악의적 공격에 취약, 유효블록 합의 지연`,remark:null,image:[]},{index:112,topic:"ㄴPAXOS",define:`- 리더를 선정하고 과반수의 동의에 의해 합의
- 과반수의 동의를 얻었다면 추후 동의내용이 변경되지 않음`,head:`* 문제점
 리더의 부정, 거짓신거에 대한 동기화 어려움`,remark:null,image:[]},{index:113,topic:"ㄴPBFT",define:`- 투표 절차 기반의 3단계 프로토콜을 이용하여 합의
- 사설 블록체인에 주로 사용
- PoW와 PoS의 불확실성과 성능문제 해결`,head:`* 문제점
 탈 중앙화에 의한 보안기능 상실`,remark:null,image:[]},{index:114,topic:"ㄴPoN(Proof of Nonce)",define:`- 블록체인 트릴레마 극복
- 전체 노드 중에 확률상 공평하게 선정된 일부 노드가 블록 생성을 주도하여 자원소모를 최소화하고 정보가 담긴 블록을 즉시 확정해 주는 분산 합의 알고리즘`,head:"노멀노드, 참여노드",remark:"성능우수, 블록단위 확장성, 공평한 참여 기회, 보안성 강화(담합 불가능)",image:[]},{index:115,topic:"블록체인 트릴레마",define:`- 블록체인 상에서 세가지 선택지나 옵션이 제시되지만 세가지 모두 만족시킬수 없는 상황 
 
 확탈보`,head:`1) 확장성: 블록체인 네트워크가 성장함에 따라 트랜잭션 또는 사용자 수를 효율적으로 처리할 수 있는 능력 
 2) 탈중앙성: 분산된 노드들을 통해 네트워크가 자율적으로 운영되는 것 
 3) 보안성: 악의적인 활동, 변조, 사기 및 무단 엑세스로부터 네트워크를 보호하는 것`,remark:`-> PoN 극복 
 * 해소방안 
 - 상호운용: 크로스 체인 솔루션 
 - 라이트닝 네트워크 
 - 순수지분증명(PPoS) 
 - 합의 프로토콜, 샤딩 
 - 중첩 블록체인`,image:[]},{index:116,topic:"블록체인 암호기술 가이드라인",define:`- 블록체인의 암호키 소스코드 고정 등 취약점 노출문제 해결을 위한 블록체인 암호기술 가이드라인 
 
- 키워드: 암호학적 해시함수, 공개키암호, 영지식증명, 계정관리, 데이터 전송보안, 합의 프로토콜, 원장, 스마트 컨트렉트, 데이터베이스`,head:`- 암호사용 기준 
- 계정관리 
- 데이터 전송 보안 
- 합의 프로토콜 
- 원장 
- 스마트 컨트랙트 
- 데이터베이스`,remark:null,image:[]},{index:117,topic:"X-Tech",define:"",head:"",remark:null,image:[]},{index:118,topic:"ㄴ리걸테크(Legaltech)",define:`- 법률서비스의 온라인화
- 법률과 기술이 결합된 의미로, 산업전반에 IT기술을 기반으로 하는 혁신적인 법률 서비스를 제공하는 기술`,head:`인공지능, 빅데이터, 블록체인
 
 - ICBMA
 - 판례조사(만든 사건 안됨)`,remark:`로톡 사건
 렉시스+AI`,image:[]},{index:119,topic:"ㄴ레그테크(Regtech)",define:`- 금융규제의 새로운 패러다임
- 규제와 기술의 합성어로, IT기술을 활용해 컴플라이언스 업무 등을 효율화 하는 기술`,head:"데이터마이닝, 머신러닝, 로보틱스, 클라우드 컴퓨팅, 바이오인증, 시각적분석, 블록체인",remark:null,image:[]},{index:120,topic:"ㄴ인슈어테크(InsurTech)",define:`- 보험과 IT기술의 융합 
- 보험과 기술의 합성어로 데이터 분석, 인공지능, 사물인터넷 등의 기술을 활용하여 기존 보험 산업을 혁신하는 서비스`,head:"사물인터넷, 빅데이터, 인공지능, 블록체인",remark:null,image:[]},{index:121,topic:"ㄴ캄테크(CalmTech)",define:`- 조용히 실현되는 기술
- 센서와 컴퓨터 등의 IoT 기술을 융합하여 인간의 무자각 상태에서 각종 편의 서비스를 제공하는 기술`,head:"무자각성, 확장성, 융합서비스",remark:null,image:[]},{index:122,topic:"ㄴ에듀테크(EduTech)",define:`- 미래를 변화시킬 디지털 교육
- 전통적 기존 교육과 미디어, 디자인, SW, AR, VR, 3D등 ICT 기술이 융합하여 지금과는 완전히 다른 학슷ㅂ 경험을 제공하는 기술`,head:`온라인 공개수업(MOOC)
 AI교사, 챗봇
 디지털 트윈, AR, VR, MR
 디지털 교과서, 스마트 글라스`,remark:null,image:[]},{index:123,topic:"LMS(Learning Management System)",define:`- 온라인 학습관리 시스템
- 인터넷 등 온라인 방식으로 교육을 진행하고 학생들의 성적을 관리해 주는 학습관리시스템
- xAPI 표준학습분석솔루션(LRS) : 온오프라인 학습활동 빅데이터 수집`,head:"가상현실, 온라인 튜터링, 모바일 학습, 게임화, 라이브 온라인 수업",remark:null,image:[]},{index:124,topic:"오픈뱅킹",define:`- App기반 종합금융플랫폼
- 은행의 송금, 결제망을 표준화하여 하나의 어플리케이션으로 모든 은행의 계좌 조회, 결제, 송금 등을 제공받는 서비스`,head:"본인인증 및 출금동의, 사이버공격 모니터링, 장애대응 강화",remark:`서비스 API: 잔액조회, 입금, 출금
 인증/관리 API: 사용자 인증, 관리`,image:[]},{index:125,topic:"스마트 헬스케어, 디지털 헬스케어",define:`- 지능형 건강관리 서비스
- 개인의 건강과 의료에 관한 정보, 기긱, 시스템, 플랫폼을 다루는 산업분야로서 건강관련 서비스와 의료 IT가 융합된 종합의료서비스 
- ICT 기술을 활용하여 인간의 건강을 개선하는 다양한 방법 및 기술`,head:`* 핵심기술 
 - 비침습, 무자각, 무구속 건강정보 측정기술 
 - 맞춤형 진단 및 현장진단 기술 
 - 개방형 건강관리 플랫폼 기술 
 - 맞춤형 원격건강관리 서비스 기술
 
* 마이데이터 연계`,remark:`* 육성전략: 디지털헬스케어 산업 생태계 조성 
 1) 시장 창출 지원 강화 
 2) 데이터 기반 융복합 헬스케어 기기 개발 
 3) 활성화 기반조성`,image:[]},{index:126,topic:"자율주행자동차",define:`- 인간의 개입없이 스스로 운행하는 자동차
- 운전자 조작없이 스스로 주변 환경을 인지하여 위험을 판단하고, 주행 경로를 계획하는 등 안전주행 및 제어가 가능한 자동차`,head:`* 자율주행기술 레벨 6단계
 L0: Hands on
 L1: Hands on
 L2: Hands on
 L3: eye off
 L4: mind off
 L5: driver off`,remark:`인판제
 인지 : ADAS, 센서, 인식기술
 판단 : 주행전략, 경로생성
 제어 : Actuator 제어
 공통 : MMAS, V2X, HUD, 정밀지도DB`,image:[]},{index:127,topic:"ㄴADAS(Advanced Driver Assistance System)",define:`- 운전자의 안전 파수꾼
- 복잡한 차량 제어를 통해 운전자의 운전을 지원하고 궁극적으로 운전자를 대체하여 스스로 운전하는 것을 목적으로 개발된 장치`,head:`[전방 충돌 회피 기능]
 전방충돌 경고장치(FCW)
 자동비상 제동장치(AEBS)
 적용순항 제어장치(ACC)
 [차선이탈 경고기능]
 차선이탈 경고장치(LDWS)
 차선유지 보조장치(LKAS)`,remark:`[사각지대 감시기능]
 사각지대 감시장치(BSD)
 후측방 충돌회피 지원장치(ABSD)
 [후방감시 기능]
 후방충돌 경고장치(RCW)`,image:[]},{index:128,topic:"UAM(Urban Air Mobility)",define:"- 수직 이착륙이 가능한 개인항공기와 목적기반 모빌리티를 이용하는 하늘의 이동통로를 활용하는 미래의 도시 교통체계",head:`* 핵심기술 
 - 기체/부품: UAM 경량화 제작기술, UAM 동력 추진 시스템, eVTOL(수직 이착륙, 정지비행) 
 - 항행 교통관리: UAM CNSi(통신,항법,감시시스템), UAM 통합관리 
 - 인프라: 버티포트 시스템(이착륙, 충전인프라), 5G NSA/SA
 - 서비스: 항공기 정비, 운항정보 수집분석 기술 
 - 비행기술: UAM 자율항법기술, UAM 기체소음 진동저감`,remark:null,image:[]},{index:129,topic:"SLAM(Simultaneous Localization And Mapping)",define:`- 자율주행 이동체에 사용되어 주변 환경지도를 작성하는 동시에 이동체의 위치를 작성된 지도안에서 인식하는 기법
 
- 무인 이동체가 별도의 위치 인식 시스템의 도움 없이 이동하면서 현재 위치를 추정하고 인식하며 지도를 만들어 내는 기술 
 
- 자율주행 이동체가 미지의 환경을 이동하며 동시에 HD맵 작성`,head:`* 기술요소
 [Visual SLAM]
 - 카메라 및 센서 
 - Sparse 알고리즘: 영상 feature point 매칭 
 - Dense 알고리즘: 영상 밝기기반 매칭
 [LiDAR SLAM]
 - 레이저 및 센서 
 - ICP 알고리즘: 한 대상물에 대해 다른 지점에서 스캔된 포인트 클라우드 정합 
 - NDT 알고리즘: voxel 공간을 인덱싱 처리하여 3d 가우시안 분포로 근사화 처리`,remark:null,image:[]},{index:130,topic:"협력형 SLAM",define:"- 다수의 무인 이동체들 간의 협력을 통해 SLAM 작업을 수행하는 SLAM",head:`* 유형 
 1) 중앙집중방식 SLAM
 - 각 무인 이동체가 생성한 지역 지도와 위치 추정 정보가 서버로 전송되고, 이 서버가 무인 이동체들이 이동하는 환경의 전역 지도와 그들이 이동 궤적을 생성하는 방식
 2) 분산방식 SLAM`,remark:null,image:[]},{index:131,topic:"ISO 26262",define:`- 자동차 기능안전 국제표준
- 자동차에 탑재되는 전자, 전기 시스템의 오류로 인한 사고를 방지하기 위해 ISO에서 제정한 자동차 기능 안전 국제 규격`,head:`용기구시 하소생 지아가 반모
 ASIL(A~D)
 S(심각도3), E(노출가능성4), C(통제가능성3)`,remark:"용어, 기능안전관리, 구상단계, 시스템/하드웨어/소프트웨어 레벨 제품 개발, 생산 및 운용, 지원 프로세스, ASIL, 가이드라인, 반도체, 모터사이클",image:[]},{index:132,topic:"ISO/PAS 21448",define:`- 설계자체의 안전 확보
- 수용가능한 수준의 위험이 있을 때까지 동작을 확인 및 검증하여 위험한 조건을 식별하기 위한 프레임워크
- SOTIF`,head:`시스템
 외부요소`,remark:null,image:[]},{index:133,topic:"ISO/SAE 21434(CSMS)",define:`- 자동차 + 사이버보안
- 기능안전 및 SOTIF와 조화를 이루는 사이버보안 표준
- 자동차 사이버보안 평가에 필요한 사이버보안 프로세스 및 활동과 최소한의 요구사항을 정의`,head:"",remark:null,image:[]},{index:134,topic:"ㄴTARA(Threat Analysis and Risk Assessment(위협 분석 및 리스크 평가))",define:`- 위험평가방법론 
- ISO/SAE 21434에서 정의한 주요 활동으로서 차량의 기획연구부터 시작하여 설계, 제조,출하, 운용,폐기까지 수명주기 전체에 걸쳐 잠재적 사이버 위협에 대한 위협분석 및 리스크 평가하는 분석활동`,head:`* TARA의 위험관리 프로세스 (제자시영공 실위방)
 1) 제품정의
 2) 자산식별
 3) 시나리오 제작
 4) 영향도 평가
 5) 공격 경로 식별
 6) 실현 가능성 평가
 7) 위험도 결정
 8) 위험관리방법 결정`,remark:`* 위험관리방법: 회전완수
 - 위험 회피, 전가, 완화, 수용`,image:[]},{index:135,topic:"ASPICE(Automotive SPICE)",define:`- 자동차 산업의 소프트웨어 개발 프로세스 평가 표준 
- ISO/IEC 33000(12207+15504) 표준 기반 자동차 소프트웨어 개발에 특화된 국제 표준 프로세스 모델 
- ECU 개발 프로세스 및 품질 전반에 관한 표준`,head:`* 구성요소
 1) PRM: 기지조
 - 기본: 획득(ACQ), 공급(SLP), 공학(ENG) 
 - 지원: 지원(SUP) 
 - 조직: 관리(MAN), 개선(PIM), 재사용(REU) 
 2) 능력수준: 6단계(불수관확예최) - 미달성,수행,관리,수립,계측가능, 최적화
 3) PAM: 프로세스 평가모델 
 - 프로세스 수행지표: 기본사례, 작업산출물 
 - 프로세스 능력지표: 일반사례, 일반자원`,remark:null,image:[]},{index:136,topic:"실감경제",define:`- 가상과 현실의 빅블러
- 가상현실, 증강현실, 홀로그램 같은 실감형 기술로 사회, 문화, 경제적 가치를 창출하는 경제`,head:`고화질 Multi View 생중계, 홀로그램 영상통화/회의/공연, 가상현실 게임
 5G 환경`,remark:null,image:[]},{index:137,topic:"DID",define:`- 블록체인 기반 탈중앙 ID
- 본인인증 정보를 정보 주체 스스로 관리하고 증명하는 블록체인 기반의 디지털 신원증명 체계`,head:"분산ID 발급 > 발급정보 분산저장 > 분산ID 제출 > 분산 ID 검증",remark:`개인정보 보호 강화
 신원정보의 지속 활용 가능
 피어(Peer)기반`,image:[]},{index:138,topic:"라이트닝 네트워크",define:`- 비트코인 확장성 문제 해결
- 비트코인의 수수료 부담, 트랜잭션 처리시간의 부하를 해소하기 위해 블록체인 외부에서 최종 결과만을 기록하는 기술`,head:"결제 채널 생성 > 거래 진행 > 기록",remark:`수수료 부담 감소 
 트랜잭션 처리속도 효율
 거래 수용범위 증가`,image:[]},{index:139,topic:"FMOps",define:`- Foundation Model Operations 
- LLM기반의 앱 개발을 위한 방법론 
- 목적: 이미 학습이 완료된 기반 모델과 자신의 데이터를 활용하여 커스텀한 AI 앱을 만드는 것`,head:`* 핵심요소 
 - 프롬프트 엔지니어링 
 - 데이터 임베딩과 모델 파인튜닝 
 - 모델 모니터링과 검증`,remark:null,image:[]},{index:140,topic:"MLOps",define:"- 모델을 새로 개발하기위해 모델의 생명주기를 관리하는 기술",head:"",remark:null,image:[]},{index:141,topic:"디지털 역기능",define:`- 인간의 편의를 위해 도입된 디지털 기술과 이러한 디지털 기술을 응용한 서비스 활용과정에서 발생하는 부작용 내지 부정적 효과
* 관련기술
- 인공지능, 블록체인, 메타버스, 지능형 로봇`,head:`* 심각성 분류
 1군(현재 가장 심각): 성범죄, 언어폭력, 개인정보 침해, 금융범죄
 2군(현재 심각 미래에 더욱 심각): 디지털 과몰입, 디지털 치매, 정체성 혼란
 3군: 디지털 격차, 오작동, 탄소중립
 4군: 기술 혐오`,remark:`* 대응방향
 - R&D 투자 확대 및 역량 강화
 - 디지털윤리 글로벌 표준화
 - 단계별 SW안전 확보
 - 대응 혁신 전략 수립 및 교육 인프라 확충을 위한 정책적 지원`,image:[]},{index:142,topic:"ESG 기반 블록체인 기술",define:`* 필요성
 - 기업의 ESG 공개정보가 신뢰할 수 있도록 블록체인 기술을 이용한 정보의 정확성, 투명성, 신뢰성 보장의 필요성 증가`,head:`* 고려사항
 국경초월, 대체불가, 정부관심사, 정책 대응 등`,remark:`* 권고사항
 규정준수 및 일관성, 디지털보안 및 개인정보보호, 거버넌스, 투명성, 책임`,image:[]},{index:143,topic:"메타버스",define:`- 가상의 'Meta'와 우주의 'Univers'를 합친 단어로, 실세계와 디지털 가상세계가 공존할 수 있는 공간
- 유형: 증라거가
 증강현실, 라이프로깅, 거울세계, 가상세계`,head:`* 구성요소
 - 기술관점: 확장현실(XR), 디지털 트윈, 데이터, 네트워크, 인공지능(AI)
 - 산업관점: 인프라, 하드웨어, 컨텐츠, 플랫폼`,remark:`* 동향
 MS: 블리자드 인수
 애플: 아이패드에 LiDAR 탑재
 메타: 뇌파를 이용한 타자기록 기술 공개`,image:[]},{index:144,topic:"메타버스 윤리원칙",define:"- 모든 사회 구성원이 메타버스의 혜택과 역기능을 사전에 인지하여 자정 노력에 참조할 수 있는 보편적, 포괄적 윤리규범 제시",head:`* 3대 지향가치: 온안지
 - 온전한 자아, 안전한 경험, 지속가능한 번영
* 8대 실천원칙: 진자호사 공개포책`,remark:"진정성, 자율성, 호혜성, 사생활 존중, 공정성, 개인정보 보호, 포용성, 책임성",image:[]},{index:145,topic:"메타버스 사이버보안 주요요소",define:"Input, Output, DataAccess, Interaction, Device Protection",head:"* 보안강화방안 : 제도, 기술측면",remark:null,image:[]},{index:146,topic:"NFT",define:`- 특정한 자산을 나타내는 블록체인 기반의 디지털 파일로 대체 불가능한 토큰 의미
 - 메타데이터는 파일로 존재 블록체인에 기록`,head:`* 구조
 Smart Contract: 소유권 양도/확인 기능
 Metadata: 토큰 ID 정보
 Media Data: 원본데이터`,remark:null,image:[]},{index:147,topic:"메타버스+NFT",define:`* 국내 진출 기업
 SM, JYP, 초록뱀미디어, 스튜디오 드래곤
* 게임과 결합 비즈니스
 컴투스: 블록체인 메타노믹스 플랫폼 주목
 크래프톤: 버추얼 휴먼 소개
 엔씨소프트: 팬텀 플랫폼 유니버스 출시`,head:`* 패션과 결합 비즈니스
 구찌: 제페토에 구찌 빌라 오픈
 루이비통: 자체 개발 게임 
 나이키: 메타버스용 의류, 신발 특허 출원
 아디다스: 메타버스 기반 컬렉션 공개`,remark:`* 고려사항
 - 안전한 가상화폐 결제 시스템 및 신뢰성 확보 필요
 - 범죄문제, 중독문제, 저작권 문제 등 해결 필요`,image:[]},{index:148,topic:"디지털트윈",define:`- 물리적 객체들에 대해 사이버 공간으로의 복제를 통해 객체요소들의 속성/상태에 따른 동적 성질을 묘사하는 가상의 모델 
 - 물리적 대상을 가상 공간에 동일하게 표현하기 위해 수집된 데이터를 기반으로 모델링 및 분석, 시뮬레이션 하기 위한 기술 플랫폼`,head:"* 기술 : 센서이용 Agent 활용기술, IoT컨트롤러 통신, 시뮬레이션, 3D 모델링, 클라우드, 인공지능, Actuatord연결제어, 디지털 스레드",remark:`* 디지털트윈 기술발전 5단계 
  모관모연자 
 - 1단계: 모사(Mirroring) 
 - 2단계: 관제(Monitoring) 
 - 3단계: 모의(Modeling&시뮬레이션) 
 - 4단계: 연합(Federated) 
 - 5단계: 자율(Autonomous)
 
 * 활용
 - 제조, 에너지, 도시, 물류`,image:[]},{index:149,topic:"ㄴCPS(사이버 물리 시스템)",define:`- 대규모 센서/엑츄에이터를 가지는 물리적인 요소와 통신기술, 소프트웨어 기술을 이용하여 실시간으로 물리적 요소들을 제어
- 다양한 컴퓨터 기능들이 물리세계의 일반적인 사물과 융합된 형태의 시스템 
 
- 현존하는 물리시스템에 센서 등 ICT 기술을 접목하여 신뢰성 높은 시스템 구현`,head:"시뮬레이션, 자동화, 센싱, 프로세스",remark:null,image:[]},{index:150,topic:"스마트 팩토리",define:`- 미래지향적 제조 혁신
- 전 제조과정을 인공지능, 빅데이터, VR/AR, 5G, 디지털 트윈 등과 같은 첨단 디지털 기술 적용 모델 
 
- 전통 제조산업에 ICT 기술을 결합하여 설비와 공정이 지능화되고 서로 연결되어, 생산정보가 실시간으로 공유, 활용, 최적화 생산이 가능한 공장`,head:"CPS",remark:`* 보안 사고유형 
 - 산업제어시스템의 정상동작 방해 
 - 해킹으로 인한 시스템상의 자료 변조 및 유출`,image:[]},{index:151,topic:"퍼듀모델",define:`- ICS 보안 참조모델 
- 네트워크 구조를 enterprise 영역과 manufacturing(제조) 영역으로 나눠 보안 취약점을 개선한 모델`,head:`* level 0~5의 6단계로 구성 
 - level 4~5: Enterprise 영역(IT영역) 
 - 두영역 사이에 IDMZ 
 - level 0~3: Manufacturing 영역(OT영역)`,remark:`- 레벨5: 엔터프라이즈 NW (IT영역) 
- 레벨4: 이메일, 인터넷, 물류 NW 
- IDMZ: 방화벽, 리버스 프록시,, 
- 레벨3: 사이트 운영 (OT영역) 
- 레벨2: 구역 감독 통제 
- 레벨1: 기본제어-배치,분산,드라이브 
- 레벨0: 프로세스-센서, 드라이브, 엑츄에이터, 로봇`,image:[]},{index:152,topic:"그래핀",define:`- 나노탄소소재
- 탄소 원자로 이루어진 단층으로 된 2차원 막 형태 구조`,head:`* 특징
 - 상온에서 전자 이동도 실리콘보다 100배
 - 열전도성은 다이아몬드보다 2배 
 - 기계적 강도는 강철보다 200배 우수
 - 전기전도성과 유연성 동시 충족`,remark:`* 제조방법
 1) 물리적 박리
 2) 화학적 박리
 3) 화학적 기상 증착법
 4) 에피택셜 성장법`,image:[]},{index:153,topic:"BCI(Brain Computer Interface)",define:`- 인간의 두뇌와 컴퓨터를 직접 연결해 뇌파를 통해 컴퓨터를 제어하는 인터페이스 기술 
 
- 등장배경: 초기 ADHD 아동이나 중증 신체 장애인의 컨트롤 등 의료적 목적
 
- 활용분야: 의료, IT기기제어, 자전거/자동차, 게임, 교육 등
- 동의어: HCI(Human Computer Interface), BMI(Brain Machine Interface)

* 일론머스크의 '뉴럴링크'
 - 성과: 23년 5월 FDA승인, 24년 1월 사람 칩 이식 성공, 24년 3월 사지마비 자의 비디오/온라인 체스 게임`,head:`* BCI 인터페이스 기술방식 
 1) 뇌파 측정 부위 
 - 침습형 방식: 마이크로 칩을 두피에 시술 
 - 비침습형 방식: 헬멧이나 헤드셋 형태 장비 사용 
 2) 활용 뇌파 특징 
 - 뇌파 유도 방식: 특정 뇌파 출현을 유도 
 - 뇌파 인식 방식: 뇌파 분석, 간단의사/동작 인식
 
 * 절차 
신호측정>전처리>형태추출>분류>응용`,remark:null,image:[]},{index:154,topic:"로봇 저널리즘",define:"- 뉴스 기사를 만드는 모든 과정에서 로봇이 자체적으로 정보를 수집 및 분류한 후 의미를 해석해 스스로 기사를 작성하는 모든 역할을 수행하는 형태의 저널리즘",head:`시작 > 데이터 수집 > 이벤트 추출 > 중요 이벤트 선정 > 기사분위기 결정 > 뉴스 기사 생성 > 뉴스기사 배포 > 종료 
 
 * 고려사항 
 - 알고리즘 정보 오류 보완 
 - 알고리즘 객관성 부여 
 - 데이터 타당성 판단 기준필요`,remark:null,image:[]},{index:155,topic:"Hyper Automation",define:`- 초 자동화 구현 
- 다양한 기술을 결합하여 조직에서 자동화할 수 있는 모든 것을 자동화 하는 기술 

- 인공지능 관점: RPA로 시작하고 AI, 프로세스 마이닝, 분석 및 기타 고급 툴을 사용하여 자동화 기능을 확대하는 기술들의 집합`,head:`* 주요기술 
 - AI/딥러닝: NLP, 머신러닝 알고리즘, AI 비전처리 
 - RPA 
 - 빅데이터 및 클라우드 
 - WorkFlow 최적화 BPM 
 - 노코드 플랫폼`,remark:`* 적용사례 
 - 이미지처리 
 - 문서입력 
 - 스크래핑`,image:[]},{index:156,topic:"RPA, 로봇프로세스 자동화(Robotic Process Automation)",define:`- 단순히 반복되는 비즈니스 작업을 로봇 소프트웨어를 이용해 자동으로 처리하는 기술
 
* 동작원리 : 업무선택 > 활동저장 > 솔루션 실행`,head:`* 기반기술 
 - workflow 자동화 
 - 챗봇 
 - 이미지 인식 
 - OCR 
 - 작업라이브러리 
 - 로봇디버깅
 
* 솔루션 : 에피안, 봇스토어, 오토메이션 엣지`,remark:`* 도입전략 
 1단계) 시범사업 
 2단계) 본사업 
 3단계) 확대 사업 
 - 점진적 확대 적용`,image:[]},{index:157,topic:"로우코드(Low code)",define:"- Drag&Drop UI와 workflow 모델링을 활용하여 복잡한 코딩 과정을 단순화해 소프트웨어를 빠르게 개발하고 배포할 수 있게 지원하는 SW 개발기술",head:`* 기술요소 
 [환경]
 - IDE: 비주얼 개발도구 
 - Drag&Drop UI
 - 템플릿 모델링 
 - WYSWYG Editor 
 [개발]
 - RestAPI
 - Angular.js
 - 3rd Party API
 - 데이터모델링`,remark:null,image:[]},{index:158,topic:"디지털 치료제",define:"- 약물치료 없이 질병, 장애를 예방, 관리, 치료하기 위해 환자에게 근거 기반의 치료적 중재를 제공하는 고도화된 모바일 애플리케이션, 게임, 가상현실, 챗봇 인공지능 등의 SW 의료기기",head:`* 디지털 치료제 유형 
 1) 독립형(Standalone): 독립적 치료설계 
 - 기존 치료제를 대체하여 단독으로 사용, 병행 가능(모바일 앱)
 2) 증강형(Augment): 기존 치료법과 병용 
 - 일반적으로 당뇨병과 같은 만성질환 치료 효과 향상 지원 
 3) 보완형(Complementary): 기존 치료법 보완 
 - 치료 약물과 함께 자가건강상태 관리를 개선하여 질병의 중요원인 비만, 고혈압 등의 행동패턴 및 생활 습관 관리`,remark:`* 활용 
 - 만성질환 관리 
 - 행동교정 관리 
 - 처방 준수 지원 
 - 데이터 수집 관리
 국내개발 : 솜즈, 웰트-I`,image:[]},{index:159,topic:"인터미턴트 컴퓨팅(Intermittent Computing)",define:"- 전력 수급이 불안정한 환경에서 에너지 하베스팅으로 얻어진 전력으로 신뢰성을 보장하며 동작하는 컴퓨팅 기술",head:`* 기술요소 
 [에너지 수집 및 저장기술]
 - 에너지 하베스팅: 버려지거나 활용되지 않은 자원에서 에너지를 재생산 하는 기술
 - Capybara: 애플리케이션 요구에 맞게 하드웨어 에너지 용량 재구성 
 [메모리 시스템 기술]
 - NVP(Nonvolatile Processer): 비휘발성 프로세서로 간헐적인 전원공급장치를 사용하여 지속적으로 계산 
 - NOC(Normally Off Computing): 유휴시간동안 대기전력 미사용`,remark:`[실행흐름 제어기술]
 - 체크포인팅 기술: 전력문제 발생시 휘발성 값은 지우고 비휘발성 값만 유지하는 기법
 - 다중버전 모델: 비휘발성 메모리의 일부를 사용하여 보존하고 복원하는 기법`,image:[]},{index:160,topic:"앰비언트 컴퓨팅(Ambient Computing)",define:`- 사용자가 특별히 조작하거나 의식하지 않더라도 사용자 주면 일상에서 자연스럽게 이루어지는 컴퓨팅
- 기술요소로 IoT 필요`,head:`* 관련 기술
 - 다중경험, 스마트 스피커, 스마트홈`,remark:null,image:[]}],i={subject:n,topics:e};export{i as default,n as subject,e as topics};
