const n="프로젝트관리",e=[{index:1,topic:"프로젝트",define:`- 고유한 제품 등 결과물을 산출하기 위한 한시적 노력 또는 활동 
- 목표: 프로젝트 성공`,head:"",remark:null,image:["static/images/cellImage_623845112_1.jpg","static/images/cellImage_623845112_2.jpg"]},{index:2,topic:"프로그램",define:`- 통합된 방식으로 관리하는 프로젝트, 프로그램 등의 그룹(ROI 관점)
- 목표: 편익의 관리`,head:"",remark:null,image:[]},{index:3,topic:"포트폴리오",define:`- 전략적 목표를 달성하기 위한 집합체(전사관점)
- 목표: 전략 달성`,head:"",remark:null,image:[]},{index:4,topic:"프로젝트 생애주기",define:`- 시작부터 완료에 이르기까지 프로젝트가 거치는 일련의 단계 
- 단계=개발생애주기`,head:`* 생애주기 모델 
- 예측형 생애주기: 초반에 프로젝트 범위와 시간, 원가 등 결정(폭포수모델)
- 반복적 생애주기: 이해도가 높아짐에 따라 시간과 비용산정치가 정기적으로 수정 
- 점증적 생애주기: 사전에 정해진 기간 내에 기능을 계속 추가해 나가는 일련의 반복 수행(출시중심모델) 
- 적응형 생애주기: 반복을 시작하기 전에 자세한 범위가 정의되고 승인됨(Agile) 
- 혼합형 생애주기: 예측 + 적응형`,remark:null,image:["static/images/cellImage_623845112_3.jpg"]},{index:5,topic:"프로젝트 관리 프로세스",define:"- 모든 프로젝트 관리 프로세스에서 적절한 프로젝트 관리도구 및 기법을 사용하여 하나 이상의 투입물로부터 한가지 이상의 산출물을 생성",head:"투입물, 도구 및 기법, 산출물",remark:null,image:[]},{index:6,topic:"프로젝트 관리 프로세스 그룹",define:"- 프로젝트 목표를 달성하기 위해 프로젝트 관리 프로세스를 논리적으로 분류한 그룹",head:`착계실통종 
- 착수: 공식적인 승인
- 계획: 범위설정, 목표달성 위한 계획
- 실행: 계획에 정의된 작업 완료 과정
- 감시 및 통제: 진행성과 추적, 검토, 변경
- 종료: 공싱적인 종료`,remark:null,image:["static/images/cellImage_623845112_4.jpg"]},{index:8,topic:"프로젝트 관리 지식영역",define:`통범일원품자 의리조이 

- 통합관리: 프로세스와 프로젝트 관리 활동을 식별, 정의, 결합, 통합 및 조정하는 프로세스와 활동을 포함 
- 범위관리: 프로젝트를 성공적을 완료하기 위해 필요한 모든 작업을 빠짐없이 프로젝트에 포함시키는 과정에서 수행해야하는 프로세스들을 포함
- 일정관리: 적시에 프로젝트를 완료하도록 관리하는 프로세스들을 포함
- 원가관리: 승인된 예산 범위 내에서 프로젝트를 완료할 수 있도록 원가 통제하는 프로세스들을 포함`,head:`- 품질관리: 이해관계자의 기대사항을 충족하기 위해 프로젝트 및 제품 품질 요구사항의 기획, 관리 및 통제에 관한 조직의 품질 정책을 반영하는 프로세스들을 포함 
- 자원관리: 프로젝트를 성공적으로 완료하는데 필요한 자원을 식별하고, 확보하여 관리하는 프로세스들을 포함 
- 의사소통관리: 프로젝트 정보를 적절히 기획, 관리, 통제 등의 프로세스 들을 포함`,remark:`- 리스크관리: 프로젝트의 리스트에 대해 식별, 대응, 감시 등의 프로세스들을 포함
- 조달관리: 프로젝트팀 외부에서 제품, 서비스를 구매하거나 획득하기 위해 필요한 프로세스들을 포함
- 이해관계자관리: 프로젝트에 영향이 있는 모든 사람 또는 조직을 식별하고 이들이 미치는 영향 분석 및 효율적인 참여를 유도하기 위한 프로세스 들을 포함`,image:[]},{index:9,topic:"프로젝트 관리 데이터 및 정보",define:`- 작업성과데이터(Data): 실제 관찰 및 측정 데이터
- 작업성과정보(Information): 상관관계 바탕으로 분석되고 통합되는 성과데이터
- 작업성과보고서(Reporting): 프로젝트 문서에 삽입된 실물 또는 전자형식의 작업 성과 정보`,head:"",remark:null,image:[]},{index:10,topic:"비즈니스 문서",define:`- 비즈니스 케이스: 프로젝트 타당성 연구자료
- 편익관리 계획서: 프로젝트에 제공되는 편익 창출 및 극대화하고 유지하기 위해 수행하는 프로세스 정의 문서`,head:"",remark:null,image:[]},{index:11,topic:"프로젝트 환경",define:`* 기업환경요인(EEF) 
- 프로젝트 팀의 통제범위 밖에서 프로젝트에 영향을 주거나 제약이되는 요인 또는 방향을 제시하는 요인 
- 유형적 요소: 시스템, 인프라, 자원, 인력, 표준 등 
- 무형적 요소: 문화, 조직구조, 거버넌스, 시장환경 등`,head:`* 조직프로세스자산(OPA) 
- 프로젝트 수행조직에서 사용하는 조직 특유의 계획서, 프로세스, 정책, 절차 및 지식기반 일체 
- 프로세스: 표준 프로세스, 템플릿, 가이드라인, 라이프사이클 등 
- 수행실적: 프로세스 측정 데이터, 파일, 형상관리 시스템 등`,remark:null,image:[]},{index:12,topic:"프로젝트 조직 유형",define:`- 기능조직: 중앙집중식
- 매트릭스 조직: 강함, 약함, 중립 
- 프로젝트 기반: 복합, 하이브리드 
- PMO`,head:"",remark:`조긱 구조 유형별로 차이 발생
- 프로젝트 관리자의 권한
- 프로젝트 관리자의 역할
- 자원 가용성
- 프로젝트(예산 누가 관리?)
- 프로젝트 관리 행정 담당자`,image:["static/images/cellImage_623845112_5.jpg"]},{index:13,topic:"ㄴPMO",define:`- 프로젝트 관련 거버넌스 프로세스를 표준화하고 자원, 방법론, 도구 및 기법 등의 공유를 지원하는 조직기구 
- 목표: 전체 조직의 목표 달성`,head:`* PMO 유형 6th 기준
- Supportive(지원) 
- Controlling(규정준수) 
- Directive(직접통제) 

* PMO유형 5th 기준
- Weather Station (기상대)
- Coach (코치)
- Control Tower (관제탑)`,remark:null,image:[]},{index:14,topic:"ㄴㄴ감리와 PMO 비교",define:"",head:"빈출",remark:null,image:["static/images/cellImage_623845112_6.jpg"]},{index:15,topic:"ㄴ프로젝트 관리자",define:"- 수행조직에서 프로젝트 목표를 달성할 책임을 가지도록 팀의 리더로 선임된 책임자",head:"",remark:null,image:[]},{index:16,topic:"ㄴㄴ역량삼각형(Talent Triangle)",define:"- 프로젝트 관리자에게 필요한 기술에 프로젝트 관리자 역량개발 프레임워크",head:`기리전 
- 기술적 프로젝트 관리
- 리더십 
- 전략 및 비즈니스 관리: 지식 전문성`,remark:`* 리더십 유형 
자유방임형, 거래형, 섬김형, 변신형, 카리스마형, 상호작용형`,image:[]},{index:7,topic:"PMBOK7판",define:"",head:`PMBOK 6th
ISO21500와 6판은 유사함: 비교->
PMBOK 7th 발표
[두음]
가치 - 공존정책
원칙 - 스팀이가사리조품복리적변
가이드- 이팀개기작인측불`,remark:null,image:["static/images/cellImage_623845112_12.jpg","static/images/cellImage_623845112_13.jpg"]},{index:17,topic:"통합관리",define:`- 프로젝트 관리 프로세스 그룹에 속하는 다양한 프로세스들과 프로젝트 관리 활동을 식별/정의/결합 및 조정하는데 필요한 프로세스들과 활동들을 포함 
- 개별 프로세스간의 상호작용이 발생하기 때문에 통합이 필요함`,head:`* 통합관리 프로세스 
[착수] 
- 프로젝트 헌장개발 
[계획수립] 
- 프로젝트 관리 계획서 개발 
[실행]
- 프로젝트 작업 지시 및 관리 
- 프로젝트 지식관리 
[감시 및 통제]
- 프로젝트 작업 감시 및 통제 
- 통합변경 통제수행 
[종료]
- 프로젝트/단계종료`,remark:null,image:[]},{index:18,topic:"ㄴ프로젝트 헌장개발",define:`- 프로젝트의 채택을 공식적으로 승인하고, 프로젝트 관리자에게 조직의 자원을 프로젝트 활동에 투입할 수 있는 권한을 부여하는 문서를 개발하는 프로세스 

- 프로젝트 시작과 프로젝트 업무범위가 명확히 정의 
- 프로젝트 공식적 기록 작성 및 승인`,head:`[투입물] 
- 프로젝트 작업 기술서
- 비즈니스 문서 
- 협약 
[도구 및 기법]
- 전문가 판단, 퍼실리테이션 기법
- 데이터 수집: 브레인스토밍, 핵심 전문가 그룹, 인터뷰 
- 대인관계 및 팀 기술: 갈등관리, 촉진, 회의관리 
- 회의 
[결과물]
- 프로젝트 헌장: 프로젝트 목적과 정당성, 상위수준 요구사항, 상위수준 리스크, 요약 마일스톤 일정, 요약 예산, 이해관계자 목록 등 
- 가정사항 기록부`,remark:null,image:["static/images/cellImage_623845112_14.jpg"]},{index:19,topic:"ㄴ프로젝트 관리 계획서 개발",define:`- 모든 보조 계획들을 하나의 종합적인 프로젝트 관리 계획서에 통합하는 프로세스 

- 모든 프로젝트 작업의 기준을 정의하는 기본문서 준비`,head:`[투입물] 
- 프로젝트 헌장 
- 기타 프로세스의 산출물 
[도구 및 기법]
- 전문가 판단, 퍼실리테이션 기법
- 데이터 수집: 브레인스토밍, 점검목록, 핵심전문가 그룹, 인터뷰 
- 대인관계 및 팀 기술: 갈등관리, 촉진, 회의관리 
- 회의 
[결과물] 
- 프로젝트 관리 계획서(베이스라인)`,remark:null,image:["static/images/cellImage_623845112_15.jpg"]},{index:20,topic:"ㄴ프로젝트 작업 지시 및 관리",define:`- 프로젝트 관리 계획서에 정의된 작업을 리드/수행하며, 승인된 변경사항을 실행하는 프로세스 

- 프로젝트 작업에 대한 전체(종합적인) 관리 제공`,head:`[투입물]
- 프로젝트 관리 계획서 
- 프로젝트 문서
- 승인된 변경요청 
[도구 및 기법]
- 프로젝트 관리 정보 시스템(PIMS)
- 회의: 의사결정, 정보교환, 브레인스토밍, 대안평가 및 설계 
[결과물]
- 인도물(산출물)
- 작업성과자료 
- 이슈기록부 
- 승인된 변경요청: (시예결업)시정조치, 예방조치, 결함수정, 업데이트 
- 프로젝트 관리 계획서 업데이트 
- 프로젝트 문서 업데이트 
- 조직 프로세스 자산 업데이트`,remark:null,image:["static/images/cellImage_623845112_16.jpg"]},{index:21,topic:"ㄴ프로젝트 지식관리",define:`- 프로젝트 목표를 달성하고 조직의 학습에 기여할 수 있도록 기존 지식을 활용하고 새로운 지식을 만들어가는 프로세스 

- 조직의 운영업무, 향후 프로젝트 또는 단계 지원`,head:`[투입물]
- 프로젝트 관리 계획서 
- 프로젝트 문서
- 인도물 
[도구 및 기법]
- 지식 관리 
- 정보 관리 
- 대인관계 및 팀 기술: 적극적 경청, 촉진, 리더십, 네트워킹, 정치적 인식 
[결과물]
- 교훈관리대장: 암묵지, 형식지 
- 프로젝트 관리 계획서 업데이트 
- 조직 프로세스 자산 업데이트`,remark:null,image:["static/images/cellImage_623845112_17.jpg"]},{index:22,topic:"ㄴ프로젝트 작업 감시 및 통제",define:`- 프로젝트 관리 계획서에 정의된 성과목표를 달성하기 위해 프로젝트 진행상황을 추적/검토/보고하는 프로세스 

- 이해관계자들이 프로젝트의 현재상태, 취해진 조치, 예산/일정/범위 예측치를 이해하도록 함`,head:`[투입물]
- 프로젝트 관리 계획서: 일정예측치, 원가예측치 
- 프로젝트 문서: 교훈관리대장, 마일스톤, 품질보고서, 리스크 보고서
- 작업성과정보 
- 협약 
[도구 및 기법]
- 데이터분석: 대안분석, 비용-편익분석, 획득가치분석, 원인분석, 추세분석, 차이분석 
- 의사결정 
- 회의 
[결과물]
- 작업성과정보 
- 승인된 변경요청 
- 프로젝트 관리 계획서 업데이트 
- 프로젝트 문서 업데이트`,remark:null,image:["static/images/cellImage_623845112_18.jpg"]},{index:23,topic:"ㄴ통합변경 통제수행",define:`- 모든 변경요청사항을 검토/승인/관리하고, 변경요청의 상태를 의사소통하는 프로세스 

- 변경통제: 베이스라인의 변경에 대해 통제하는 것 
- 형상통제: 제품, 서비스, 결과물의 주요 구성요소들에 대한 변경에 대해 통제하는 것`,head:`[투입물]
- 프로젝트 관리 계획서: 변경관리계획, 형상관리계획, 범위기준선, 일정기준선, 원가기준선 
- 프로젝트 문서: 산정기준치, 요구사항 추적매트릭스, 리스크 보고서
- 작업성과 보고서 
- 승인될 변경요청 
[도구 및 기법] 
- 변경통제회의(CCB)
- 변경통제도구(자동화툴)
- 데이터분석: 대안분석, 비용-편익분석 
- 의사결정: 투표, 독단, 다기준 의사결정 
[결과물]
- 승인된 변경요청 
- 변경관리대장
- 프로젝트 관리 계획서 
- 프로젝트 문서 갱신`,remark:null,image:["static/images/cellImage_623845112_19.jpg"]},{index:24,topic:"ㄴㄴ변경통제이점",define:"",head:`1) 변경요청 
- 변경요청은 구두로 요청될 수 있으나, 프로젝트 관리팀은 이를 문서화해야함 
- 변경요청은 변경통제절차에 따라 처리함

2) 영향력 검토 
- 변경요청시 CCB를 구성해 변경통제 회의를 열어, 변경요청을 검토한 후 승인/기각함`,remark:null,image:["static/images/cellImage_623845112_20.jpg","static/images/cellImage_623845112_21.jpg"]},{index:25,topic:"ㄴ프로젝트/단계종료",define:`- 프로젝트 공식 완료를 위해 모든 활동들을 종결하는 프로세스 

- 계약종료: 프로젝트 관련 계약 종료 
- 행정종료: 향후 프로젝트를 위한 교훈 등 기록과 정리`,head:`[투입물]
- 프로젝트 헌장
- 프로젝트 관리 계획서 
- 프로젝트 문서: 산정기준서, 변경사항 기록부, 이슈기록부, 교훈관리대장, 마일스톤 몽록, 요구사항 문서, 리스크 관리대장 등
- 수용된 인도물 
- 비즈니스 문서 
- 협약, 조달문서 
[도구 및 기법] 
- 데이터분석: 문서분석, 회귀분석, 추세분석, 차이분석 
- 회의 
[결과물]
- 프로젝트 문서 업데이트 
- 교훈관리대장
- 최종 결과물
- 최종 보고서`,remark:null,image:["static/images/cellImage_623845112_22.jpg"]},{index:26,topic:"ㄴㄴ종료절차",define:"",head:`*종료순서 
1) 기준 충족 확인 (중단시 이유 확인 및 계획)
2) 이관계획 
3) 기록수집, 성공/실패 평가 
4) 교훈정리, 프로젝트 자료 Archive 
5) 팀 해체`,remark:null,image:["static/images/cellImage_623845112_23.jpg","static/images/cellImage_623845112_24.jpg"]},{index:27,topic:"범위관리",define:`- 프로젝트를 성공적으로 완료하기 위해 반드시 필요한 작업만을 빠짐없이 프로젝트에 포함시키기 위해 필요한 프로세스 
- 하기로 한 모든 작업을 하고, 하기로 한 일만 하는 것`,head:`* 범위관리 프로세스 
[착수]
[계획수립] 
- 범위관리 계획수립 
- 요구사항 수집 
- 범위 정의 
- WBS 작성 
[실행]
[감시 및 통제]
- 범위 확인 
- 범위 통제 
[종료]`,remark:`빈출임, 외울 것
[두음]
계요범W확통`,image:[]},{index:28,topic:"ㄴ범위관리 계획수립",define:`- 프로젝트 범위를 정의/확인/통제하는 방법을 기술하는 범위관리 계획서를 만드는 프로세스 
- 프로젝트 범위추가(Scope Creep) 위험 감소 

- 프로젝트 전반에 걸쳐 프로젝트 범위를 관리하는 방법에 대한 지침과 방향 제공`,head:`[투입물]
- 프로젝트 헌장
- 프로젝트 관리 계획서: 품질관리계획서, 프로젝트 생애주기 기술서, 개발방식 
[도구 및 기법]
- 데이터 분석: 대안분석 
- 회의
[결과물]
- 범위관리 계획서 
- 요구사항관리 계획서`,remark:null,image:["static/images/cellImage_623845112_25.jpg"]},{index:29,topic:"ㄴ요구사항 수집",define:`- 프로젝트 목표 달성에 필요한 사항과 이해관계자의 요구사항을 판별하고 문서화하고 관리하는 프로세스 

- 프로젝트 범위를 정의 및 관리하는데 유용한 기준 제공 

* 요구사항 문서 작성 항목 (외기성논설소)-SRS
- 외부 인터페이스 요구사항 
- 기능요구사항 
- 성능요구사항 
- 논리적 데이터베이스 요구사항 
- 설계 제약사항 
- 소프트웨어 시스템 속성 

* 좋은 요구사항 요건: 명완검일수추개
- 명확성, 완전성, 검증가능성, 일관성, 수정가능성, 추적성, 개발 후 이용성`,head:`[투입물]
- 프로젝트 헌장
- 프로젝트 관리 계획서: 범위관리 계획서, 요구사항 관리 계획서, 이해관계자 참여 계획서 
- 프로젝트 문서: 가정사항 기록부, 교훈관리대장, 이해관계자 관리대장 
- 비즈니스 문서 
- 협약 
[도구 및 기법] - 인브포설벤 문투독다 친아명관심
- 데이터 수집: 인터뷰, 브레인스토밍, 포커스그룹, 설문조사, 벤치마킹 
- 데이터 분석 : 문서분석 
- 의사결정: 투표, 독단적 의사결정, 다기준 의사결정 분석 
- 데이터 표현: 친화도, 마인드맵, 컨텍스 다이어그램, 프로토타입 
- 대인관계 및 팀기술: 명목집단기법, 관찰, 심층워크샵 
[결과물]
- 요구사항 문서:비즈니스 요구사항, 이해관계자 요구사항, 솔루션(해결책) 요구사항, 프로젝트 요구사항
- 요구사항 추적 매트릭스`,remark:null,image:["static/images/cellImage_623845112_26.jpg"]},{index:30,topic:"ㄴ범위 정의",define:`- 프로젝트와 제품에 대한 상세 설명서를 개발하는 프로세스 

- 프로젝트 범위에 포함시킬 요구사항과 제외할 요구사항 정의`,head:`[투입물]
- 프로젝트 헌장
- 프로젝트 관리 계획서: 범위관리 계획서 
- 프로젝트 문서: 가정사항 기록부, 요구사항 문서, 리스크 관리대장  
[도구 및 기법]
- 데이터 분석: 대안분석 
- 의사결정: 다기준 의사결정 
- 대인관계 및 팀 기술: 촉진 
- 제품분석 
[결과물]
- 프로젝트 범위 기술서: 프로젝트 범위, 주요인도물, 가정, 제약을 기술한 문서 
- 프로젝트 문서 업데이트`,remark:null,image:["static/images/cellImage_623845112_27.jpg"]},{index:31,topic:"ㄴWBS 작성",define:`- 프로젝트 인도물과 프로젝트 작업을 더 작고 관리 가능한 요소로 세분화하는 프로세스 

- 인도물들에 대한 구조적 시각을 제공`,head:`[투입물]
- 프로젝트 관리 계획서: 범위관리 계획서 
- 프로젝트 문서: 프로젝트 범위기술서, 요구사항 문서  
[도구 및 기법]
- 분할 
[결과물]
- 범위기준선(Scope Baseline): 프로젝트범위기술서+WBS+WBS사전
- 프로젝트 문서 업데이트`,remark:null,image:["static/images/cellImage_623845112_28.jpg"]},{index:32,topic:"ㄴWBS 작성",define:`* WBS(Work Breakdown Structure)
- 프로젝트 팀에서 실행할 전체 작업범위를 계층구조로 세분해 놓은 계통도 
- 범위기술서에 명기된 범위를 구조적으로 분할하여 정의한 체계, 프로젝트 수행 모든 작업 표현 

* WBS 구성요소: 작계통분식사 
- 작업단위(Work Package): 최하위 작업 
- 계획단위(Planning Package): 일정 미확정
- 통제단위(Control Account): 성과측정을 위한 관리 통제 점 
- 분할(Decomposition): 세분화 기법 
- 식별코드(Code of Account): 작업패키지 식별자 
- WBS 사전: 각 구성요소에 대한 상세한 정보`,head:`* WBS 작성 기법
- 연동계획(Rolling Wave Planning) : 완료시점이 너무 먼 인도물이나 하부구성요소는 합의를 기다렸다가 작성하는 방법
- Level: 통상적으로 3~5단계 분할 
- WP 크기: 전체 작업의 1~10% 규모, 80시간/10일/2주 이내 작업 완료 가능한 크기 
- 100% Rule: MECE하게 모든 작업 구성 (Total Program > Project > Task >Sub Task > Work Package) 
- WBS 완성시점: 각 작업패키지에 통제단위를 설정하고 작업패키지에 대한 고유 식별코드 지정 시`,remark:null,image:["static/images/cellImage_623845112_29.jpg"]},{index:33,topic:"ㄴ범위 확인",define:`- 완료된 프로젝트 인도물의 인수를 공식화 하는 프로세스 
- 고객은 품질통제 프로세스에서 확인된 인도물이 만족스러운 수준으로 완료되었는지를 검토하고 공식적으로 인수 

- 인수 프로세스에 대한 객관적 타당성 제시하고, 각 인도물을 확인함으로써 최종제품/서비스/결과물 인수 가능성을 증대시킴

- 범위확인의 주안점: 인도물의 인수 
- 품질통제의 주안점: 인도물의 정확도와 품질요구사항 충족여부`,head:`[투입물]
- 프로젝트 관리 계획서: 범위관리 계획서, 요구사항관리 계획서 
- 프로젝트 문서: 교훈관리대장, 품질보고서, 요구사항 문서 
- 검증된 인도물 
- 작업성과 데이터 
[도구 및 기법]
- 검사(Inspection)
- 의사결정: 투표 
[결과물]
- 수용된 인도물 
- 작업성과 정보 
- 승인된 변경요청 
- 프로젝트 문서 업데이트`,remark:null,image:["static/images/cellImage_623845112_31.jpg"]},{index:34,topic:"ㄴ범위 통제",define:`- 프로젝트 및 제품 범위의 상태를 감시하고, 범위기준선에 대한 변경을 관리하는 프로세스 
- Scope Creep 금지: 모든 변경은 반드시 통합변경통제수행 프로세스를 통해 처리되어야 함 

- 프로젝트 전반에 걸쳐 범위기준선 유지 보장`,head:`[투입물]
- 프로젝트 관리 계획서: 범위관리 계획서, 요구사항관리 계획서, 변경관리 계획서, 형상관리 계획서, 범위 기준선, 성과측정 기준선 
- 프로젝트 문서: 교훈관리대장, 요구사항 문서 
- 작업성과 데이터
[도구 및 기법]
- 데이터분석: 차이분석, 추세분석 
[결과물]
- 작업성과 정보: 범위기준선 대비 진행 파악 후 필요시 변경요청 
- 승인된 변경요청 
- 프로젝트 관리계획서 업데이트
- 프로젝트 문서 업데이트`,remark:null,image:["static/images/cellImage_623845112_32.jpg"]},{index:35,topic:"ㄴㄴ통제되지 않는 범위 추가(Scope Creep)",define:`[정의] 고객이나 이해관계자의 요구사항의 관리오류로 인해서 프로젝트의 시간, 비용, 자원을 증가시키는 현상
[원인] 초기대응 미비(요구사항 도출 능력 미흡), 관리자역량 미흡, 이해관계자(의사소통 부재), 정형화된 프로젝트(고객요구 무시), 변경관리체계(범위변경 관리 대응력 부족)
[범위변경 절차] 프로세스 개발, 서비스 범위 확정, 고객 요구 확정, 공식 범위 체결, 타임 시트 기입
[예방방안]
1) 리뷰와 승인을 거치지 않은 변경 요구 허용 금지
2) 개발자에게 직접 요청하는 의사소통 채널 금지
3) 명확하고, 확고한 범위에 대한 명세
4) 체계적이고 구조화된 변화 관리 시스템 구축`,head:"",remark:null,image:[]},{index:36,topic:"ㄴㄴGold-plating",define:`[정의] 품질관리 시 고객이 요구한 것 이상으로 원하지도 않고 필요로 하지 않은 범위 이외의 기능이나 특성을 추가하여 비용과 일정을 초과하는 불필요한 SW 개발
[방지방안] 초과하지 않는 제안, 범위/기간/일정 현실화, 프로세스 정량화, 시각화(kanban, wbs, pms), 코드리뷰`,head:"",remark:null,image:[]},{index:37,topic:"일정관리",define:`- 프로젝트를 적시에 완료하도록 관리하는데 필요한 프로세스 

- 활동순서, 기간, 자원요구사항 및 일정 제약사항을 분석하여 프로젝트 일정 모델 수립 

- 활동 시작일과 종료일 결정 -> 프로젝트 팀원 배정 -> 할당된 활동 검토 -> 유효성 검토`,head:`* 일정관리 프로세스 
[착수]
[계획수립] 
- 일정관리 계획수립 
- 활동 정의 
- 활동순서 배열 
- 활동기간 산정 
- 일정 개발
[실행]
[감시 및 통제]
- 일정 통제 
[종료]`,remark:null,image:["static/images/cellImage_623845112_34.jpg"]},{index:38,topic:"ㄴ일정관리 계획수립",define:`- 프로젝트 일정을 기획/개발/관리/실행/통제하기 위한 방침과 절차를 수립하고 문서화하는 프로세스 

- 프로젝트 전반에 걸쳐 프로젝트 일정을 관리하는 방법에 대한 지침과 방향을 제공`,head:`[투입물]
- 프로젝트 헌장
- 프로젝트 관리 계획서: 범위관리 계획서, 개발방식 
[도구 및 기법]
- 데이터 분석 
- 회의 
[결과물]
- 일정관리 계획서: 프로젝트 일정모델 개발, 정확도 수준, 측정 단위, 통제한계선, 조직절차연계, 성과측정규칙, 보고형식, 프로세스 명세서, 릴리즈 및 반복 기간`,remark:null,image:["static/images/cellImage_623845112_35.jpg"]},{index:39,topic:"ㄴ활동 정의",define:`- 프로젝트 인도물을 산출하기 위해 수반할 활동들을 식별하고 문서화하는 프로세스 

- 프로젝트 작업의 산정, 일정계획, 실행, 감시 및 통제에 대한 기준을 제공하는 활동들로 작업패키지를 세분화 하는것

- 5.4 WBS 작성: 인도물관점에서 정의 
- 6.2 활동정의: 활동관점에서 정의`,head:`[투입물]
- 프로젝트 관리 계획서: 일정관리 계획서, 범위기준선 
[도구 및 기법]
- 분할: 활동분할 
- 연동기획: 점진적 상세화 
- 회의 
[결과물]
- 활동목록 
- 활동속성 
- 마일스톤 목록 
- 승인된 변경요청 
- 프로젝트 관리 계획서 업데이트`,remark:null,image:["static/images/cellImage_623845112_36.jpg"]},{index:40,topic:"ㄴ활동순서 배열",define:`- 프로젝트 활동 사이의 관계를 식별하여 문서화하는 프로세스 

- 주어진 모든 프로젝트 제약 아래 최고의 효율을 달성할 수 있도록 논리적 작업 순서를 정의`,head:`[투입물]
- 프로젝트 관리 계획서: 일정관리 계획서, 범위 기준선 
- 프로젝트 문서: 활동속성, 활동목록, 가정사항 기록부, 마일스톤 목록
[도구 및 기법]
- 선후행도형법 
- 의존관계 결정 및 통합 
- 선도 및 지연 
- 프로젝트 관리 정보시스템(PIMS) 
[결과물]
- 프로젝트 일정 네트워크 다이어그램 
- 프로젝트 문서 업데이트`,remark:null,image:["static/images/cellImage_623845112_38.jpg"]},{index:42,topic:"ㄴㄴ프로젝트 일정 네트워크 다이어그램",define:`* 프로젝트 일정 네트워크 다이어그램 
- 프로젝트 일정 활동간의 논리적 관계를 보여주는 도표 
- 최초/최종항목을 제외한 모든 활동과 마일스톤은 적어도 하나 이상의 선행항목과 후행항목에 연결되어야 함`,head:`= 의존관계 속성 4가지(의임외내): 2가지 속성은 동시에 적용될 수 있음 
1) 의무적 의존관계
- 활동의 본질/속성 혹은 계약이나 법에서 요구되는 관계(프로토타입 제작 후 테스트 수행)
2) 임의적 의존관계 
- 모범적 실무관행 지식에 따라 설정되는 관계(분석 후 설계)`,remark:`3) 외부 의존관계
- 프로젝트 활동과 비프로젝트 활동간의 관계(테스트는 하드웨어 납품되어야 수행 가능)
4) 내부 의존관계 
- 프로젝트 활동간 선/후행관계 의미(팀에서 기계조립 이후 테스트 수행)`,image:[]},{index:43,topic:"ㄴ활동기간 산정",define:`- 산정된 자원으로 개별 활동을 완료하는데 필요한 작업 기간 수를 산정하는 프로세스 
- 프로젝트 팀원을 직접 참여시킴으로써 정확도 및 책임 향상 가능 

- 각 활동을 완료하기 위해 소요되는 시간을 산정`,head:`[투입물]
- 프로젝트 관리 계획서: 일정관리 계획서, 범위기준선 
- 프로젝트 문서: 활동속성, 활동목록, 가정사항 기록부, 교훈관리대장, 마일스톤 목록, 팀 배정표, 자원분류체계, 자원달력, 자원요구사항, 리스크 관리대장 
[도구 및 기법] 유모3예 
- 유사 산정, 모수 산정, 3점 산정, 예비 분석
[결과물]
- 활동기간 산정치 
- 산정 기준서 
- 프로젝트 문서 업데이트`,remark:null,image:["static/images/cellImage_623845112_47.jpg"]},{index:44,topic:"ㄴㄴPERT",define:"",head:`* 유모3예
- 유사산정: 과거 유사프로젝트 정보 활용 기간 및 원가 추정
- 모수산정: 경험을 근거로 통계적 관계를 사용하여 산정 
- 3점산정: 불확실성과 리스크 고려, PERT(기대값=(낙관치+비관치+최빈치*4)/6)
- 예비분석: 활동기간 산정시 버퍼를 추가하여 기간을 계산(우발사태예비비, 관리예비비)`,remark:null,image:["static/images/cellImage_623845112_48.jpg"]},{index:45,topic:"ㄴ일정 개발",define:`- 활동순서, 기간, 자원요구사항 및 일정 제약사항을 분석하여 프로젝트 일정 모델을 수립하는 프로세스 

- 일정활동, 기간, 자원, 자원 이용가능성, 논리적 관계를 일정 수립도구에 입력하여, 프로젝트 활동들을 완료하기 위한 계획일자를 가진 일정모델 산출`,head:`[투입물]
- 프로젝트 관리 계획서: 일정관리 계획서, 범위기준선 
- 프로젝트 문서: 활동속성, 활동목록, 가정사항 기록부, 산정기준서, 기간산정치, 교훈관리대장, 마일스톤 목록, 프로젝트 일정 네트워크도, 팀 배정표, 자원달력, 자원요구사항, 리스크 관리대장  
- 협약
[도구 및 기법]
- 일정네트워크 분석: 일정모델 생성, 다양한 분석 기법사용(CPM, CCM, what-if 등) 
- 주공정경로법(CPM) 
- 모델링 기법 
- 자원최적화 기법 
- 주공정연쇄법(CCM)
- 일정단축기법 
- 애자일 릴리즈 계획 
[결과물]
- 일정기준선(Schedule Baseline)
- 프로젝트 일정(Project Baseline): 네트워크 다이어그램, bar 차트, 간트차트, 마일스톤 차트
- 프로젝트 관리 계획서 업데이트 
- 프로젝트 문서 업데이트`,remark:null,image:["static/images/cellImage_623845112_50.jpg"]},{index:41,topic:"ㄴㄴ배열 그림",define:"",head:"",remark:"이동",image:["static/images/cellImage_623845112_51.jpg"]},{index:46,topic:"ㄴㄴCPM(주공정경로법)",define:`* CPM(Critical Path Method): 주공정경로법 
- 최소프로젝트 기간산정, 일정 유연성 확인 가능 
- 자원제약을 고려하지 않음 
- 모든 활동에 대한 ES/EF/LS/LF를 계산 

= 주요 용어 
- ES(Early Start): 빠른 개시일
- EF(Early Finish): 빠른 종료일  
- LS(Late Start): 늦은 개시일 
- LF(Late Finish): 늦은 종료일 
- TF(Total Float): 총 여유 
- FF(Free Float): 자유여유 

- Forward Pass(전진계산): 시작부터 순서대로 모든 활동의 ES, EF를 계산하는 방법(좌->우)
- Backword Pass(후진계산): 종료부터 역순으로 모든 활동의 LF, LS를 계산하는 방법 

- Critical Path(주공정경로): 프로젝트 일정네트워크도에서 가장 긴 경로(Total Float이 0인 활동들로 이루어진 경로)`,head:`* 모델링 기법 
1) 가정 시나리오 분석(What-if 시나리오 분석)
- 시나리오를 설정하고 프로젝트 목표에 미치는 긍정/부정 영향력을 예측하기 위해 시나리오들을 평가하는 것
- 리스크 관리-> 완화계획과 비상계획
2) 시뮬레이션 
- 각 활동별로 가능한 활동 기간의 분포를 정의하고 이를 통해 여러가지 프로젝트 기간을 계산하여 전체 프로젝트의 가능한 일정분포를 검토하는 것임 
- 몬테카를로 시뮬레이션

- Total Float : LS-ES, LF-EF
- Free Float : 후행ES-해당EF`,remark:null,image:["static/images/cellImage_623845112_52.jpg","static/images/cellImage_623845112_53.jpg"]},{index:47,topic:"ㄴㄴ자원최적화기법",define:`* 자원최적화 기법 
- 자원의 수요/공급으로 인해 일정모델을 조정하기 위해 활용되는 기법
- 자원제약 고려

1) 자원평준화(Resource Leveling) - 업무분담
- 이용가능한 공급량을 가진 자원에 대한 수요의 균형을 맞추기 위해 자원제약을 기초로 시작일과 종료일을 조정하는 방법 
- 보통 일정이 길어지게 됨
2) 자원평활화(Resource Smoothing) - 남는 자원 사용
- 프로젝트에 대한 자원요구사항이 미리 정해진 자원 한도를 초과하지 않도록 일정모델의 활동을 조정하는 기법
- 모든 자원을 최적화시키지는 못함, 일정지연 없음`,head:"",remark:`* 납기 지연 원인 
- 파킨슨법칙: 빨리 끝낼 수 있어도 천천히 수행해서 납기를 맞추려고 함 
- 학생증후군: 완료일자가 가까워지기 전까지는 작업에 집중하지 않음 
- 자기보호본능(머피의 법칙): 작업을 빨리 끝내면 관리자들은 다음번에 다 짧은 납기를 요구함 
- 자원 준비 부족: 일찍 완료해도 다음 활동의 자원이 준비되지 못하면 일정 지연됨 
- 멀티태스킹으로 인한 일정 지연: 활동 파악을 위한 시간이 추가적으로 소요됨`,image:["static/images/cellImage_623845112_54.jpg"]},{index:48,topic:"ㄴㄴ일정단축기법",define:`* 일정단축기법 - 크자패병 
- 프로젝트 범위를 변경하지 않는 한도에서 일정을 단축하는 방법 

1) Fast Tracking(공정중첩법) 
- 순차적으로 진행되는 활동 혹은 단계의 연관관계를 재조정 하는 방법(병행수행)
- 장점: 추가자원 투입 필요없음 
- 단점: 재작업 발생가능, 리스크 증가`,head:"",remark:null,image:["static/images/cellImage_623845112_55.jpg","static/images/cellImage_623845112_56.jpg"]},{index:49,topic:"ㄴㄴ일정단축기법",define:`2) Crashing(공정압축법)
- 활동에 추가 자원을 투입하여 일정을 단축시키는 기법 
- 적용원칙: cp상의 활동 대상 > 비용대비 효과적 활동 확인 > 자원 한단위씩 투여하여 cp가 변경되는지 확인 
- 특징: 추가 자원이 있을 때 활용, 추가자원을 투입하여도 작업기간 단축을 보장할 수 없음 
- 단점: 원가상승, 리스크 증가`,head:"",remark:null,image:["static/images/cellImage_623845112_57.jpg","static/images/cellImage_623845112_58.jpg"]},{index:50,topic:"ㄴ일정 통제",define:`- 계획을 달성하기 위해 프로젝트 상태를 감시하여, 프로젝트의 진척상황을 갱신하고, 일정기준선에 대한 변경을 관리하는 프로세스 

- 계획대비 차이를 파악하는 수단을 제공하고, 시정/예방조치를 취하여 리스크 최소화`,head:`[투입물]
- 프로젝트 관리 계획서: 일정관리 계획서, 일정기준선, 범위기준선, 성과측정기준선 
- 프로젝트 문서: 교훈관리대장, 프로젝트 달력, 프로젝트 일정, 자원달력, 일정데이터 
- 작업성과 데이터
[도구 및 기법]
- 데이터 분석: 획득가치 분석(EVM), 반복 번다운 차트, 성과검토, 추세분석, 차이분석, 가정형 시나리오 분석 
- 프로젝트 관리 정보 시스템 
- 자원최적화 
- 선도 및 지연 
- 일정단축 
[결과물]
- 작업성과 정보 
- 일정예측 
- 승인된 변경요청 
- 프로젝트 관리 계획서 업데이트 
- 프로젝트 문서 업데이트`,remark:null,image:["static/images/cellImage_623845112_59.jpg"]},{index:51,topic:"원가관리",define:"- 승인된 예산 범위에서 프로젝트가 완료될 수 있도록 원가를 기획 및 산정하고, 예산을 책정하고, 필요한 자금을 조성 및 집행하고 원가를 통제하는 과정에서 수행되는 프로세스들을 포함",head:`* 원가관리 프로세스 
[착수]
[계획수립] 
- 원가관리 계획수립 
- 원가 산정 
- 예산 책정
[실행]
[감시 및 통제]
- 원가 통제 
[종료]`,remark:null,image:["static/images/cellImage_623845112_60.jpg"]},{index:52,topic:"ㄴㄴ그림",define:"",head:"",remark:null,image:["static/images/cellImage_623845112_61.jpg"]},{index:53,topic:"ㄴ원가관리 계획수립",define:`- 프로젝트 원가를 기획/관리/지출/통제하기 위한 방침과 절차를 수립하고 문서화하는 프로세스 

- 프로젝트에서 원가를 관리하는 방법에 대한 지침과 방향을 제공`,head:`[투입물]
- 프로젝트 헌장
- 프로젝트 관리 계획서: 일정관리 계획서, 리스크관리 계획서 
[도구 및 기법]
- 데이터 분석 
- 회의 
[결과물]
- 원가관리 계획서: 프로세스 설명, 측정단위, 정밀도 수준, 정확도 수준, 조직절차연계, 통제한계선, 성과측정규칙, 보고형식`,remark:null,image:["static/images/cellImage_623845112_62.jpg"]},{index:54,topic:"ㄴ원가 산정",define:`- 프로젝트 활동을 완료하는데 필요한 금전적 자원의 근사치를 개발하는 프로세스 
- 프로젝트가 진행될 수록 산정치의 정확도는 증가 

- 프로젝트 작업을 완료하기 위해 필요한 원가 결정`,head:`[투입물]
- 프로젝트 관리 계획서: 원가관리 계획서, 품질관리 계획서, 범위기준선 
- 프로젝트 문서: 교훈관리대장, 프로젝트 일정, 자원요구사항, 리스크 관리대장
[도구 및 기법] 두음 전유모3상
- 전문가 산정
- 유사산정 
- 모수산정 
- 상향식 산정법
- 3점산정 
- 데이터분석: 대안분석, 예비분석, 품질비용 
- 프로젝트 관리 정보 시스템 
- 의사결정: 투표 
[결과물]
- 원가 산정치(WBS 단위) 
- 산정 기준서 
- 프로젝트 문서 업데이트`,remark:null,image:["static/images/cellImage_623845112_63.jpg"]},{index:55,topic:"ㄴ예산 책정",define:`- 개별활동 혹은 작업 패키지별로 산정된 원가를 합산하여 승인된 원가기준선을 설정하는 프로세스 

- 프로젝트 성과를 감시 및 통제할 수 있는 기준이 되는 원가기준선을 결정하는 것 

* 총 자금 요구사항 = 원가기준선 + 관리예비비`,head:`[투입물]
- 프로젝트 관리 계획서: 원가관리 계획서, 자원관리 계획서, 범위기준선 
- 프로젝트 문서: 산정기준치, 원가산정치, 프로젝트 일정, 리스크 관리대장 
- 비즈니스 문서 
- 협약 
[도구 및 기법]
- 원가 합산: WBS에 따라 작업패키지 별로 원가 산정치 합산 
- 데이터 분석: 예비분석 
- 선례정보 검토 
- 자금한도 조정 
- 자금조달 
[결과물]
- 원가기준선: 범위, 일정, 원가가 합쳐진 것으로 성과측정의 기준선이 됨 
- 프로젝트 자금 요구사항(원가기준선+관리예비비)
- 프로젝트 문서 업데이트`,remark:null,image:["static/images/cellImage_623845112_66.jpg"]},{index:56,topic:"ㄴ원가 통제",define:`- 프로젝트 상태를 감시하면서 프로젝트 예산을 갱신하고 원가기준선에 대한 변경을 관리하는 프로세스 

- 승인된 예산에 대한 증액은 통합변경 수행 프로세스를 통해서만 승인을 얻을 수 있음 

- 시정조치를 취하고, 리스크를 최소화하기 위해, 계획대비 차이를 파악하기 위한 수단을 제공한다는 것`,head:`[투입물]
- 프로젝트 관리 계획서: 원가관리 계획서, 원가 기준선, 성과측정 기준선 
- 프로젝트 문서: 교훈관리대장 
- 프로젝트 자금 요구사항 
- 작업성과 데이터 
[도구 및 기법]
- 데이터 분석: 획득가치관리(EVM), 차이분석, 추세분석, 예비분석 
- 완료성과지수 
- 프로젝트 관리 정보 시스템 
[결과물]
- 작업성과 정보 
- 원가 예측치 
- 승인된 변경요청 
- 프로젝트 관리 계획서 업데이트 
- 프로젝트 문서 업데이트`,remark:null,image:["static/images/cellImage_623845112_67.jpg"]},{index:57,topic:"ㄴㄴEVM(획득가치관리)",define:`* 획득가치관리(EVM) 
- 프로젝트의 범위, 일정, 자원 측정치를 모두 결합하여 프로젝트 성과 및 진척율을 평가하는 방법론 

= 측정지표
- 계획가치(PV: Planned Value): 특정시점까지 완료해야하는 물리적 작업량 표현 
- 획득가치(EV: Earned Value): 특정시점까지 실제 수행한 작업에 할당되었던 예상금액 
- 실제원가(AC: Actual Cost): 특정시점까지 실제 수행한 작업에 할당되었던 예산금액 
- 완료시점예산(BAC: Budget At Completed): 수행할 작업에 대해 책정된 모든 예산의 합계`,head:`* 분석지표
- 원가차이(CV: Cost Variance)
원가성과에 대한 측정치, CV=EV-AC 
- 일정차이(SV: Schedule Variance) 
일정성과에 대한 측정치, SV=EV-PV
- 원가성과지수(CPI: Cost Performance Index)
완료한작업의 원가효율성에 대한 측정치, CPI=EV/AC 
- 일정성과지수(SPI: Schedule Performance Index)
일정효율성에 대한 측정치, SPI=EV/PV`,remark:`* 예측지표 
- 잔여분 산정치(ETC: Estimate To Completion)
현재시점부터 프로젝트 완료시까지의 총 예상금액, ETC=BAC-EV 
- 완료시점 산정치(EAC: Estimate At Completion) 
프로젝트 완료시까지의 총 예상금액, EAC=ETC+AC
- VAC(완료시점차이) : BAC - EAC( < 0 : 망함)
- 완료성과지수(TCPI: To-Complete Performance Index) 
지정된 관리목표를 달성하기 위해 잔여 작업에서 반드시 달성해야만 하는 원가성과 측정치, TCPI=잔여작업/잔여잔금=BAC-EV/BAC-AC`,image:[]},{index:58,topic:"품질관리",define:`- 프로젝트의 요구사항을 충족할 수 있도록 품질정책, 품질목표, 품질책임사항을 결정하고 관리하는 프로세스 

* 품질관리 활동 중요성 
- 고객만족 
- 검사보다 예방우선 
- 지속적인 개선 
- 관리 책임`,head:`* 품질관리 프로세스 
[착수]
[계획수립] 
- 품질관리 계획수립 
- 품질관리(품질보증) 
[실행]
[감시 및 통제]
- 품질 통제 
[종료]`,remark:null,image:["static/images/cellImage_623845112_70.jpg"]},{index:59,topic:"ㄴ품질관리 계획수립",define:`- 프로젝트, 인도물에 대한 품질 요구사항 및 품질표준을 식별하고 프로젝트에서 이를 준수하는 방법을 문서화하는 프로세스 

- 프로젝트에서 품질을 관리하고 확인하는 방법에 대한 방향/지침을 제공한다는 것

- 품질관리 : 품질통제, 품질관리`,head:`[투입물]
- 프로젝트 헌장
- 프로젝트 관리 계획서: 요구사항관리 계획서, 리스크관리 계획서, 이해관계자 참여계획서, 범위 기준선 
- 프로젝트 문서: 가정사항 기록부, 요구사항 문서, 리스크 관리대장, 이해관계자 관리대장 
[도구 및 기법]
- 데이터 수집: 벤치마킹, 브레인스토밍, 인터뷰 
- 데이터 분석: 비용-편익분석, 품질비용 
- 의사결정: 다기준 의사결정 
- 데이터 표현: 순서도, 논리 데이터 모델, 매트릭스도, 마인드매핑 
- 테스트 및 검사 계획 수립 
- 회의 
[결과물]
- 품질관리 계획서: 프로세스 개선계획서
- 품질 매트릭스(지표), 품질점검목록(통제시 사용) 
- 프로젝트 관리 계획서 업데이트 
- 프로젝트 문서 업데이트`,remark:null,image:["static/images/cellImage_623845112_72.jpg"]},{index:60,topic:"ㄴㄴ품질관리도구(QC) - 정량적 측정",define:`* 7개 기본 품질관리도구(QC7)-정량적 측정 
관어파체산히흐 / 체히파어산흐관
1) 관리도
- 프로세스가 안정적인지, 예상한 성과를 달성했는지를 판별하는데 활용 

- USL/LSL(최고/최저 관리한계): 프로세스의 허용 가능한 편차의 범위, 관리상태하에 있음(--점선표시)
- USL/LSL(최고/최저 규격한계): 성과나 품질에 대한 고객의 기대사항이나 계약적인 요구사항(ㅡ실선표시) 
- Out of Control: 프로세스가 관리하에 있지 않다는 의미, UCL/LCL 바깥쪽에 점이 있는 경우, Rule of Seven인 경우 

- Rule of Seven: Data Point가 연속적으로 평균 위에 혹은 아래에 7개 이상 위치하거나, 연속적으로 같은 기울기를 가지고 있는 경우 
- 이상원인(가피원인): 피할수 있는 원인(15~20%)->현장에서 시정조치 가능
- 불가피원인: 피할수 없는 원인(80~85%)->경영진 참여 필요`,head:`2) 어골도(인과관계도)
- 문제를 발생시키는 다양한 원인들이 서로 어떻게 연관되어 있는지를 보여주는 도표 
- 관리도에서 탐지된 특별한 변동에 대한 이상원인을 연결하여 찾아내는데 유용

3) 파레토도표 
- 발생빈도순서대로 정렬한 형태의 수직 막대 차트
- 가장 발생빈도가 높은 원인에 대해 먼저 시정조치를 취해야 한다는 것을 의미 
- 문제를 발생하는 원인 20%를 잡으면 문제의 80% 해결 가능

4) 체크시트, 점검표
- 자료를 수집할 때 점검목록으로 활용 
- 결함파악을 위한 검사를 진행하는 과정에서 속성자료를 수집하려 할 때 유용`,remark:null,image:["static/images/cellImage_623845112_73.jpg"]},{index:61,topic:"ㄴㄴ품질관리도구(QC) - 정량적 측정",define:`5) 산점도(Scatter Diagram), 상관관계도표
- 두 변수간의 관계를 보여주는 도표 
- 종속변수 대 독립변수 함수로 그리며, 점들이 대각선에 근접할 수록 밀접한 상관관계가 있음 

6) 히스토그램 
- 통계분포의 중심집중경향, 분산, 모양을 보여주는 막대차트 
- 시간의 영향 고려하지 않음 
- 빈도수에 따라 정리하지 않음`,head:`7) 흐름도, 순서도(Flowcharts)
- 하나 이상의 투입물을 하나 이상의 산출물로 변환하는 프로세스를 위해 존재하는 일련의 단계와 분기 가능성 표현 
- SIPOC 모델의 수평가치사슬에 존재하는 운영절차의 상세사항을 대응시켜 프로세스의 전반적인 순서, 활동, 의사결정지점, 분기루프, 병렬 경로를 보여줌 
- SIPOC: 공급자(Supplier), 투입(Input), 프로세스(Process), 산출(Output), 고객(Customer)의 약자`,remark:null,image:["static/images/cellImage_623845112_74.jpg"]},{index:62,topic:"ㄴㄴ품질관리도구(신QC) - 정성적 측정",define:`* 신 품질관리도구(신QC7)-정성적 측정 
친연계 매매P애
1) 친화도
- 여러가지 아이디어를 이해하기 쉽도록 유사성이나 연관성에 따라 묶는 방법

 

2) 연관도, 상호관계도 
- 관련 항목들이 서로 꼬여 있는 논리 관계를 가진 상당히 복잡한 시나리오들에 창의적 문제 해결을 위한 프로세스 제공
- 원인 > 언어DATA포착 > 1,2차원인전개`,head:`3) 계통도 
- 설정한 목적을 달성하기 위해서 목적과 수단의 계열을 계통적으로 전개함으로써 최적의 수단을 탐색하는 방법
- WBS, OBS 같은 계층분해 구조를 표현하기 위해 활용 
- Decision Tree 분석시 활용 

4) 매트릭스도 
- 매트릭스를 구성하는 열과 행간에 존재하는 요소들/원인들/목표들간의 관계강도를 제시해줌 
- 아이디어나 활동, 책임, 기능 등에 존재하는 논리적 연관성을 그래프에 표시함으로써 문제의 소재나 문제해결의 착상을 얻기 위해 사용하는 방법`,remark:null,image:["static/images/cellImage_623845112_75.jpg"]},{index:63,topic:"ㄴㄴ품질관리도구(신QC) - 정성적 측정",define:`5) 매트릭스 데이터 해석법 
- 매트릭스도의 여러 요소 간 관계의 정도를 수량화 
- 주성분분석이라고 불리는 다변량해석의 한 수법

6) PDPC(Process Decision Program Chart) 
- 업무를 수행해 나가는 과정에서 발생할 수 있는 모든 상황을 생각하며, 가장 바람직한 결과에 도달할 수 있도록 프로세스를 정하는 방법`,head:`7) 애로우 다이어그램, 활동네트워크도 
- AOA(Activity On Arrow), AON(Activity On Node) 형태 
- 목표 달성을 위해 시계열적 순서에 따라 화살표 이용한 네트워크로 최적 일정계획을 위한 진척도 확인 방법
- PERT, CPM, PDM 등과 같은 일정수립 방법론 활용`,remark:null,image:["static/images/cellImage_623845112_76.jpg"]},{index:64,topic:"ㄴ품질관리(품질보증)",define:`- 조직의 품질 정책을 프로젝트에 반영하여 품질관리 계획서를 실행 가능한 품질 관련 활동으로 변환하는 프로세스 

- 품질목표의 달성 확률을 높이고 비효율적인 프로세스와 품질 저하 원인 파악 가능

- 품질보증: 품질요구사항과 품질 통제 측정결과를 감시하여, 해당하는 품질표준과 운영상의 정의를 사용하고 있는지를 확인하는 프로세스 
- 프로세스들의 개선 촉진 

* 품질비용 - 예평/내외
1) 적합비용: 실패를 피하기 위해 지출된 비용 
- 예방비용: 고품격 제품 제작(교육, 품질계획비용) 
- 평가비용: 품질평가(테스트, 인스펙션, 감리) 
2) 부적합성 원가: 실패로 인해 지출된 비용 
- 내부 실패비용: 프로젝트에서 발견된 실패(재작업, 불량) 
- 외부 실패비용: 고객이 발견한 실패(재무, 보증작업, 사업손실, 반품)

* 지속적 개선의 종류 
- PDCA 사이클 
- CMMI
- 말콤 볼드리지 모델 
- OPM3`,head:`[투입물]
- 프로젝트 관리 계획서: 품질관리 계획서 
- 프로젝트 문서: 교훈관리대장, 품질통제 측정치, 품질 매트릭스, 리스크 보고서 
[도구 및 기법]
- 데이터 수집: 점검목록 
- 데이터 분석: 대안분석, 문서분석, 프로세스 분석, 근본원인 분석 
- 의사결정: 다기준 의사결정 
- 데이터 표현: 친화도, 인과관계도, 순서도, 히스토그램, 매트릭스도, 산점도 
- 품질감사: 프로젝트 활동이 조직과 프로젝트 정책, 프로세스, 절차를 준수하는지를 판별하기 위해 수행하는 체계적이고 독립적인 검토활동 
- DfX(Design for X)
- 문제해결 
- 품질관리 및 통제 도구(QC7, 신QC7)
- 품질개선방법 
[결과물]
- 품질 보고서 
- 테스트 및 평가문서 
- 승인된 변경요청
- 프로젝트 관리 계획서 업데이트 
- 프로젝트 문서 업데이트`,remark:null,image:["static/images/cellImage_623845112_77.jpg"]},{index:65,topic:"ㄴ품질관리(품질통제)",define:`- 품질활동의 실행결과를 감시하고 기록하면서, 성과를 평가하고 필요한 변경권고안을 제시하는 프로세스 
- 완전성, 준수 및 적합성 측정 
- 검사(Inspection) 해 입증하는것, 제품 품질 초점 

- 품질보증: 프로세스 대상(일하고 있는 방식 확인)
- 품질통제: 프로덕트 대상(인도물 결과 품질 확인) 

- 좋지 않은 프로세스 혹은 제품 품질의 원인을 파악하여 이를 제거하기 위한 조치를 권고하거나 실행 
- 프로젝트 인도물과 작업이 이해관계자가 최종인수 요건으로 명시한 요구사항을 충족하는지 검증`,head:`[투입물]
- 프로젝트 관리 계획서: 품질관리 계획서
- 프로젝트 문서: 교훈관리대장, 품질 매트릭스(지표), 테스트 및 평가 문서
- 승인된 변경요청 
- 인도물 
- 작업성과 데이터 
[도구 및 기법]
- 데이터 수집: 점검목록, 점검기록지, 통계적 표본추출, 설문조사 
- 데이터 분석: 성과검토, 근본원인 분석 
- 검사(Inspection): 작업제품이 문서화한 표준을 따르는지 판별하기 위해 제품을 조사하는 활동 
- 테스트/제품 평가
- 데이터 표현: 인과관계도, 관리도, 히스토그램, 산점도 
- 회의 
[결과물]
- 품질통제 측정치 
- 검증된 인도물 
- 작업성과 정보 
- 승인된 변경요청
- 프로젝트 관리 계획서 업데이트 
- 프로젝트 문서 업데이트`,remark:null,image:["static/images/cellImage_623845112_78.jpg"]},{index:66,topic:"자원관리",define:`- 프로젝트를 성공적으로 완료하는데 필요한 자원을 식별하고, 확보하여 관리하는 영역 

* 물적자원 -> 통제대상 
- 장비, 자재, 설비 및 기반시설 

* 인적자원 -> 관리대상 
- 팀 자원 또는 직원 
- 팀원을 조기에 참여시키면 계획수립 프로세스 동안 전문적인 식견을 제공받을 수 있으며, 프로젝트에 대한 헌신을 강화시킬 수 있음`,head:`* 자원관리 프로세스 
[착수]
[계획수립] 
- 자원관리 계획수립 
- 활동자원 산정 
[실행]
- 자원 확보 
- 팀 개발 
- 팀 관리
[감시 및 통제]
- 자원 통제 
[종료]`,remark:null,image:["static/images/cellImage_623845112_82.jpg"]},{index:67,topic:"ㄴ자원관리 계획수립",define:`- 물적 자원과 팀 자원을 산정, 확보 및 관리하고 활용하는 방법을 정의하는 프로세스 

- 프로젝트 역할과 책임, 프로젝트 조직도, 그리고 팀원 확보 및 복귀 예정 시간표가 포함된 팀원 관리 계획 수립`,head:`[투입물]
- 프로젝트 헌장
- 프로젝트 관리 계획서: 품질관리 계획서, 범위기준선  
- 프로젝트 문서: 프로젝트 일정, 요구사항 문서, 리스크 관리대장, 이해관계자 관리대장 
[도구 및 기법]
- 데이터 표현: 계층구조형 도표, 책임배정매트릭스, 텍스트 기반 도표
- 조직론 
- 회의 
'[결과물]
- 자원관리 계획서: 자원식별, 자원확보, 역할 및 담당업무, 권한, 역량, 조직도, 교육전략 
- 팀 헌장: 팀 가치, 협약 및 팀의 운영 지침을 규정하는 문서 
- 프로젝트 문서 업데이트`,remark:null,image:["static/images/cellImage_623845112_83.jpg"]},{index:69,topic:"ㄴ활동자원 산정",define:`- 프로젝트 작업을 수행하는데 필요한 자재, 장비 또는 보급품의 종류 및 수량과 팀 자원을 산정하는 프로세스 

- 프로젝트를 완료하기 위해 필요한 자원의 종류와 수량, 특성 식별`,head:`[투입물]
- 프로젝트 관리 계획서: 자원관리 계획서, 범위기준선  
- 프로젝트 문서: 활동속성, 활동목록, 가정사항기록부, 원가산정치, 자원달력, 리스크 관리대장 
[도구 및 기법]
- 상향식 산정법 
- 유사산정 
- 모수산정 
- 데이터분석: 대안분석 
- 프로젝트 관리 정보 시스템 
- 회의 
[결과물]
- 자원 요구사항
- 산정 기준서 
- 자원분류체계(RBS/OBS)
- 프로젝트 문서 업데이트`,remark:null,image:["static/images/cellImage_623845112_87.jpg"]},{index:70,topic:"ㄴ자원 확보",define:`- 프로젝트 작업을 완료하는데 필요한 팀원, 설비, 장비, 자재, 보급품 및 기타 자원을 확보하는 프로세스 

- 자원 선정에 관한 기본 지침과 방향을 제시하고 각각의 활동에 대해 자원할당`,head:`[투입물]
- 프로젝트 관리 계획서: 자원관리 계획서, 조달관리 계획서, 원가기준선  
- 프로젝트 문서: 프로젝트 일정, 자원달력, 자원 요구사항, 이해관계자 관리대장
[도구 및 기법]
- 의사결정: 다기준 의사결정
- 대인관계 및 팀 기술: 협상
- 사전배정: 팀원이 미리 선정되는 경우
- 팀 개발: 가상 팀 
[결과물]
- 실물 자원 배정표 
- 프로젝트 팀 배정표 
- 자원 달력: 팀원별 투입가능 기간 명시 
- 승인된 변경요청
- 프로젝트 관리 계획서 업데이트
- 프로젝트 문서 업데이트 
- 기업 환경요인 업데이트 
- 조직 프로세스 자산 업데이트`,remark:null,image:["static/images/cellImage_623845112_88.jpg"]},{index:71,topic:"ㄴ팀 개발",define:`- 프로젝트 성과를 향상시키기 위해 팀원의 역량과 팀원간 협력, 그리고 전반적인 팀 분위기를 개선하는 프로세스 

- 프로젝트 관리자는 우수한 팀 성과를 달성하고 프로젝트 목표를 충족하기 위해 프로젝트 팀을 식별, 구축, 유지, 동기부여, 통솔 및 격려하는 능력을 습득해야 함 
- Commitment(헌신): 목표 달성에 대한 팀원의 자발적인 합의 

- 팀워크 개선, 개인의 스킬과 역량향상, 동기부여, 이직율 감소 및 종합적인 팀 성과 개선`,head:`[투입물]
- 프로젝트 관리 계획서: 자원관리 계획서  
- 프로젝트 문서: 교훈관리대장, 프로젝트 일정, 팀 배정표, 자원달력, 팀 헌장
[도구 및 기법]
- 동일장소배치
- 팀 개발
- 의사소통 기술 
- 대인관계 및 팀 기술: 갈등관리, 영향력행사, 동기부여, 협상, 팀 구성
- 인정과 보상 
- 교육 
- 개인 및 팀 평가 
- 회의 
[결과물]
- 팀 성과 평가서 
- 승인된 변경요청
- 프로젝트 관리 계획서 업데이트
- 프로젝트 문서 업데이트 
- 기업 환경요인 업데이트 
- 조직 프로세스 자산 업데이트`,remark:null,image:["static/images/cellImage_623845112_89.jpg"]},{index:72,topic:"ㄴㄴ터크만의 팀빌딩 5단계",define:`* 터크만의 팀 빌딩 5단계 - 태혼안성휴(포스노페아)
- 팀 발달 단계에 따라 바람직한 리더십을 발휘하고 의사결정하도록 지원
(초기)
태동기(Forming): 역할과 책임 파악 - 지시 
(계획~실행)
혼돈기(Storming): 행동방식 및 프로젝트 관리방식 결정 - 코칭 
안정기(Norming): 신뢰 구축 시작 - 참여
성취기(Performing): 잘 조직된 단위로 운영 - 위임
(마무리)
휴회기(Adjourning): 마무리/해산 - 해체`,head:"",remark:null,image:["static/images/cellImage_623845112_90.jpg"]},{index:73,topic:"ㄴ팀 관리",define:`- 프로젝트 성과를 최적화하기 위하여 팀원의 성과를 추적하고 피드백을 제공하며 이슈를 해결하고 팀 변경사항을 관리하는 프로세스 

- 프로젝트 팀의 행동을 조율하고 갈등을 관리하고 이슈를 해결하며 팀원의 성과 평가`,head:`[투입물]
- 프로젝트 관리 계획서: 자원관리 계획서  
- 프로젝트 문서: 이슈기록부, 교훈관리대장, 팀 배정표, 팀 헌장 
- 작업성과 보고서 
- 팀 성과 평가서
[도구 및 기법]
- 대인관계 및 팀 기술: 갈등관리, 의사결정, 감성지능, 영향력 행사, 리더십
- 프로젝트 관리 정보 시스템 
[결과물]
- 승인된 변경요청
- 프로젝트 관리 계획서 업데이트
- 프로젝트 문서 업데이트 
- 기업 환경 요인 업데이트`,remark:null,image:["static/images/cellImage_623845112_91.jpg"]},{index:74,topic:"ㄴ갈등관리",define:`* 갈등관리 
- 팀 기본규칙, 그룹규범, 엄격한 프로젝트 관리 실무 관행은 갈등의 양을 감소시킴
- 일차적으로 프로젝트 팀원들을 스스로 갈등을 해결할 책임이 있으나 갈등이 고조되는 경우, PM은 이를 해결할 수 있도록 지원해야 함`,head:`* 갈등발생원인(일희개) 
- 일정우선순위 
- 희소자원
- 개인의 작업스타일

* 갈등 해결 방법 - 강철 절 협수
- 강요: 한 사람의 견해만 관철 
- 철회/회피: 갈등상황에서 물러나는 것 
- 절충/타협: 모든 당사자가 어느정도 만족할 수 있는 해결책 모색 
- 협력/문제해결: 여러관점에서 다양한 통찰력과 견해 통합 
- 수용: 차이를 보이는 영역보다 일치를 보이는 영역을 강조`,remark:null,image:["static/images/cellImage_623845112_92.jpg"]},{index:75,topic:"ㄴㄴ팀관리 이론: 동기부여이론",define:"",head:"",remark:`<강화 이론> 
 - 스키너�(조작적 조건형성),
 - 손다이크�(효과의 법칙)`,image:["static/images/cellImage_623845112_93.jpg","static/images/cellImage_623845112_94.jpg"]},{index:77,topic:"ㄴㄴ팀관리 이론",define:"",head:"순서변경",remark:null,image:["static/images/cellImage_623845112_97.jpg"]},{index:76,topic:"ㄴ자원 통제",define:`- 프로젝트에 할당되고 배정된 물적자원을 예정대로 사용할 수 있는지 확인하고 계획대비 실제 자원 사용을 감시하며 필요에 따라 시정조치를 수행하는 프로세스 

- 배정된 자원이 적시에 프로젝트 투입, 더이상 필요 없는 자원 해산`,head:`[투입물]
- 프로젝트 관리 계획서: 자원관리 계획서
- 프로젝트 문서: 이슈기록부, 교훈관리대장, 실물 자원배정표, 프로젝트 일정, 자원분류체계, 자원요구사항, 리스크 관리대장 
- 작업성과 데이터
- 협약
[도구 및 기법]
- 데이터 분석: 대안분석, 비용-편익분석, 성과검토, 추세분석 
- 문제해결
- 대인관계 및 팀 기술: 협상, 영향력 행사
- 프로젝트 관리 정보 시스템 
[결과물]
- 작업성과 정보
- 승인된 변경요청
- 프로젝트 관리 계획서 업데이트
- 프로젝트 문서 업데이트`,remark:null,image:["static/images/cellImage_623845112_99.jpg"]},{index:78,topic:"의사소통관리",define:"- 효과적인 정보교환을 위해 설계된 도구 개발과 활동 수행을 통해 프로젝트 이해관계자들의 정보 요구사항을 확실히 충족시키는데 필요한 프로세스들이 포함되는 영역",head:`* 의사소통관리 프로세스 
[착수]
[계획수립] 
- 의사소통관리 계획수립 
[실행]
- 의사소통관리
[감시 및 통제]
- 의사소통 감시 
[종료]`,remark:null,image:[]},{index:79,topic:"ㄴ의사소통관리 계획수립",define:`- 이해관계자 개개인 또는 그룹의 정보 요구사항과 가용한 조직 자산, 프로젝트 요구사항을 바탕으로 프로젝트에 적합한 의사소통 방식과 계획을 수립 

- 누구와 어떤 정보를 어떤 형식으로 언제 의사소통 할 것인지를 결정하는 것 

- 이해관계자와 가장 효율적/효과적 의사소통을 하기 위한 방법을 파악하여 문서화 

* 효과적인 의사소통 
-> 적합한 사람에게 올바른 정보를 적시에 제공 

* 효율적 의사소통 
-> 필요로 하는 정보만 제공`,head:`[투입물]
- 프로젝트 헌장
- 프로젝트 관리 계획서: 자원관리 계획서, 이해관계자 참여 계획서  
- 프로젝트 문서: 요구사항 문서, 이해관계자 관리대장 
[도구 및 기법]
- 의사소통 요구사항 분석 
- 의사소통 기술: 정보 전달 방법
- 의사소통 모델: 기본 발신자/수신자 의사소통 모델, 대화식 의사소통 모델
- 의사소통 방법: 정보 공유 방법 
- 대인관계 및 팀 기술: 의사소통 양식평가, 정치적 인식, 문화적 인식 
- 데이터 표현: 이해관계자 참여 평가, 매트릭스
- 회의 
[결과물]
- 의사소통 관리 계획서
- 프로젝트 관리 계획서 업데이트
- 프로젝트 문서 업데이트`,remark:null,image:["static/images/cellImage_623845112_100.jpg"]},{index:80,topic:"ㄴㄴ의사소통방법",define:`* 의사소통 방법: 정보 공유 방법 
1) 전달식 의사소통
- 정보를 필요로 하는 특정 수신자에게 일방적으로 전송하는 방식(메모, 메일, 보고서, 팩스 등) 
2) 유인식 의사소통 
- 방대한 정보 또는 수많은 수신자에게 사용하는 방법(온라인 학습, 교훈 데이터베이스, 지식저장소 등)
3) 대화식 의사소통 
- 둘 이상의 대화 상대자간 다각적으로 정보교환 수행(회의, 전화통화, 화상회의 등)`,head:`* 의사소통 모델 
1) 기본 발신자/수신자 의사소통 모델 
- 암호화, 복호화, 메시지 전송, 잡음, 인식/수신확인, 피드백/대응
- 발신자의 책임: 발신자는 확실하고 안전한 정보를 만들고, 수신자가 제대로 이해하는지를 확인할 책임이 있음
- 수신자의 책임: 전체 정보를 수신하여 올바로 이해하고, 수신했음을 알려줄 책임이 있음

2) 대화식 의사소통 모델 
- 기본+피드백, 수신확인`,remark:`* 의사소통 장애요인 
- 내용 해석의 오류 
- 정보의 여가(필터링) 
- 선택적 지각 
- 감정상태 
- 시간과 정보량 
- 상대방의 지식수준`,image:[]},{index:81,topic:"ㄴ의사소통관리",define:`- 프로젝트 정보를 적시에 적절한 방식으로 수집, 생성, 배포, 저장, 검색, 관리 및 감시하고 최종처리하는 프로세스 

- 프로젝트 이해관계자 간 효과적/효율적 의사소통을 가능하게 한다는 것`,head:`[투입물]
- 프로젝트 관리 계획서: 자원관리 계획서, 의사소통관리 계획서, 이해관계자 참여계획서  
- 프로젝트 문서: 변경사항기록부, 이슈기록부, 교훈관리대장, 품질보고서, 리스크 보고서, 이해관계자 관리대장 
- 작업성과 보고서
[도구 및 기법]
- 의사소통 기술
- 의사소통 방법 
- 의사소통 스킬: 의사소통 역량, 피드백, 비언어적 표현, 프리젠테이션 
- 프로젝트 보고
- 대인관계 및 팀 기술: 적극적 경청, 갈등관리, 문화적인식, 회의관리, 네트워킹, 정치적 인식
- 회의 
- 프로젝트 관리 정보 시스템 
[결과물]
- 프로젝트 의사소통
- 프로젝트 관리 계획서 업데이트
- 프로젝트 문서 업데이트 
- 조직 프로세스 자산 업데이트`,remark:null,image:["static/images/cellImage_623845112_102.jpg"]},{index:82,topic:"ㄴ의사소통 감시",define:`- 프로젝트와 이해관계자들의 정보 요구사항이 충족되는지 확인하는 프로세스 

- 의사소통관리 계획서와 이해관계자 참여 계획서에 정의된 대로 최적의 정보 소통 유지 가능`,head:`[투입물]
- 프로젝트 관리 계획서: 자원관리 계획서, 의사소통관리 계획서, 이해관계자 참여계획서  
- 프로젝트 문서: 이슈기록부, 교훈관리대장, 프로젝트 의사소통
- 작업성과 데이터
[도구 및 기법]
- 프로젝트 관리 정보 시스템
- 데이터 분석: 이해관계자 참여 평가 매트릭스
- 대인관계 및 팀 기술: 관찰/대화
- 회의 
[결과물]
- 작업성과 정보 
- 승인된 변경요청
- 프로젝트 관리 계획서 업데이트
- 프로젝트 문서 업데이트`,remark:null,image:["static/images/cellImage_623845112_103.jpg"]},{index:83,topic:"리스크관리(위험관리)",define:`* ISO31000
- 프로젝트에 대한 리스크 관리 기획, 식별, 분석, 대응 기획 및 감시를 수행하는 프로세스 

- 긍정적인 사건의 발생확률 및 영향력은 증가시키고, 
- 부정적인 사건의 발생확률 및 영향력은 감소시키는 것`,head:`* 리스크관리 프로세스 - 계식 성량 대 실감
[착수]
[계획수립] 
- 리스크관리 계획수립 
- 리스크 식별 
- 정성적 리스크 분석 수행 
- 정량적 리스크 분석 수행 
- 리스크 대응계획수립
[실행]
- 리스크 대응 실행
[감시 및 통제]
- 리스크 감시 
[종료]`,remark:null,image:[]},{index:84,topic:"ㄴ리스크관리 계획수립",define:`- 프로젝트에 대한 리스크 관리 활동의 수행방법을 정의하는 프로세스 

- 리스크 관리의 수준, 유형 및 가시성이 조직에서의 프로젝트 중요성 및 리스크에 모두 적합한지 확인`,head:`[투입물]
- 프로젝트 헌장
- 프로젝트 관리 계획서 
- 프로젝트 문서: 이해관계자 관리대장
- 작업성과 데이터
[도구 및 기법]
- 데이터 분석: 이해관계자 분석
- 회의 
[결과물]
- 리스크 관리 계획서: 리스크 전략, 방법론, 역할 및 책임, 자금조달, 예산책정, 시기선정, 리스크 범주, 리스크 발생확률과 영향력, P-I Matrix, 추적`,remark:null,image:["static/images/cellImage_623845112_104.jpg"]},{index:85,topic:"ㄴ리스크 식별",define:`- 프로젝트에 영향을 미치는 리스크를 식별하고 리스크의 특성을 문서화하는 프로세스 

- 사건을 예측할 수 있도록 프로젝트 팀에 제공할 현존 리스크와 관련 지식 및 역량을 문서화 

- 착수 및 계획 수립단계의 리스크 파악이 가장 중요`,head:`[투입물]
- 프로젝트 관리 계획서 
- 프로젝트 문서: 가정사항 기록부, 원가산정치, 기간산정치, 이슈기록부, 교훈관리대장, 요구사항 문서, 자원 요구사항, 이해관계자 관리대장 
- 협약 
- 조달문서
[도구 및 기법]
- 데이터 수집: 브레인스토밍, 점검목록, 인터뷰
- 데이터 분석: 원인분석, 가정 및 제약분석, SWOT 분석, 문제분석
- 대인관계 및 팀 기술: 촉진
- 촉발(prompt) 목록
- 회의: 델파이기법(전문가 합의) 
[결과물]
- 리스크 관리 대장: 식별된 리스크 목록, 잠재적 리스크 담당자, 잠재적 리스크 대응 목록 
- 리스크 보고서: 식별된 개별 리스크에 대한 요약 정보와 함께 포괄적 원인에 대한 정보 저장 
- 프로젝트 문서 업데이트`,remark:null,image:["static/images/cellImage_623845112_105.jpg"]},{index:86,topic:"ㄴ정성적 리스크 분석 수행",define:`- 리스크의 발생확률과 영향력을 평가하고 종합하여 심층분석 및 조치를 위한 리스크의 우선순위를 지정하는 프로세스(주관적 분석) 
- 위험을 개별로 분석 

* 우선순위에 영향을 미치는 요소 
- 발생가능성, 영향력, 대응기간, 리스크 허용한도 

- 빠른 분석이 가능, 비용대비 효율적 
- 정량적 리스크 분석을 수행하기 위한 기초 

- 프로젝트 관리자가 불확실성을 줄이고 우선순위가 높은 리스크에 주력할 수 있도록 함`,head:`[투입물]
- 프로젝트 관리 계획서 
- 프로젝트 문서 
[도구 및 기법]
- 데이터 수집: 인터뷰
- 데이터 분석: 리스크 데이터 품질평가, 리스크 확률-영향평가(P-I Matrix), 기타 리스크 모수평가 
- 리스크 분류
- 데이터 프레젠테이션: 확률-영향 매트릭스, 계층구조형 도표
- 회의 
[결과물]
- 프로젝트 문서 업데이트`,remark:null,image:["static/images/cellImage_623845112_106.jpg"]},{index:87,topic:"ㄴ정성적 리스크 분석 및 표현 기법",define:`1) 확률-영향 매트릭스(P-I Matrix)
- 개별 리스크의 발생확률과 영향력을 결합하여 리스크 등급을 표현한 매트릭스`,head:"",remark:null,image:["static/images/cellImage_623845112_107.jpg","static/images/cellImage_623845112_108.jpg"]},{index:88,topic:"ㄴ정량적 리스크 분석 수행",define:`- 확인된 리스크가 전체 프로젝트 목표에 미치는 영향을 수치로 분석하는 프로세스(객관적 분석) 
- 위험들을 종합적으로 분석(상호작용 포함)

- 프로젝트 불확실성을 줄이기 위해 의사결정을 뒷받침할 정량적 리스크 정보 생성`,head:`[투입물]
- 프로젝트 관리 계획서 
- 프로젝트 문서: 가정사항 기록부, 산정기준치, 원가산정치, 원가예측치, 기간산정치, 마일스톤 목록, 자원요구사항, 리스크 관리대장, 리스크 보고서, 일정예측 
[도구 및 기법]
- 데이터 수집: 인터뷰 
- 대인관계 및 팀 기술: 촉진 
- 불확실성 표현
- 데이터 분석: 시뮬레이션, 민감도 분석, 의사결정나무 분석, 영향관계도 
[결과물]
- 프로젝트 문서 업데이트`,remark:null,image:["static/images/cellImage_623845112_110.jpg"]},{index:89,topic:"ㄴㄴ정량적 리스크 분석 및 표현기법",define:`1) 시뮬레이션(몬테카를로 시뮬레이션) - What-If
- 확률분포를 가정해 모델을 만들고 난수를 발생시켜 원가/일정 측면의 준수 확률 계산`,head:"",remark:null,image:["static/images/cellImage_623845112_111.jpg"]},{index:90,topic:"ㄴ리스크 대응계획수립",define:`- 프로젝트 목표에 대한 기회는 증대시키고 위협은 감소시키기 위한 대안과 조치를 개발하는 프로세스 

- 필요한 경우 예산, 일정, 프로젝트 관리계획에 리스크 관리를 위한 자원, 활동을 추가하면서 우선순위에 따라 리스크에 대응`,head:`[투입물]
- 프로젝트 관리 계획서 
- 프로젝트 문서 
[도구 및 기법]
- 데이터 수집: 인터뷰 
- 대인관계 및 팀 기술: 촉진 
- 위협에 대한 전략: 회전완수+에 
- 기회에 대한 전략: 활공강수+에 
- 우발사태 대응 전략 
- 포괄적 리스크에 대한 전략
- 데이터 분석: 대안분석, 비용-편익 분석 
- 의사결정 
[결과물]
- 승인된 변경요청 
- 프로젝트 관리 계획서 업데이트
- 프로젝트 문서 업데이트`,remark:null,image:["static/images/cellImage_623845112_114.jpg"]},{index:91,topic:"ㄴㄴ위협에 대한 대응전략ㄴㄴ기회에 대한 대응전략ㄴㄴ우발사태 대응전략)",define:`* 위협에 대한 대응전략: 회전완수+에 
1) 회피(Avoid): 위협을 제거하거나 위협으로부터 보호하기 위해 취하는 대응전략 
- 일정연장, 전략변경, 범위축소, 프로젝트 중단 
2) 전가(Transfer): 위협의 영향을 제3자에게 이전하는 대응전략
- 보험활용, 이행보증, 각종 보증 및 보장, 외부 계약 
3) 완화(Mitigate): 리스크 발생가능성 혹은 영향력을 감소시키는 대응전략
- 덜 복잡한 프로세스 채택, 더 많은 테스트 수행, 프로토타입 개발 
4) 수용(Accept): 리스크를 파악했으나 리스크가 발생하기 전에는 어떤 조치도 취하지 않는 대응전략 
- 능동적 수용전략, 수동적 수용전략 
5) 에스컬레이션: 위협이 프로젝트 범위를 벗어나 제안된 대응책이 PM의 권한을 넘어설 수 있다는 데 동의하는 경우 사용`,head:`* 기회에 대한 대응전략: 활강공수+에 
1) 활용(Exploit): 기회가 확실히 실현되도록 불확실성을 제거하는 방법
- 유능한 자원 할당, 신기술 사용 등 
2) 강화/증대(Enhance): 기회의 확률 및 긍정적 영향을 증가시키기 위해 사용하는 전략
- 더 많은 자원 추가 등 
3) 공유/분담(Share): 프로젝트에 유리한 기회를 가장 잘 포착할 수 있는 제 3자에게 기회 소유권을 할당하는 것
- 협력사/팀/특수 목적회사/합작회사와 협력관계 구축 
4) 수용(Accept): 기회가 발생한다면 이익을 추구하지만, 발생하기 전에는 적극적으로 추구하지 않는 것
5) 에스컬레이션: 위협이 프로젝트 범위를 벗어나 제안된 대응책이 PM의 권한을 넘어설 수 있다는 데 동의하는 경우 사용`,remark:`* 우발사태 대응전략 
- 일부 대응책은 특정한 사건이 발생하는 경우에만 사용하기 위해 계획됨 
- 우발사태 대응계획 혹은 복구계획을 만드는 전략 

* 포괄적 프로젝트 리스크에 대한 전략 
- 회피 
- 활용 
- 전달/공유 
- 완화/증대 
- 수용`,image:[]},{index:92,topic:"ㄴ리스크 대응 실행",define:`- 합의된 리스크 대응 계획을 실행하는 프로세스 

- 위협은 최소화하고 기회는 최대화 하기 위해 합의된 리스크 대응 조치를 계획대로 정확히 실행`,head:`[투입물]
- 프로젝트 관리 계획서 
- 프로젝트 문서 
[도구 및 기법]
- 대인관계 및 팀 기술: 영향력 행사 
- 프로젝트 관리 정보 시스템 
[결과물]
- 승인된 변경요청 
- 프로젝트 문서 업데이트`,remark:null,image:["static/images/cellImage_623845112_115.jpg"]},{index:93,topic:"ㄴ리스크 감시",define:`- 프로젝트 전반에서 리스크 대응계획을 구현하고, 식별된 리스크를 추적하고, 리스크를 감시하고, 새로운 리스크를 파악하고, 리스크 처리를 평가하는 프로세스 

- 포괄적 프로젝트 리스크 노출도와 개별 프로젝트 리스크에 관한 최신 정보를 근거로 프로젝트 의사결정 수행 가능`,head:`[투입물]
- 프로젝트 관리 계획서 
- 프로젝트 문서 
- 작업성과 데이터 
- 작업성과 보고서
[도구 및 기법]
- 데이터 분석: 기술적 성과 분석, 예비분석 
- 리스크 감사: 식별된 리스크와 그 원인을 처리함에 있어 리스크 대응책의 효과와 리스크 관리 프로세스 효과를 평가하여 문서화 함
- 회의: 리스크 재평가 
[결과물]
- 작업성과 정보 
- 승인된 변경요청 
- 프로젝트 관리 계획서 업데이트
- 프로젝트 문서 업데이트 
- 조직 프로젝트 자산 업데이트`,remark:null,image:["static/images/cellImage_623845112_116.jpg"]},{index:94,topic:"조달관리",define:"- 프로젝트 팀 외부에서 제품, 서비스 또는 결과물을 구매하거나 획득하기 위해 필요한 프로세스",head:`* 조달관리 프로세스 
[착수]
[계획수립] 
- 조달관리 계획수립 
[실행]
- 조달 수행
[감시 및 통제]
- 조달 통제
[종료]`,remark:null,image:[]},{index:95,topic:"ㄴ조달관리 계획수립",define:`- 프로젝트 조달 결정사항을 문서화하고, 조달방식을 규정하며, 잠재 판매자를 식별하는 프로세스 

- 범위변경은 수용될수 있지만 계약가 상승은 일반적으로 수용되지 않음

* 계약 유형 (고원시)
1) 고정가 계약: 공급받기로 한 제품, 서비스 및 결과물에 대한 고정가 총액을 설정하는 계약유형 
- FFP(확정 고정가 계약): 고정가 확정
- FPIF(성과급 가산 고정가 계약): 고정가+성과급 
- FP-EPA(가격조정 조건부 고정가계약): 고정가+물가반영
2) 원가정산 계약(변동형계약?): 완료한 작업에 발생되는 모든 합법적 실제원가와 판매자의 수익에 해당하는 수수료를 판매자에게 지불하는 계약유형 
- CPFF(고정수수료 가산 원가계약): 초기산정비용+산정수수료
- CPIF(성과급가산 원가계약): CPFF+성과급 
- CPAF(보상금가산 원가계약): 주관적 성과기준 충족시 
3) 시간자재 계약: 원가정산 계약과 고정가 계약의 두 측면을 포함하는 복합형 계약`,head:`[투입물]
- 프로젝트 헌장 
- 비즈니스 문서
- 프로젝트 관리 계획서 
- 프로젝트 문서 
[도구 및 기법]
- 데이터 수집: 시장조사
- 데이터 분석: 제작-구매 분석
- 공급자 선정 분석
- 회의 
[결과물]
- 조달관리 계획서 
- 조달 문서 
- 입찰 문서: RFP, RFI, RFQ(견적요청서) 
- 조달 작업 기술서: 계약하에 완료해야할 작업에 대해 기술한 문서 
- 공급자 선정기준: 제안서의 등급이나 점수를 매기는데 사용되는 평가기준 
- 제작-구매 결정 
- 독립 원가 산정치 
- 승인된 변경요청
- 프로젝트 문서 업데이트 
- 조직 프로세스 자산 업데이트`,remark:null,image:["static/images/cellImage_623845112_117.jpg"]},{index:96,topic:"ㄴ조달 수행",define:`- 대상 판매자를 모집하여 판매자를 선정하고, 계약을 체결하는 프로세스 
- 입찰 및 제안서를 받고 사전에 정의된 선정기준을 적용하여 작업수행능력과 자격을 갖춘 판매자를 하나 이상 선정하는 프로세스 

- 적격 판매자를 선정하고 인도에 대한 법적 협약 체결 
- 체결된 협약을 통해 내/외부 이해관계자의 기대사항을 조율`,head:`[투입물]
- 프로젝트 관리 계획서 
- 프로젝트 문서 
- 조달 문서
- 판매자 제안서
[도구 및 기법]
- 광고 
- 입찰자 회의
- 데이터 분석: 제안서 평가
- 대인관계 및 팀 기술: 협상 
[결과물]
- 선정된 판매자 
- 협약  
- 승인된 변경요청 
- 프로젝트 관리 계획서 업데이트
- 프로젝트 문서 업데이트 
- 조직 프로세스 자산 업데이트`,remark:null,image:["static/images/cellImage_623845112_118.jpg"]},{index:97,topic:"ㄴㄴ제안서 평가기법",define:`* 제안서 평가기법: 복잡한 조달인 경우, 사전 정의된 가중치에 따라 판매자 응찰서를 평가하며, 구매자의 조달 정책에 따라 공식적인 평가 검토 프로세스 정의 

- Weighting System: 중요한 부분에 가중치를 두고 평가하는 방법 
- Screening System: 역량 미달 판매자들을 사전에 차단하는 방법 

- 독립산정: 조달 조직이 제안된 응찰에 대한 기준값으로 사용할 산정치`,head:"",remark:null,image:[]},{index:98,topic:"ㄴ조달 통제",define:`- 조달 관계를 관리하고 계약이행을 감시하며, 계약과 관련하여 필요한 사항을 변경 및 수정하고 계약을 종결하는 프로세스 

- 법적 협약의 조항에 따라 판매자와 구매자 모두의 성과가 조달 요구사항을 충족하도록 하는 것`,head:`[투입물]
- 프로젝트 관리 계획서 
- 프로젝트 문서 
- 협약
- 조달 문서
- 판매자 제안서 
- 승인된 변경요청 
- 작업성과 데이터
[도구 및 기법]
- 클레임 행정관리
- 데이터 분석: 조달 성과검토, 획득가치 분석(EVA), 추세분석 
- 검사
- 감사 
[결과물]
- 조달 종료 
- 작업성과 정보 
- 조달 문서 업데이트
- 승인된 변경요청 
- 프로젝트 관리 계획서 업데이트
- 프로젝트 문서 업데이트 
- 조직 프로세스 자산 업데이트`,remark:null,image:["static/images/cellImage_623845112_119.jpg"]},{index:99,topic:"이해관계자 관리",define:`- 프로젝트에 영향을 주거나 프로젝트 영향을 받는 사람/그륩/조직을 파악하고, 프로젝트에 대한 이해관계자 기대사항 및 영향력을 분석하여, 프로젝트 의사결정과 실행에 효과적으로 이해관계자를 참여시키기 위해 적합한 관리전략을 개발하기 위해 필요한 프로세스 

- 이해관계자 관리는 프로젝트 전체 단계에 걸쳐 수행해야 하며, 특히 프로젝트 착수 초기에서 수행하는 것이 중요`,head:`* 이해관계자 관리 프로세스 
[착수]
- 이해관계자 식별
[계획수립] 
- 이해관계자 참여 계획수립 
[실행]
- 이해관계자 관계(참여) 관리
[감시 및 통제]
- 이해관계자 관계(참여) 감시
[종료]`,remark:null,image:[]},{index:100,topic:"ㄴ이해관계자 식별",define:`- 프로젝트의 의사결정, 활동 또는 결과물에 영향을 주고나 영향을 받을 수 있는 개인, 집단 또는 조직을 식별하고, 
이해관계자가 프로젝트의 성공에 미칠 잠재적 영향력, 이해관계, 참여도, 상호 의존관계에 관한 정보를 분석하여 문서화 프로세스 

- 이해관계자의 관심, 관여도, 의존관계, 영향력 분석 
 
- 프로젝트 관리자가 이해관계자 별 또는 이해관계자 집단의 주안점 식별 가능`,head:`[투입물]
- 프로젝트 헌장 
- 비즈니스 문서
- 프로젝트 관리 계획서 
- 프로젝트 문서 
- 협약
[도구 및 기법]
- 데이터 수집: 설문조사, 브레인스토밍, 브레인라이팅
- 데이터 분석: 이해관계자 분석, 문서 분석 
- 데이터 표현: 이해관계자 매핑/표현
- 회의 
[결과물]
- 이해관계자 관리대장: 신원식별정보, 평가정보, 이해관계자 분류 
- 승인된 변경요청 
- 프로젝트 관리 계획서 업데이트
- 프로젝트 문서 업데이트`,remark:null,image:["static/images/cellImage_623845112_120.jpg"]},{index:101,topic:"ㄴㄴ이해관계자 분석 모델",define:`* 이해관계자 분석에 활용되는 다양한 표현모델 
[2개요소]
1) 권력/이해관계도: 권력과 프로젝트 결과물에 대한 관심도 수준으로 그룹화하는 방법 (경발기실)

2) 권력/영향도: 권력과 프로젝트의 적극적 참여도를 기준으로 그룹화하는 방법 

3) 영향/충격도: 프로젝트의 적극적 관여도와 프로젝트 계획수립/실행관련 변경에 영향을 미칠 수 있는 능력으로 그룹화하는 방법`,head:"",remark:null,image:["static/images/cellImage_623845112_121.jpg","static/images/cellImage_623845112_122.jpg"]},{index:102,topic:"ㄴㄴ이해관계자 분석 모델",define:"5) 이해관계자 큐브: 권력/이해관계도를 3차원 모델로 결합하여 프로젝트 관리자와 팀이 이해관계자 공통체를 식별하여 참여시키는데 활용하는 다차원적 모델",head:"",remark:null,image:["static/images/cellImage_623845112_125.jpg"]},{index:103,topic:"ㄴ이해관계자 참여 계획수립",define:`- 이해관계자의 요구사항, 이해관계, 프로젝트 성공에 미칠 수 있는 영향력 등의 분석 결과를 토대로 프로젝트 생애주기에 걸쳐 이해관계자의 효율적인 참여를 유도하는데 적합한 관리 전략을 개발하는 프로세스 

- 프로젝트 이해관계자의 원활한 소통에 필요한 실행 계획 제공`,head:`[투입물]
- 프로젝트 헌장 
- 프로젝트 관리 계획서 
- 프로젝트 문서 
- 협약
[도구 및 기법]
- 데이터 수집: 벤치마킹
- 데이터 분석: 가정 및 제약 분석, 원인 분석 
- 데이터 표현: 마인드매핑, 이해관계자 참여 평가 매트릭스
- 회의 
[결과물]
- 이해관계자 참여 계획서`,remark:null,image:["static/images/cellImage_623845112_126.jpg"]},{index:104,topic:"ㄴㄴ이해관계자 참여 평가 매트릭스",define:`* 이해관계자 참여 평가 매트릭스 
C는 현재 참여수준, D는 바람직한 참여수준
- 모르는 상태(비인지형): 프로젝트와 잠재적 영향력 인지 못하는 수준
- 반대(저항형): 프로젝트와 잠재적 영향력을 인지하고 있으며 변화에 저항하는 수준
- 중립형: 프로젝트를 인지하지만 지원도 반대도 하지 않음
- 지원형: 프로젝트와 잠재 영향력을 인지하며, 변화를 지지
- 리드(주도형): 프로젝트와 잠재적 영향을 인지하며, 프로젝트 성공을 위해 적극적으로 참여 

- 바람직한 참여수준의 참여를 위해 필요한 조치와 의사소통은 프로젝트 팀에서 전문가 판단을 활용하여 결정`,head:"",remark:null,image:["static/images/cellImage_623845112_127.jpg"]},{index:105,topic:"ㄴ이해관계자 관계(참여) 관리",define:`- 프로젝트 생애주기에 걸쳐 이해관계자의 요구/기대사항을 충족하기 위해 이해관계자와 의사소통 및 협력하고, 발생하는 이슈를 처리하며, 프로젝트 활동에 관련 이해관계자의 참여를 촉진하는 프로세스 

- 이해관계자의 지지는 확대하고 반발은 최대한 줄여서 프로젝트 성공률을 크게 증가시키는 것`,head:`[투입물]
- 프로젝트 관리 계획서 
- 프로젝트 문서 
[도구 및 기법]
- 의사소통 스킬: 피드백
- 대인관계 및 팀 기술: 갈등관리, 문화적 인식, 협상, 관찰/대화, 정치적 인식 
- 기본규칙 
- 회의 
[결과물]
- 승인된 변경요청
- 프로젝트 관리 계획서 업데이트
- 프로젝트 문서 업데이트: 이해관계자 관리 대장, 교훈관리 대장, 이슈기록부`,remark:null,image:["static/images/cellImage_623845112_128.jpg"]},{index:106,topic:"ㄴ이해관계자 관계(참여) 감시",define:`- 전체 프로젝트 이해관계자 관계를 감시하면서 이해관계자의 참여 전략 및 계획을 조정하는 프로세스 

- 프로젝트가 진화하고 환경이 변화함에 따라 이해관계자 참여 활동의 효율과 효과를 유지 또는 증대하는 것`,head:`[투입물]
- 프로젝트 관리 계획서 
- 프로젝트 문서 
- 작업성과 데이터
[도구 및 기법]
- 데이터 분석: 대안분석, 원인분석, 이해관계자 분석
- 의사결정: 다기준 의사결정, 투표 
- 데이터 표현: 이해관계자 참여 평가 매트릭스
- 의사소통 스킬: 피드백, 프리젠테이션 
- 대인관계 및 팀 기술: 적극적 경청, 문화적 인식, 리더십, 네트워킹, 정치적 인식
- 회의 
[결과물]
- 작업성과 정보
- 승인된 변경요청
- 프로젝트 관리 계획서 업데이트
- 프로젝트 문서 업데이트`,remark:null,image:["static/images/cellImage_623845112_129.jpg"]},{index:107,topic:"브룩스의 법칙(Brook's law)",define:`- 지연되는 프로젝트에 인력을 더 추가하면 프로젝트가 더 늦어진다는 이론 
- 의사소통 채널수 증가, 작업지연 발생
- 속도를 높이기 위해 단순히 프로젝트에 더 많은 리소스를 추가하는 순진한 접근 방식에 대한 경고로 인용 됨`,head:"",remark:null,image:[]}],a={subject:n,topics:e};export{a as default,n as subject,e as topics};
